
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
МестоХранения = Параметры.МестоХранения;
	Если Параметры.Свойство("Договор") Тогда
	Договор = Параметры.Договор;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
	Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
    ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
    ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
    Сообщить(ТекстСообщения);
   	КонецЕсли;
Материалы.Параметры.УстановитьЗначениеПараметра("НаДату",ТекущаяДата());
Материалы.Параметры.УстановитьЗначениеПараметра("МестоХранения",МестоХранения);
Номенклатура.Параметры.УстановитьЗначениеПараметра("НаДату",ТекущаяДата());
Номенклатура.Параметры.УстановитьЗначениеПараметра("МестоХранения",МестоХранения);
ДоговорныеПозиции.Параметры.УстановитьЗначениеПараметра("Владелец",Договор);
ДоговорныеПозиции.Параметры.УстановитьЗначениеПараметра("НаДату",ТекущаяДата());
ДоговорныеПозиции.Параметры.УстановитьЗначениеПараметра("МестоХранения",МестоХранения); 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
ЭтаФорма.Закрыть(ТаблицаМПЗ);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры

&НаСервере
Процедура ДобавитьМПЗ(НаименованиеSMD,Количество)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Материалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.НаименованиеSMD = &НаименованиеSMD";
Запрос.УстановитьПараметр("НаименованиеSMD", НаименованиеSMD);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = ТаблицаМПЗ.Добавить();
	ТЧ.МПЗ = ВыборкаДетальныеЗаписи.Ссылка;
	ТЧ.Количество = Количество;
	ТЧ.ЕдиницаИзмерения = ПолучитьОсновнуюЕдиницуИзмеренияПоБазовой(ВыборкаДетальныеЗаписи.Ссылка);
	Возврат;
	КонецЦикла;
Сообщить("МПЗ не найден!");
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ЭтаФорма.ВводДоступен() Тогда
	ОчиститьСообщения();
		Если Найти(Данные,"*") > 0 Тогда
		Массив = ОбщийМодульВызовСервера.РазложитьСтрокуВМассив(Данные,"$");
		ДобавитьМПЗ(Сред(Массив[0],2),Число(СтрЗаменить(Массив[2],"*","")));
		Иначе
		Сообщить("Неверный QRCode!");
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьЕдиницуИзмерения(МПЗ)
Возврат(СокрЛП(ПолучитьОсновнуюЕдиницуИзмеренияПоБазовой(МПЗ).Наименование));
КонецФункции

&НаКлиенте
Процедура МатериалыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
ВыбКол = 1;
	Если ЗапрашиватьКоличество Тогда
		Если Не ВвестиЧисло(ВыбКол,"Укажите количество ("+ПолучитьЕдиницуИзмерения(Значение)+")",14,3) Тогда
		Возврат;		
		КонецЕсли;
	КонецЕсли; 
МатериалыВыборЗначенияНаСервере(Значение,ВыбКол);
КонецПроцедуры

&НаСервере
Процедура МатериалыВыборЗначенияНаСервере(МПЗ,Количество)
ТЧ = ТаблицаМПЗ.Добавить();
ТЧ.МПЗ = МПЗ;
ТЧ.Количество = Количество;
ТЧ.ЕдиницаИзмерения = ПолучитьОсновнуюЕдиницуИзмеренияПоБазовой(МПЗ);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
ВыбКол = 1;
	Если ЗапрашиватьКоличество Тогда	
		Если Не ВвестиЧисло(ВыбКол,"Укажите количество ("+ПолучитьЕдиницуИзмерения(Значение)+")",14,3) Тогда
		Возврат;		
		КонецЕсли;
	КонецЕсли; 
НоменклатураВыборЗначенияНаСервере(Значение,ВыбКол);
КонецПроцедуры

&НаСервере
Процедура НоменклатураВыборЗначенияНаСервере(МПЗ,Количество)
ТЧ = ТаблицаМПЗ.Добавить();
ТЧ.МПЗ = МПЗ;
ТЧ.Количество = Количество;
ТЧ.ЕдиницаИзмерения = ПолучитьОсновнуюЕдиницуИзмеренияПоБазовой(МПЗ);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорныеПозицииВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
ВыбКол = 1;
	Если ЗапрашиватьКоличество Тогда	
		Если Не ВвестиЧисло(ВыбКол,"Укажите количество ("+ПолучитьЕдиницуИзмерения(Элементы.ДоговорныеПозиции.ТекущиеДанные.МПЗ)+")",14,3) Тогда
		Возврат;		
		КонецЕсли;
	КонецЕсли; 
ДоговорныеПозицииВыборЗначенияНаСервере(Элементы.ДоговорныеПозиции.ТекущиеДанные.МПЗ,ВыбКол);
КонецПроцедуры

&НаСервере
Процедура ДоговорныеПозицииВыборЗначенияНаСервере(МПЗ,Количество)
ТЧ = ТаблицаМПЗ.Добавить();
ТЧ.МПЗ = МПЗ;
ТЧ.Количество = Количество;
ТЧ.ЕдиницаИзмерения = ПолучитьОсновнуюЕдиницуИзмеренияПоБазовой(МПЗ);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого ТЧ Из НормыРасходов Цикл	
	ТЧ.Пометка = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из НормыРасходов Цикл	
	ТЧ.Пометка = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеФайл(Команда)
	Для каждого ТЧ Из ТаблицаМПЗ_Файл Цикл	
	ТЧ.Пометка = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсеФайл(Команда)
	Для каждого ТЧ Из ТаблицаМПЗ_Файл Цикл	
	ТЧ.Пометка = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ДобавитьВПодборНаСервере()
	Для каждого ТЧ Из НормыРасходов Цикл	
		Если ТЧ.Пометка Тогда
		Выборка = ТаблицаМПЗ.НайтиСтроки(Новый Структура("МПЗ",ТЧ.МПЗ));	
			Если Выборка.Количество() = 0 Тогда
			ТЧ_МПЗ = ТаблицаМПЗ.Добавить();
			ТЧ_МПЗ.МПЗ = ТЧ.МПЗ;
			ТЧ_МПЗ.Количество = ТЧ.Количество;
			ТЧ_МПЗ.ЕдиницаИзмерения = ТЧ.ЕдиницаИзмерения;				
			Иначе	
			Выборка[0].Количество = Выборка[0].Количество + ТЧ.Количество; 
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПодбор(Команда)
	Если ТаблицаМПЗ.Количество() > 0 Тогда
		Если Вопрос("Таблица подбора не пустая! Очистить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ТаблицаМПЗ.Очистить();	
		КонецЕсли;            	
	КонецЕсли;
ДобавитьВПодборНаСервере(); 
КонецПроцедуры 

&НаСервере
Процедура ДобавитьВПодборФайлНаСервере()
	Для каждого ТЧ Из ТаблицаМПЗ_Файл Цикл	
		Если ТЧ.Пометка Тогда
		Выборка = ТаблицаМПЗ.НайтиСтроки(Новый Структура("МПЗ",ТЧ.МПЗ));	
			Если Выборка.Количество() = 0 Тогда
			ТЧ_МПЗ = ТаблицаМПЗ.Добавить();
			ТЧ_МПЗ.МПЗ = ТЧ.МПЗ;
			ТЧ_МПЗ.Количество = ТЧ.Количество;
			ТЧ_МПЗ.ЕдиницаИзмерения = ТЧ.ЕдиницаИзмерения;				
			Иначе	
			Выборка[0].Количество = Выборка[0].Количество + ТЧ.Количество; 
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПодборФайл(Команда)
	Если ТаблицаМПЗ.Количество() > 0 Тогда
		Если Вопрос("Таблица подбора не пустая! Очистить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ТаблицаМПЗ.Очистить();	
		КонецЕсли;            	
	КонецЕсли;
ДобавитьВПодборФайлНаСервере(); 
КонецПроцедуры  

&НаСервере
Процедура РаскрытьНаМПЗ(ЭтапСпецификации,КолУзла)
НормРасх = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_М(ЭтапСпецификации,ТекущаяДата());
	Пока НормРасх.Следующий() Цикл			
		Если ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Материалы")Тогда	
		ТЧ = НормыРасходов.Добавить();
		ТЧ.Пометка = Истина;
		ТЧ.Позиция = НормРасх.Позиция;
		ТЧ.МПЗ = НормРасх.Элемент;
		ТЧ.ЕдиницаИзмерения = НормРасх.Элемент.ОсновнаяЕдиницаИзмерения;
		ТЧ.Количество = НормРасх.Норма*КолУзла;
			Если Не МестоХранения.Пустая() Тогда
			ТЧ.КоличествоНаСкладе = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоМестуХранения(МестоХранения,НормРасх.Элемент)/ТЧ.ЕдиницаИзмерения.Коэффициент;
			КонецЕсли; 					
		Иначе 
			Если НормРасх.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Набор Тогда
			РаскрытьНаМПЗ(НормРасх.Элемент,ПолучитьБазовоеКоличество(НормРасх.Норма,НормРасх.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла); 
			ИначеЕсли НормРасх.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Основа Тогда
				Если ВсеЭтапы Тогда						
				РаскрытьНаМПЗ(НормРасх.Элемент,ПолучитьБазовоеКоличество(НормРасх.Норма,НормРасх.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла);
				КонецЕсли; 
			Иначе
				Если НормРасх.Элемент.Канбан.Пустая() Тогда
				РаскрытьНаМПЗ(НормРасх.Элемент,ПолучитьБазовоеКоличество(НормРасх.Норма,НормРасх.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла);
				Иначе
				ТЧ = НормыРасходов.Добавить();
				ТЧ.Пометка = Истина;
				ТЧ.Позиция = НормРасх.Позиция;
				ТЧ.МПЗ = НормРасх.Элемент;
				ТЧ.ЕдиницаИзмерения = НормРасх.Элемент.ОсновнаяЕдиницаИзмерения;
				ТЧ.Количество = НормРасх.Норма*КолУзла;
					Если Не МестоХранения.Пустая() Тогда
					ТЧ.КоличествоНаСкладе = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоМестуХранения(МестоХранения,НормРасх.Элемент)/ТЧ.ЕдиницаИзмерения.Коэффициент;
					КонецЕсли;									
				КонецЕсли; 				
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СпецификацияПриИзменении(Элемент)
НормыРасходов.Очистить();
РаскрытьНаМПЗ(Спецификация,1);
НормыРасходов.Сортировать("Позиция,МПЗ");
КонецПроцедуры

&НаКлиенте
Процедура ВсеЭтапыПриИзменении(Элемент)
НормыРасходов.Очистить();
РаскрытьНаМПЗ(Спецификация,1);
НормыРасходов.Сортировать("Позиция,МПЗ");
КонецПроцедуры

&НаСервере
Процедура ДобавитьНаСервере(NAME,NUM)
	Если ВидМПЗ = 0 Тогда
	Выбор = Справочники.Материалы.НайтиПоНаименованию(СокрЛП(NAME),Истина);
	Иначе
	Выбор = Справочники.Номенклатура.НайтиПоНаименованию(СокрЛП(NAME),Истина);
	КонецЕсли; 
		Если Не Выбор.Пустая() Тогда
		Статус = ПолучитьСтатус(Выбор,ТекущаяДата());
			Если (Статус = Перечисления.СтатусыМПЗ.Запрещённая)или(Статус = Перечисления.СтатусыСпецификаций.Запрещённая) Тогда
	        Сообщить(NAME+" - в запрещенном статусе!");
			Возврат;
			КонецЕсли; 
		ТЧ = ТаблицаМПЗ_Файл.Добавить();
		ТЧ.Пометка = Истина;
	    ТЧ.МПЗ = Выбор;
		ТЧ.ЕдиницаИзмерения = ПолучитьОсновнуюЕдиницуИзмеренияПоБазовой(Выбор);
		ТЧ.Количество = NUM;
		Иначе
	    Сообщить(NAME+" - не найден в справочнике!");
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	флНеНайден = Ложь;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка МПЗ из файла..."); 
		ДобавитьНаСервере(ExcelЛист.Cells(к,1).Value,ExcelЛист.Cells(к,2).Value);
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоТоваруНаСервере(Код,Наименование,Количество)
Запрос = Новый Запрос;

	Если ВидМПЗ = 0 Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Материалы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Материалы КАК Материалы
		|ГДЕ
		|	Материалы.Товар.Код = &Код";
	Иначе
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Товар.Код = &Код";
	КонецЕсли;
Запрос.УстановитьПараметр("Код", Код);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
	НомСтр = 1;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТЧ = ТаблицаМПЗ_Файл.Добавить();
			Если НомСтр = 1 Тогда
			ТЧ.Пометка = Истина;
			КонецЕсли; 
		ТЧ.Статус = ПолучитьСтатус(ВыборкаДетальныеЗаписи.Ссылка,ТекущаяДата());
	    ТЧ.МПЗ = ВыборкаДетальныеЗаписи.Ссылка;
		ТЧ.ЕдиницаИзмерения = ПолучитьОсновнуюЕдиницуИзмеренияПоБазовой(ВыборкаДетальныеЗаписи.Ссылка);
		ТЧ.Количество = Количество;
		НомСтр = НомСтр + 1;
		КонецЦикла;	
	Иначе	
	Сообщить(Наименование+" - не найден в справочнике!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТоварыИзФайла(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	флНеНайден = Ложь;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка МПЗ из файла..."); 
		ДобавитьПоТоваруНаСервере(ExcelЛист.Cells(к,1).Value,ExcelЛист.Cells(к,2).Value,ExcelЛист.Cells(к,3).Value);
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НайтиИДобавитьВПодборНаСервере()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.БарКод = &БарКод";
Запрос.УстановитьПараметр("БарКод", БарКод);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Выборка = ТаблицаМПЗ.НайтиСтроки(Новый Структура("МПЗ",ВыборкаДетальныеЗаписи.Ссылка.Изделие));	
			Если Выборка.Количество() = 0 Тогда
			ТЧ_МПЗ = ТаблицаМПЗ.Добавить();
			ТЧ_МПЗ.МПЗ = ВыборкаДетальныеЗаписи.Ссылка.Изделие;
			ТЧ_МПЗ.Количество = ВыборкаДетальныеЗаписи.Ссылка.Количество;
			ТЧ_МПЗ.ЕдиницаИзмерения = ВыборкаДетальныеЗаписи.Ссылка.Изделие.ОсновнаяЕдиницаИзмерения;				
			Иначе	
			Выборка[0].Количество = Выборка[0].Количество + ВыборкаДетальныеЗаписи.Ссылка.Количество; 
			КонецЕсли;
		КонецЦикла;
	Иначе
	Сообщить("ПЗ не найдено по бар-коду!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиИДобавитьВПодбор(Команда)
	Если ТаблицаМПЗ.Количество() > 0 Тогда
		Если Вопрос("Таблица подбора не пустая! Очистить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ТаблицаМПЗ.Очистить();	
		КонецЕсли;            	
	КонецЕсли;
НайтиИДобавитьВПодборНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПодбор(Команда)
ЭтаФорма.Закрыть(ТаблицаМПЗ);
КонецПроцедуры
