
Процедура ОбработкаПроведения(Отказ, Режим)
// регистр ПередачиНаЛинейки Приход
Движения.ПередачиНаЛинейки.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
	Движение = Движения.ПередачиНаЛинейки.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.МестоХранения = МестоХранения;
	Движение.НомерЯчейки = ТекСтрокаТабличнаяЧасть.НомерЯчейки;
	Движение.ВидМПЗ = ТекСтрокаТабличнаяЧасть.ВидМПЗ;
	Движение.МПЗ = ТекСтрокаТабличнаяЧасть.МПЗ;
	Движение.Количество = ТекСтрокаТабличнаяЧасть.Количество;
	Движение.ПередачаНаЛинейку = ТекСтрокаТабличнаяЧасть.ПередачаНаЛинейку;
	КонецЦикла;
КонецПроцедуры
