
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаОтПокупателя") Тогда	
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
	УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение,Дата));
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
МестаХранения = РегистрыНакопления.МестаХранения;
// регистр МестаХранения Расход
Движения.МестаХранения.Записывать = Истина;
КолОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоМестуХранения(МестоХранения,Изделие,Дата);		
	Если КолОстаток >= Количество Тогда
	Движение = Движения.МестаХранения.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.МестоХранения = МестоХранения;
		Если ТипЗнч(Изделие) = Тип("СправочникСсылка.Номенклатура") Тогда
		Движение.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
		Иначе	
		Движение.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;		
		КонецЕсли;
	Движение.МПЗ = Изделие;
	Движение.Количество = Количество;
	Иначе
	Отказ = Истина;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Текст = "МПЗ: "+СокрЛП(Изделие.Наименование)+" требуется: "+Количество+" недостаёт на складе: "+Строка(Количество-КолОстаток);
	Сообщение.Сообщить();
	КонецЕсли;

МестаХранения = РегистрыНакопления.МестаХранения;
// регистр МестаХранения Расход
Движения.МестаХранения.Записывать = Истина;
ВиртуальнаяТабличнаяЧасть = ТабличнаяЧасть.Выгрузить();
ВиртуальнаяТабличнаяЧасть.Свернуть("ВидМПЗ,МПЗ,ЕдиницаИзмерения","Количество");
	Для Каждого ТЧ Из ВиртуальнаяТабличнаяЧасть Цикл
	Движение = Движения.МестаХранения.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.МестоХранения = МестоХраненияВ;
	Движение.ВидМПЗ = ТЧ.ВидМПЗ; 
	Движение.МПЗ = ТЧ.МПЗ;
	Движение.Количество = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения);
	КонецЦикла;
КонецПроцедуры
