
Функция ПолучитьМатериал()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Ссылка КАК МПЗ,
	|	СтатусыМПЗСрезПоследних.Статус КАК Статус
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПО Материалы.Ссылка = СтатусыМПЗСрезПоследних.МПЗ
	|ГДЕ
	|	Материалы.Товар = &Товар
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыМПЗСрезПоследних.Статус.Порядок";
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
Запрос.УстановитьПараметр("Товар", Ссылка);
Возврат(Запрос.Выполнить().Выгрузить());
КонецФункции

Процедура ПередЗаписью(Отказ)
	Если Не Ссылка.Пустая() Тогда
		Если Ссылка.Статус <> Статус Тогда
		Выборка = ПолучитьМатериал();
			Если Выборка.Количество() > 0 Тогда
			МПЗ = Выборка[0].МПЗ;              
				Если Найти(ПолучитьВерхнегоРодителя(МПЗ).Наименование,"Товары для перепродажи") = 0 Тогда
				Возврат;
				КонецЕсли;
			СтатусМПЗ = Выборка[0].Статус;
				Если Статус = Перечисления.СтатусыТоваров.НеПроизводимый Тогда
					Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.Запрещённая Тогда
					СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
					СтатусыМПЗ.Период = ТекущаяДата();
					СтатусыМПЗ.МПЗ = МПЗ;
					СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.Запрещённая;
					СтатусыМПЗ.Записать(Истина);			
					КонецЕсли;
				ИначеЕсли Статус = Перечисления.СтатусыТоваров.СнимаемыйСПроизводства Тогда
					Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.ДоИсчерпанияЗапасов Тогда
					СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
					СтатусыМПЗ.Период = ТекущаяДата();
					СтатусыМПЗ.МПЗ = МПЗ;
					СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.ДоИсчерпанияЗапасов;
					СтатусыМПЗ.Записать(Истина);			
					КонецЕсли;
				ИначеЕсли Статус = Перечисления.СтатусыТоваров.Производимый Тогда
					Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.Основная Тогда
					СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
					СтатусыМПЗ.Период = ТекущаяДата();
					СтатусыМПЗ.МПЗ = МПЗ;
					СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.Основная;
					СтатусыМПЗ.Записать(Истина);			
					КонецЕсли;
				ИначеЕсли Статус = Перечисления.СтатусыТоваров.Опытный Тогда
					Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.ОНР Тогда
					СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
					СтатусыМПЗ.Период = ТекущаяДата();
					СтатусыМПЗ.МПЗ = МПЗ;
					СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.ОНР;
					СтатусыМПЗ.Записать(Истина);			
					КонецЕсли;
				ИначеЕсли Статус = Перечисления.СтатусыТоваров.Проектный Тогда
					Если СтатусМПЗ <> Перечисления.СтатусыМПЗ.ОНР Тогда
					СтатусыМПЗ = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
					СтатусыМПЗ.Период = ТекущаяДата();
					СтатусыМПЗ.МПЗ = МПЗ;
					СтатусыМПЗ.Статус = Перечисления.СтатусыМПЗ.ОНР;
					СтатусыМПЗ.Записать(Истина);			
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
