
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Подразделение = Параметры.Подразделение;
РабочееМесто = Подразделение.РабочееМестоОценкиБрака;
ДокументПрихода = Параметры.ДокументПрихода;
	Если ТипЗнч(ДокументПрихода) = Тип("ДокументСсылка.ДвижениеМПЗ") Тогда
	МестоХранения = ДокументПрихода.МестоХраненияВ;	
	Иначе
	МестоХранения = ДокументПрихода.МестоХранения;
	КонецЕсли; 
Изделие = Параметры.Изделие;
КоличествоСписание = Параметры.КоличествоСписание;
КоличествоПеремещение = Параметры.КоличествоПеремещение;
	Если КоличествоСписание = 0 Тогда
	Элементы.СтатьяСписания.Доступность = Ложь;		
	Элементы.Комментарий.Доступность = Ложь;	
	КонецЕсли;                                                                                          
КонецПроцедуры

&НаСервере
Функция ПолучитьГруппуВидовБрака()
ТекРодитель = Изделие.Родитель;		
	Пока Не ТекРодитель.Пустая() Цикл		
		Если Не ТекРодитель.ВидБрака.Пустая() Тогда
		Возврат(ТекРодитель.ВидБрака);
		КонецЕсли; 
	ТекРодитель = ТекРодитель.Родитель;	
	КонецЦикла; 
Возврат(Справочники.ВидыБрака.ПустаяСсылка());
КонецФункции

&НаСервере
Процедура ПолучитьЭтапЖизненногоЦикла()
	Если ВидБрака.ЭтапЖизненногоЦикла.Пустая() Тогда
	ЭтапЖизненногоЦикла = ОбщийМодульВызовСервера.ПолучитьЭтапЖизненногоЦикла(Изделие);	
	Иначе	
	ЭтапЖизненногоЦикла = ВидБрака.ЭтапЖизненногоЦикла;
	КонецЕсли; 
КонецПроцедуры 

&НаКлиенте
Процедура ВидБракаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("Справочник.ВидыБрака.Форма.ФормаВыбораПоГруппе",Новый Структура("Родитель",ПолучитьГруппуВидовБрака()));
Результат = Ф.ОткрытьМодально(); 
	Если Результат <> Неопределено Тогда
	ВидБрака = Результат;
	ПолучитьЭтапЖизненногоЦикла();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОформитьСписаниеПеремещениеБракаНаСервере()
Результат = Новый Структура("Списание,Перемещение",Неопределено,Неопределено);
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
		Если КоличествоСписание > 0 Тогда
			Если СтатьяСписания.Пустая() Тогда
			Сообщить("Выберите статью списания!");
			ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
			Возврат(Неопределено);			
			КонецЕсли;  
		Списание = Документы.СписаниеМПЗПрочее.СоздатьДокумент();
		Списание.Дата = ТекущаяДата();
		Списание.УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение));
		Списание.Автор = ПараметрыСеанса.Пользователь;
		Списание.ДокументОснование = ДокументПрихода;
		Списание.Подразделение = Подразделение;
		Списание.МестоХранения = Подразделение.МестоХраненияБрака;
		Списание.Статья = СтатьяСписания;
		Списание.Утвердил = Подразделение.Руководитель;
		Списание.Комментарий = Комментарий;
		Списание.ВидБрака = ВидБрака;
		Списание.ЭтапЖизненногоЦикла = ЭтапЖизненногоЦикла;
		Списание.РабочееМесто = РабочееМесто; 
		ТЧ = Списание.ТабличнаяЧасть.Добавить();
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
		ТЧ.МПЗ = Изделие;
		ТЧ.Количество = КоличествоСписание/Изделие.ОсновнаяЕдиницаИзмерения.Коэффициент;
		ТЧ.ЕдиницаИзмерения = Изделие.ОсновнаяЕдиницаИзмерения;
		Списание.Записать(РежимЗаписиДокумента.Проведение);
		Результат.Списание = Списание.Ссылка;
		КонецЕсли;
			Если КоличествоПеремещение > 0 Тогда
			Перемещение = Документы.ДвижениеМПЗ.СоздатьДокумент();
			Перемещение.Дата = ТекущаяДата();
			Перемещение.УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение));
			Перемещение.Автор = ПараметрыСеанса.Пользователь;
			Перемещение.ДокументОснование = ДокументПрихода;
			Перемещение.Подразделение = Подразделение;
			Перемещение.МестоХранения = Подразделение.МестоХраненияБрака;
			Перемещение.МестоХраненияВ = Подразделение.МестоХраненияГП;
			Перемещение.Комментарий = "Изделия после ремонта";
			Перемещение.ВидБрака = ВидБрака;
			Перемещение.ЭтапЖизненногоЦикла = ЭтапЖизненногоЦикла;
			Перемещение.РабочееМесто = РабочееМесто; 
			ТЧ = Перемещение.ТабличнаяЧасть.Добавить();
			ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
			ТЧ.МПЗ = Изделие;
			ТЧ.Количество = КоличествоПеремещение;
			ТЧ.ЕдиницаИзмерения =  Изделие.ОсновнаяЕдиницаИзмерения;	
			Перемещение.Записать(РежимЗаписиДокумента.Проведение);
			Результат.Перемещение = Перемещение.Ссылка;
			КонецЕсли; 
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат(Неопределено);
	КонецПопытки;
Возврат(Результат);
КонецФункции

&НаКлиенте
Процедура Оформить(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Результат = ОформитьСписаниеПеремещениеБракаНаСервере();	
		Если Результат <> Неопределено Тогда
		Этаформа.Закрыть(Результат);
		КонецЕсли;
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
Этаформа.Закрыть(Неопределено);
КонецПроцедуры
