
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

Макет = Отчеты.СверкаПоступленийНаЛинейки.ПолучитьМакет("Макет");
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблДок = Макет.ПолучитьОбласть("Док");
ОблДокОтклонение = Макет.ПолучитьОбласть("ДокОтклонение");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблМПЗОтклонение = Макет.ПолучитьОбласть("МПЗОтклонение");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = НачалоДня(Отчет.Период.ДатаНачала);
ОблШапка.Параметры.ДатаКон = КонецДня(Отчет.Период.ДатаОкончания);
ОблШапка.Параметры.Линейка = Отчет.Линейка;
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;
ЗапросТЧ = Новый Запрос;
ЗапросМПЗ = Новый Запрос;
ЗапросНомен = Новый Запрос;
СписокПоступлений = Новый СписокЗначений;
СписокМПЗ = Новый СписокЗначений;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеМПЗ.IDDOC КАК IDDOC,
	|	ЖурналДокументов.DOCNO,
	|	ПОДСТРОКА(ЖурналДокументов.DATE_TIME_IDDOC, 1, 8) КАК Дата
	|ИЗ
	|	ВнешнийИсточникДанных.Номенклатура1С77.Таблица.ДвижениеМПЗ КАК ДвижениеМПЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.Номенклатура1С77.Таблица.ЖурналДокументов КАК ЖурналДокументов
	|		ПО ДвижениеМПЗ.IDDOC = ЖурналДокументов.IDDOC
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.Номенклатура1С77.Таблица.МестаХранения КАК МестаХранения
	|		ПО ДвижениеМПЗ.SP14335 = МестаХранения.ID
	|ГДЕ
	|	ЖурналДокументов.DATE_TIME_IDDOC >= &ДатаНач
	|	И ЖурналДокументов.DATE_TIME_IDDOC <= &ДатаКон
	|	И МестаХранения.DESCR = &DESCR
	|	И ЖурналДокументов.ISMARK = ЛОЖЬ";
Запрос.УстановитьПараметр("ДатаНач",Формат(Отчет.Период.ДатаНачала,"ДФ=yyyyMMdd"));
Запрос.УстановитьПараметр("ДатаКон",Формат(Отчет.Период.ДатаОкончания+86400,"ДФ=yyyyMMdd"));
Запрос.УстановитьПараметр("DESCR",СокрЛП(Отчет.Линейка.МестоХраненияКанбанов.Наименование));
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ПоступлениеПрочее = Документы.ПоступлениеМПЗПрочее.НайтиПоРеквизиту("НомерИсходногоДокумента",ВыборкаДетальныеЗаписи.DOCNO);
		Если Не ПоступлениеПрочее.Пустая() Тогда
		СписокМПЗ.Очистить();
		СписокПоступлений.Добавить(ПоступлениеПрочее);
			Если Формат(Дата(ВыборкаДетальныеЗаписи.Дата),"ДФ=dd.MM.yyyy") = Формат(ПоступлениеПрочее.Дата,"ДФ=dd.MM.yyyy") Тогда
			ОблДок.Параметры.ДокПеремещение = СокрЛП(ВыборкаДетальныеЗаписи.DOCNO)+" от "+Формат(Дата(ВыборкаДетальныеЗаписи.Дата),"ДФ=dd.MM.yyyy"); 			
			ОблДок.Параметры.ДокПоступлениеНомер = СокрЛП(ПоступлениеПрочее.Номер)+" от "+Формат(ПоступлениеПрочее.Дата,"ДФ=dd.MM.yyyy"); 
			ОблДок.Параметры.ДокПоступление = ПоступлениеПрочее.Ссылка;
			ОблДок.Параметры.НомерИсхДок = ПоступлениеПрочее.НомерИсходногоДокумента;
			ТабДок.Вывести(ОблДок);			
			Иначе
			ОблДокОтклонение.Параметры.ДокПеремещение = СокрЛП(ВыборкаДетальныеЗаписи.DOCNO)+" от "+Формат(Дата(ВыборкаДетальныеЗаписи.Дата),"ДФ=dd.MM.yyyy"); 			
			ОблДокОтклонение.Параметры.ДокПоступлениеНомер = СокрЛП(ПоступлениеПрочее.Номер)+" от "+Формат(ПоступлениеПрочее.Дата,"ДФ=dd.MM.yyyy"); 
			ОблДокОтклонение.Параметры.ДокПоступление = ПоступлениеПрочее.Ссылка;
			ОблДокОтклонение.Параметры.НомерИсхДок = ПоступлениеПрочее.НомерИсходногоДокумента;
			ТабДок.Вывести(ОблДокОтклонение);				
			КонецЕсли; 
		ЗапросТЧ.Текст = 
			"ВЫБРАТЬ
			|	ДвижениеМПЗ_ТЧ.SP20625,
			|	ДвижениеМПЗ_ТЧ.SP14336,
			|	ДвижениеМПЗ_ТЧ.SP14337
			|ИЗ
			|	ВнешнийИсточникДанных.Номенклатура1С77.Таблица.ДвижениеМПЗ_ТЧ КАК ДвижениеМПЗ_ТЧ
			|ГДЕ
			|	ДвижениеМПЗ_ТЧ.IDDOC = &IDDOC";	
		ЗапросТЧ.УстановитьПараметр("IDDOC",ВыборкаДетальныеЗаписи.IDDOC);	
		РезультатЗапросаТЧ = ЗапросТЧ.Выполнить();
		ВыборкаДетальныеЗаписиТЧ = РезультатЗапросаТЧ.Выбрать();
			Пока ВыборкаДетальныеЗаписиТЧ.Следующий() Цикл
				Если ВыборкаДетальныеЗаписиТЧ.SP20625 = "   39M   " Тогда					
				ЗапросМПЗ.Текст = 
					"ВЫБРАТЬ
					|	Материалы.DESCR
					|ИЗ
					|	ВнешнийИсточникДанных.Номенклатура1С77.Таблица.Материалы КАК Материалы
					|ГДЕ
					|	Материалы.ID = &ID";
				ID = Прав(ВыборкаДетальныеЗаписиТЧ.SP14336,9);	
				ЗапросМПЗ.УстановитьПараметр("ID",ID);	
				РезультатЗапросаМПЗ = ЗапросМПЗ.Выполнить();
				ВыборкаДетальныеЗаписиМПЗ = РезультатЗапросаМПЗ.Выбрать();
					Пока ВыборкаДетальныеЗаписиМПЗ.Следующий() Цикл
					МПЗ = Справочники.Материалы.НайтиПоРеквизиту("ID",ID);
					СписокМПЗ.Добавить(МПЗ);
					ТЧ = ПоступлениеПрочее.ТабличнаяЧасть.Найти(МПЗ,"МПЗ");
							Если ТЧ <> Неопределено Тогда
							КолПост = ТЧ.Количество;
							Иначе
							КолПост = 0;
							КонецЕсли;
								Если ВыборкаДетальныеЗаписиТЧ.SP14337 - КолПост = 0 Тогда
									Если Не ТолькоНесоответствия Тогда
									ОблМПЗ.Параметры.МПЗ = СокрЛП(ВыборкаДетальныеЗаписиМПЗ.DESCR);
									ОблМПЗ.Параметры.КолПерем = ВыборкаДетальныеЗаписиТЧ.SP14337;
									ОблМПЗ.Параметры.КолПост = КолПост;
									ТабДок.Вывести(ОблМПЗ);	
									КонецЕсли; 							
								Иначе
								ОблМПЗОтклонение.Параметры.МПЗ = СокрЛП(ВыборкаДетальныеЗаписиМПЗ.DESCR);
								ОблМПЗОтклонение.Параметры.КолПерем = ВыборкаДетальныеЗаписиТЧ.SP14337;
								ОблМПЗОтклонение.Параметры.КолПост = КолПост;
								ТабДок.Вывести(ОблМПЗОтклонение);						
								КонецЕсли; 
					КонецЦикла;				
				Иначе
				ЗапросМПЗ.Текст = 
					"ВЫБРАТЬ
					|	Номенклатура.DESCR
					|ИЗ
					|	ВнешнийИсточникДанных.Номенклатура1С77.Таблица.Номенклатура КАК Номенклатура
					|ГДЕ
					|	Номенклатура.ID = &ID";
				ID = Прав(ВыборкаДетальныеЗаписиТЧ.SP14336,9);						
				ЗапросМПЗ.УстановитьПараметр("ID",ID);	
				РезультатЗапросаМПЗ = ЗапросМПЗ.Выполнить();
				ВыборкаДетальныеЗаписиМПЗ = РезультатЗапросаМПЗ.Выбрать();
					Пока ВыборкаДетальныеЗаписиМПЗ.Следующий() Цикл
					МПЗ = Справочники.Номенклатура.НайтиПоРеквизиту("ID",ID);
					СписокМПЗ.Добавить(МПЗ);
					ТЧ = ПоступлениеПрочее.ТабличнаяЧасть.Найти(МПЗ,"МПЗ");
						Если ТЧ <> Неопределено Тогда
						КолПост = ТЧ.Количество;
						Иначе
						КолПост = 0;
						КонецЕсли;
							Если ВыборкаДетальныеЗаписиТЧ.SP14337 - КолПост = 0 Тогда
								Если Не ТолькоНесоответствия Тогда
								ОблМПЗ.Параметры.МПЗ = СокрЛП(ВыборкаДетальныеЗаписиМПЗ.DESCR);
								ОблМПЗ.Параметры.КолПерем = ВыборкаДетальныеЗаписиТЧ.SP14337;
								ОблМПЗ.Параметры.КолПост = КолПост;
								ТабДок.Вывести(ОблМПЗ);							
								КонецЕсли;
							Иначе
							ОблМПЗОтклонение.Параметры.МПЗ = СокрЛП(ВыборкаДетальныеЗаписиМПЗ.DESCR);
							ОблМПЗОтклонение.Параметры.КолПерем = ВыборкаДетальныеЗаписиТЧ.SP14337;
							ОблМПЗОтклонение.Параметры.КолПост = КолПост;
							ТабДок.Вывести(ОблМПЗОтклонение);						
							КонецЕсли; 
					КонецЦикла;						
				КонецЕсли; 				
			КонецЦикла;
				Для каждого ТЧ Из ПоступлениеПрочее.ТабличнаяЧасть Цикл
					Если СписокМПЗ.НайтиПоЗначению(ТЧ.МПЗ) = Неопределено Тогда
					ОблМПЗОтклонение.Параметры.МПЗ = СокрЛП(ТЧ.МПЗ.Наименование);
					ОблМПЗОтклонение.Параметры.КолПерем = 0;	
					ОблМПЗОтклонение.Параметры.КолПост = ТЧ.Количество;
					ТабДок.Вывести(ОблМПЗОтклонение);
					КонецЕсли; 
				КонецЦикла; 	
		Иначе
		ОблДокОтклонение.Параметры.ДокПеремещение = СокрЛП(ВыборкаДетальныеЗаписи.DOCNO)+" от "+Формат(Дата(ВыборкаДетальныеЗаписи.Дата),"ДФ=dd.MM.yyyy"); 				
		ОблДокОтклонение.Параметры.ДокПоступлениеНомер = "";
		ОблДокОтклонение.Параметры.ДокПоступление = "";
		ОблДокОтклонение.Параметры.НомерИсхДок = "";
		ТабДок.Вывести(ОблДокОтклонение);
		КонецЕсли; 
	КонецЦикла;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеМПЗПрочее.Ссылка,
	|	ПоступлениеМПЗПрочее.Номер,
	|	ПоступлениеМПЗПрочее.Дата,
	|	ПоступлениеМПЗПрочее.НомерИсходногоДокумента
	|ИЗ
	|	Документ.ПоступлениеМПЗПрочее КАК ПоступлениеМПЗПрочее
	|ГДЕ
	|	ПоступлениеМПЗПрочее.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПоступлениеМПЗПрочее.ПометкаУдаления = ЛОЖЬ
	|	И ПоступлениеМПЗПрочее.МестоХранения = &МестоХранения
	|	И ПоступлениеМПЗПрочее.НомерИсходногоДокумента <> """"";
Запрос.УстановитьПараметр("ДатаНач",Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон",Отчет.Период.ДатаОкончания);
Запрос.УстановитьПараметр("МестоХранения",Отчет.Линейка.МестоХраненияКанбанов);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СписокПоступлений.НайтиПоЗначению(ВыборкаДетальныеЗаписи.Ссылка) = Неопределено Тогда
		ОблДокОтклонение.Параметры.ДокПеремещение = "";
		ОблДокОтклонение.Параметры.ДокПоступлениеНомер = СокрЛП(ВыборкаДетальныеЗаписи.Номер)+" от "+Формат(ВыборкаДетальныеЗаписи.Дата,"ДФ=dd.MM.yyyy");
		ОблДокОтклонение.Параметры.ДокПоступление = ВыборкаДетальныеЗаписи.Ссылка;
		ОблДокОтклонение.Параметры.НомерИсхДок = ВыборкаДетальныеЗаписи.НомерИсходногоДокумента;
		ТабДок.Вывести(ОблДокОтклонение);
		КонецЕсли; 
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
