
&НаСервере
Функция ПолучитьДатуПередачиНаЛинейку(МТК)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПередачаНаЛинейку.Дата
	|ИЗ
	|	Документ.ПередачаНаЛинейку КАК ПередачаНаЛинейку
	|ГДЕ
	|	ПередачаНаЛинейку.ДокументОснование = &МТК";
Запрос.УстановитьПараметр("МТК", МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Дата);
	КонецЦикла;
Возврат(Дата(1,1,1));
КонецФункции

&НаСервере
Процедура ПолучитьСписокЭтапов(ПЗ,ЭтапСпецификации)
	Если СокрЛП(ЭтапСпецификации.Канбан.Наименование) <> "Канбан УПЭА SMD ГСС" Тогда
	СписокЭтапов.Добавить(ЭтапСпецификации);
	КонецЕсли;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходов.Элемент
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних(&НаДату, ) КАК НормыРасходовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыРасходов КАК НормыРасходов
	|		ПО НормыРасходовСрезПоследних.НормаРасходов = НормыРасходов.Ссылка
	|ГДЕ
	|	НормыРасходов.ПометкаУдаления = ЛОЖЬ
	|	И НормыРасходов.Владелец = &Владелец
	|	И НормыРасходов.ВидЭлемента = &ВидЭлемента
	|	И НормыРасходовСрезПоследних.Норма > 0";
Запрос.УстановитьПараметр("НаДату", ПЗ.ДатаЗапуска);
Запрос.УстановитьПараметр("Владелец", ЭтапСпецификации);
Запрос.УстановитьПараметр("ВидЭлемента", Перечисления.ВидыЭлементовНормРасходов.Основа);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаНР = РезультатЗапроса.Выбрать();
	Пока ВыборкаНР.Следующий() Цикл
	ПолучитьСписокЭтапов(ПЗ,ВыборкаНР.Элемент);  
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокРабочихМест(Наименование)
СписокРабочихМест.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеек.Ссылка
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек КАК РабочиеМестаЛинеек
	|ГДЕ
	|	РабочиеМестаЛинеек.Линейка В(&СписокЛинеек)
	|	И РабочиеМестаЛинеек.ПометкаУдаления = ЛОЖЬ
	|	И РабочиеМестаЛинеек.ЭтоГруппа = ЛОЖЬ
	|	И РабочиеМестаЛинеек.Наименование = &Наименование";
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
Запрос.УстановитьПараметр("Наименование", Наименование);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокРабочихМест.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТаблицаПЗ.Очистить();
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	Макет = ОбъектЗн.ПолучитьМакет("МакетДляДокумента");
	Иначе
	Макет = ОбъектЗн.ПолучитьМакет("Макет");
	КонецЕсли;

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Отчет.ДатаНачала;
ОблШапка.Параметры.ДатаКон = Отчет.ДатаОкончания;
	Если ВидРасчёта = 1 Тогда
	ОблШапка.Параметры.Парам = "К-т.";
	Иначе	
	ОблШапка.Параметры.Парам = "НВ";	
	КонецЕсли;
		Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
		ОблШапка.Параметры.ВидДокумента = ТипЗнч(ЭтаФорма.Параметры.Документ);
		ОблШапка.Параметры.Подразделение = ЭтаФорма.Параметры.Документ.Подразделение;
		ОблШапка.Параметры.Комментарий = ЭтаФорма.Параметры.Документ.Комментарий;
		КонецЕсли; 
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданий.ПЗ,
	|	ЭтапыПроизводственныхЗаданий.ДатаОкончания,
	|	ЭтапыПроизводственныхЗаданий.ПЗ.ЛинияSMD КАК ЛинияSMD,
	|	ЭтапыПроизводственныхЗаданий.Исполнитель
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий КАК ЭтапыПроизводственныхЗаданий
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданий.РабочееМесто В(&СписокРабочихМест)
	|	И ЭтапыПроизводственныхЗаданий.ДатаОкончания МЕЖДУ &ДатаНач И &ДатаКон";
	Если СписокЛинийSMD.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданий.ПЗ.ЛинияSMD В(&СписокЛинийSMD)";
	Запрос.УстановитьПараметр("СписокЛинийSMD", СписокЛинийSMD);
	КонецЕсли;
		Если ВидРасчёта = 1 Тогда
		ПолучитьСписокРабочихМест("Оптический тест");
		Иначе
		ПолучитьСписокРабочихМест("Электроконтроль");
		КонецЕсли;
Запрос.УстановитьПараметр("ДатаНач", Отчет.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.ДатаОкончания);
Запрос.УстановитьПараметр("СписокРабочихМест", СписокРабочихМест);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокЭтапов.Очистить();
	ПолучитьСписокЭтапов(ВыборкаДетальныеЗаписи.ПЗ,ВыборкаДетальныеЗаписи.ПЗ.Изделие);
		Если ВидРасчёта = 1 Тогда
			Для каждого Этап Из СписокЭтапов Цикл
			ТЧ = ТаблицаПЗ.Добавить();
			ТЧ.ПЗ = ВыборкаДетальныеЗаписи.ПЗ;
			ТЧ.Изделие = ВыборкаДетальныеЗаписи.ПЗ.Изделие;
			ТЧ.ЭтапСпецификации = Этап.Значение;
			ТЧ.ДатаВыполнения = ВыборкаДетальныеЗаписи.ДатаОкончания;
			ТЧ.КоличествоПЗ = ВыборкаДетальныеЗаписи.ПЗ.Количество;
			ТЧ.ЛинияSMD = ВыборкаДетальныеЗаписи.ЛинияSMD;
			ТЧ.ДатаВыпуска = ПолучитьДатуПередачиНаЛинейку(ВыборкаДетальныеЗаписи.ПЗ.ДокументОснование);
			ТЧ.Исполнитель = ВыборкаДетальныеЗаписи.Исполнитель;
			КонецЦикла;	
		Иначе
		ТЧ = ТаблицаПЗ.Добавить();
		ТЧ.ПЗ = ВыборкаДетальныеЗаписи.ПЗ;
		ТЧ.Изделие = ВыборкаДетальныеЗаписи.ПЗ.Изделие;
		ТЧ.ЭтапСпецификации = СписокЭтапов[0].Значение;
		ТЧ.ДатаВыполнения = ВыборкаДетальныеЗаписи.ДатаОкончания;
		ТЧ.КоличествоПЗ = ВыборкаДетальныеЗаписи.ПЗ.Количество;
		ТЧ.ЛинияSMD = ВыборкаДетальныеЗаписи.ЛинияSMD;
		ТЧ.ДатаВыпуска = ПолучитьДатуПередачиНаЛинейку(ВыборкаДетальныеЗаписи.ПЗ.ДокументОснование);
		ТЧ.Исполнитель = ВыборкаДетальныеЗаписи.Исполнитель;	
		КонецЕсли; 
	КонецЦикла;
		Если СортироватьПо = 1 Тогда
		ТаблицаПЗ.Сортировать("ПЗ,Изделие,ЭтапСпецификации");
		ИначеЕсли СортироватьПо = 2 Тогда
		ТаблицаПЗ.Сортировать("Изделие,ЭтапСпецификации,ПЗ");
		ИначеЕсли СортироватьПо = 3 Тогда	
		ТаблицаПЗ.Сортировать("ДатаВыполнения,ПЗ,Изделие,ЭтапСпецификации");
		ИначеЕсли СортироватьПо = 4 Тогда	
		ТаблицаПЗ.Сортировать("ДатаВыпуска,ПЗ,Изделие,ЭтапСпецификации");
		ИначеЕсли СортироватьПо = 5 Тогда	
		ТаблицаПЗ.Сортировать("Исполнитель,ПЗ,Изделие,ЭтапСпецификации");
		КонецЕсли;
НомСтр = 0;
КолПЗВсего = 0;
СтоимостьВсего = 0;
	Для каждого ТЧ Из ТаблицаПЗ Цикл
	НомСтр = НомСтр + 1;
	ОблСтрока.Параметры.НомСтр = НомСтр;
	ОблСтрока.Параметры.Линейка = ТЧ.ПЗ.Линейка;
	ОблСтрока.Параметры.Линия = ТЧ.ЛинияSMD;
	ОблСтрока.Параметры.НомерПЗ = ТЧ.ПЗ.Номер;
	ОблСтрока.Параметры.ПЗ = ТЧ.ПЗ;
	ОблСтрока.Параметры.Статус = ПолучитьСтатус(ТЧ.ЭтапСпецификации);
	ОблСтрока.Параметры.НаименованиеИзделия = СокрЛП(ТЧ.Изделие.Наименование);
	ОблСтрока.Параметры.Изделие = ТЧ.Изделие;
	ОблСтрока.Параметры.НаименованиеСпецификации = СокрЛП(ТЧ.ЭтапСпецификации.Наименование);
	ОблСтрока.Параметры.ЭтапСпецификации = ТЧ.ЭтапСпецификации;
	ОблСтрока.Параметры.ДатаВыполнения = Формат(ТЧ.ДатаВыполнения,"ДФ=dd.MM.yyyy");
	ОблСтрока.Параметры.ДатаВыпуска = Формат(ТЧ.ДатаВыпуска,"ДФ=dd.MM.yyyy");
	ОблСтрока.Параметры.КолПЗ = ТЧ.КоличествоПЗ;
	ОблСтрока.Параметры.Исполнитель = ТЧ.Исполнитель;
		Если ВидРасчёта = 1 Тогда
		НормыSMD = РегистрыСведений.НормыОптическогоТеста.ПолучитьПоследнее(ТЧ.ДатаВыполнения,Новый Структура("МПЗ",ТЧ.ЭтапСпецификации));
		ОблСтрока.Параметры.Парам = НормыSMD.Коэффициент;
		Иначе	
		НормыSMD = РегистрыСведений.НормыЭлектроконтроля.ПолучитьПоследнее(ТЧ.ДатаВыполнения,Новый Структура("МПЗ",ТЧ.ЭтапСпецификации));
		ОблСтрока.Параметры.Парам = НормыSMD.НормаВремени;	
		КонецЕсли;
	ОблСтрока.Параметры.Расценка = НормыSMD.Расценка;
	Стоимость = ТЧ.КоличествоПЗ*НормыSMD.Расценка;
	ОблСтрока.Параметры.Стоимость = Формат(Стоимость,"ЧЦ=9; ЧДЦ=2");
	КолПЗВсего = КолПЗВсего + ТЧ.КоличествоПЗ;
	СтоимостьВсего = СтоимостьВсего + Стоимость;
	ТекОбл = ТабДок.Вывести(ОблСтрока);
		Если НормыSMD.Расценка = 0 Тогда
		ТабДок.Область(ТекОбл.Верх, ТекОбл.Лево, ТекОбл.Низ, ТекОбл.Право).ЦветФона = WebЦвета.Коралловый;
		КонецЕсли; 
	КонецЦикла;
ОблКонец.Параметры.КолПЗВсего = КолПЗВсего;
ОблКонец.Параметры.СтоимостьВсего = Формат(СтоимостьВсего,"ЧЦ=9; ЧДЦ=2");
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	ОблКонец.Параметры.Мастер = ЭтаФорма.Параметры.Документ.Автор;
	ОблКонец.Параметры.ЗаместительНачальникаПоУправлениюРесурсами = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Заместитель начальника по управлению ресурсами");
	ОблКонец.Параметры.НачальникПЭО = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Начальник ПЭО");
	КонецЕсли;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если ОбщийМодульВызовСервера.РазрешенныйСписокЛинеек(СписокЛинеек) Тогда
		СформироватьНаСервере();		
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ВидРасчёта = 1;
СортироватьПо = 1;
Отчет.ДатаНачала = НачалоДня(ТекущаяДата());
Отчет.ДатаОкончания = КонецДня(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура ПолучитьПараметрыДокумента(Документ)
Отчет.ДатаНачала = НачалоМесяца(Документ.Дата)+25200;			
Отчет.ДатаОкончания = КонецМесяца(Документ.Дата)+25200;
СписокЛинеек.Очистить();
	Если Документ.Линейка.ЭтоГруппа Тогда
	Линейки = Справочники.Линейки.Выбрать(Документ.Линейка);
		Пока Линейки.Следующий() Цикл
			Если Не Линейки.Проектная Тогда
			СписокЛинеек.Добавить(Линейки.Ссылка);
			КонецЕсли;			
		КонецЦикла;	
	Иначе	
	СписокЛинеек.Добавить(Документ.Линейка);	
	КонецЕсли;
		Если Найти(ЭтаФорма.Параметры.РабочееМесто.Наименование, "Оптический тест") > 0 Тогда
		ВидРасчёта = 1;
		Иначе
		ВидРасчёта = 2;
		КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	ПолучитьПараметрыДокумента(ЭтаФорма.Параметры.Документ);
	Сформировать(Неопределено);   	
	КонецЕсли;
КонецПроцедуры
