
&НаСервере
Функция ПолучитьДатуВыпуска(ПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииКанбан.Дата КАК Дата
	|ИЗ
	|	Документ.ВыпускПродукцииКанбан КАК ВыпускПродукцииКанбан
	|ГДЕ
	|	ВыпускПродукцииКанбан.ДокументОснование = &ДокументОснование
	|	И ВыпускПродукцииКанбан.Проведен = ИСТИНА";
Запрос.УстановитьПараметр("ДокументОснование", ПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Дата);
	КонецЦикла;
Возврат(Дата(1,1,1));
КонецФункции

&НаСервере
Функция ПолучитьДатуВыпускаДо(Изделие,ДатаДо)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВыпускПродукцииКанбан.Дата КАК Дата
	|ИЗ
	|	Документ.ВыпускПродукцииКанбан КАК ВыпускПродукцииКанбан
	|ГДЕ
	|	ВыпускПродукцииКанбан.Изделие = &Изделие
	|	И ВыпускПродукцииКанбан.Дата <= &ДатаДо
	|	И ВыпускПродукцииКанбан.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
Запрос.УстановитьПараметр("Изделие", Изделие);
Запрос.УстановитьПараметр("ДатаДо", ДатаДо);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Дата);
	КонецЦикла;
Возврат(Дата(1,1,1));
КонецФункции 

&НаСервере
Функция ПолучитьДатуПеремещения(ПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеМПЗ.Дата КАК Дата
	|ИЗ
	|	Документ.ДвижениеМПЗ КАК ДвижениеМПЗ
	|ГДЕ
	|	ДвижениеМПЗ.ДокументОснование = &ДокументОснование
	|	И ДвижениеМПЗ.Проведен = ИСТИНА";
Запрос.УстановитьПараметр("ДокументОснование", ПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Дата);
	КонецЦикла;
Возврат(Дата(1,1,1));
КонецФункции 

&НаСервере
Функция ПолучитьКоличествоНевостребованных(МТК,Изделие)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеМПЗТабличнаяЧасть.Количество КАК Количество
	|ИЗ
	|	Документ.ДвижениеМПЗ.ТабличнаяЧасть КАК ДвижениеМПЗТабличнаяЧасть
	|ГДЕ
	|	ДвижениеМПЗТабличнаяЧасть.Ссылка.ДокументОснование = &ДокументОснование
	|	И ДвижениеМПЗТабличнаяЧасть.Ссылка.МестоХранения = &МестоХранения
	|	И ДвижениеМПЗТабличнаяЧасть.МПЗ = &МПЗ";
Запрос.УстановитьПараметр("ДокументОснование", МТК);
Запрос.УстановитьПараметр("МестоХранения", Справочники.МестаХранения.НайтиПоНаименованию("Невостребованные полуфабрикаты МО",Истина));
Запрос.УстановитьПараметр("МПЗ", Изделие);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Количество);
	КонецЦикла;
Возврат(0);
КонецФункции

&НаСервере
Функция ПолучитьДатуПоступленияДо(Изделие,ДатаДо)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеНаЛинейку.Дата КАК Дата
	|ИЗ
	|	Документ.ПоступлениеНаЛинейку КАК ПоступлениеНаЛинейку
	|ГДЕ
	|	ПоступлениеНаЛинейку.МПЗ = &МПЗ
	|	И ПоступлениеНаЛинейку.Дата = &ДатаДо
	|	И ПоступлениеНаЛинейку.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
Запрос.УстановитьПараметр("МПЗ", Изделие);
Запрос.УстановитьПараметр("ДатаДо", ДатаДо);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Дата);
	КонецЦикла;
Возврат(Дата(1,1,1));
КонецФункции

&НаСервере
Функция ПолучитьДатыЛО(ГоловнаяМТК,Номенклатура)
Парам = Новый Структура("ДатаПостановки,ДатаОкончания",Дата(1,1,1),Дата(1,1,1));
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.Изделие КАК Изделие,
	|	ЛьготнаяОчередь.Период КАК Период,
	|	ЛьготнаяОчередь.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.ПЗ.ДокументОснование = &МТК
	|	И ЛьготнаяОчередь.НормаРасходов.Элемент = &Элемент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
Запрос.УстановитьПараметр("МТК", ГоловнаяМТК);
Запрос.УстановитьПараметр("Элемент", Номенклатура);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
НомСтр = 1;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НомСтр = 1 Тогда
		Парам.ДатаПостановки = ВыборкаДетальныеЗаписи.Период;				
		КонецЕсли;
	Парам.ДатаОкончания = ВыборкаДетальныеЗаписи.ДатаОкончания; 
	НомСтр = НомСтр + 1;
	КонецЦикла;	
Возврат(Парам);
КонецФункции 

&НаСервере
Процедура СформироватьПоНестандартнымПФ()
ТабДок.Очистить();

ТЗ = Новый ТаблицаЗначений;

ТЗ.Колонки.Добавить("Линейка");
ТЗ.Колонки.Добавить("ГоловнаяМТК");
ТЗ.Колонки.Добавить("МТК");
ТЗ.Колонки.Добавить("ПФ");
ТЗ.Колонки.Добавить("КоличествоНПФ");
ТЗ.Колонки.Добавить("ДатаВыпуска");
ТЗ.Колонки.Добавить("ДатаПеремещения");
ТЗ.Колонки.Добавить("ДатаПостановки");
ТЗ.Колонки.Добавить("ДатаОкончания");

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблЛинейка = Макет.ПолучитьОбласть("Линейка");
ОблГоловнаяМТК = Макет.ПолучитьОбласть("ГоловнаяМТК");
ОблМТК = Макет.ПолучитьОбласть("МТК");
ОблПЗ = Макет.ПолучитьОбласть("ПЗ");
ОблПФ = Макет.ПолучитьОбласть("ПФ");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Отчет.Период.ДатаНачала;
ОблШапка.Параметры.ДатаКон = Отчет.Период.ДатаОкончания;
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;
ЗапросНПФ = Новый Запрос;

ЗапросНПФ.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеМПЗТабличнаяЧасть.МПЗ КАК МПЗ,
	|	ДвижениеМПЗТабличнаяЧасть.Количество КАК Количество,
	|	ДвижениеМПЗТабличнаяЧасть.Ссылка.ДокументОснование КАК МТК
	|ИЗ
	|	Документ.ДвижениеМПЗ.ТабличнаяЧасть КАК ДвижениеМПЗТабличнаяЧасть
	|ГДЕ
	|	ДвижениеМПЗТабличнаяЧасть.Ссылка.МестоХранения = &МестоХранения
	|	И ДвижениеМПЗТабличнаяЧасть.Ссылка.ДокументОснование.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ДвижениеМПЗТабличнаяЧасть.Ссылка.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И ДвижениеМПЗТабличнаяЧасть.МПЗ.Канбан.ПодразделениеДляСебестоимости В(&СписокПодразделений)
	|ИТОГИ ПО
	|	МТК,
	|	МПЗ";
ЗапросНПФ.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
ЗапросНПФ.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
ЗапросНПФ.УстановитьПараметр("МестоХранения", Справочники.МестаХранения.НайтиПоНаименованию("Невостребованные полуфабрикаты МО",Истина));
ЗапросНПФ.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
ЗапросНПФ.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
РезультатЗапроса = ЗапросНПФ.Выполнить();
ВыборкаНПФ_МТК = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНПФ_МТК.Следующий() Цикл
	ВыборкаМПЗ = ВыборкаНПФ_МТК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаМПЗ.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаМПЗ.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТЧ = ТЗ.Добавить();
			ТЧ.Линейка = ВыборкаНПФ_МТК.МТК.Линейка;
			ТЧ.ГоловнаяМТК = ВыборкаНПФ_МТК.МТК;
			ТЧ.ПФ = ВыборкаМПЗ.МПЗ;
			ТЧ.КоличествоНПФ = ВыборкаДетальныеЗаписи.Количество;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.ДокументОснование.ДокументОснование.Линейка КАК Линейка,
	|	ПроизводственноеЗадание.ДокументОснование.ДокументОснование КАК ГоловнаяМТК,
	|	ПроизводственноеЗадание.ДокументОснование КАК МТК,
	|	ПроизводственноеЗадание.Ссылка КАК ПЗ
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПроизводственноеЗадание.Подразделение В(&СписокПодразделений)
	|	И ПроизводственноеЗадание.ДокументОснование.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И ТИПЗНАЧЕНИЯ(ПроизводственноеЗадание.ДокументОснование.ДокументОснование) = ТИП(Документ.МаршрутнаяКарта)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Линейка,
	|	МТК
	|ИТОГИ ПО
	|	Линейка,
	|	ГоловнаяМТК,
	|	МТК";
Запрос.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаЛинейка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЛинейка.Следующий() Цикл
	ВыборкаГоловнаяМТК = ВыборкаЛинейка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГоловнаяМТК.Следующий() Цикл
		ВыборкаМТК = ВыборкаГоловнаяМТК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаМТК.Следующий() Цикл
			ВыборкаДетальныеЗаписи = ВыборкаМТК.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Выборка = ТЗ.НайтиСтроки(Новый Структура("Линейка,ГоловнаяМТК,ПФ",ВыборкаЛинейка.Линейка,ВыборкаГоловнаяМТК.ГоловнаяМТК,ВыборкаМТК.МТК.Номенклатура));
					Если Выборка.Количество() = 0 Тогда
					ТЧ = ТЗ.Добавить();
					ТЧ.Линейка = ВыборкаЛинейка.Линейка;
					ТЧ.ГоловнаяМТК = ВыборкаГоловнаяМТК.ГоловнаяМТК;
					ТЧ.МТК = ВыборкаМТК.МТК;
					ТЧ.ПФ = ВыборкаМТК.МТК.Номенклатура;					
					ТЧ.ДатаВыпуска = ПолучитьДатуВыпуска(ВыборкаДетальныеЗаписи.ПЗ);	
					ТЧ.ДатаПеремещения = ПолучитьДатуПеремещения(ВыборкаДетальныеЗаписи.ПЗ);
					Результат = ПолучитьДатыЛО(ВыборкаГоловнаяМТК.ГоловнаяМТК,ВыборкаМТК.МТК.Номенклатура);
					ТЧ.ДатаПостановки = Результат.ДатаПостановки;
					ТЧ.ДатаОкончания = Результат.ДатаОкончания;
					Иначе
					Выборка[0].МТК = ВыборкаМТК.МТК;
					Выборка[0].ДатаВыпуска = ПолучитьДатуВыпуска(ВыборкаДетальныеЗаписи.ПЗ);	
					Выборка[0].ДатаПеремещения = ПолучитьДатуПеремещения(ВыборкаДетальныеЗаписи.ПЗ);
					Результат = ПолучитьДатыЛО(ВыборкаГоловнаяМТК.ГоловнаяМТК,ВыборкаМТК.МТК.Номенклатура);
					Выборка[0].ДатаПостановки = Результат.ДатаПостановки;
					Выборка[0].ДатаОкончания = Результат.ДатаОкончания;					
					КонецЕсли;				
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
ТЗ.Сортировать("Линейка,ГоловнаяМТК,ПФ");
ТекЛинейка = Неопределено;
ТекГоловнаяМТК = Неопределено;
	Для каждого ТЧ Из ТЗ Цикл
		Если ТекЛинейка <> ТЧ.Линейка Тогда
			Если ТекЛинейка <> Неопределено Тогда
				Если ТекГоловнаяМТК <> Неопределено Тогда				
				ТабДок.ЗакончитьГруппуСтрок();
				КонецЕсли;				
			ТабДок.ЗакончитьГруппуСтрок();
			КонецЕсли;          		
		ТекЛинейка = ТЧ.Линейка;
		ОблЛинейка.Параметры.Линейка = ТЧ.Линейка;
		ТабДок.Вывести(ОблЛинейка);
		ТабДок.НачатьГруппуСтрок("Линейка",Истина);
		ТекГоловнаяМТК = ТЧ.ГоловнаяМТК;
		ОблГоловнаяМТК.Параметры.МТК = ТЧ.ГоловнаяМТК;
		ОблГоловнаяМТК.Параметры.Наименование = СокрЛП(ТЧ.ГоловнаяМТК.Номенклатура.Наименование);
		ОблГоловнаяМТК.Параметры.Изделие = ТЧ.ГоловнаяМТК.Номенклатура;
		ОблГоловнаяМТК.Параметры.Количество = ТЧ.ГоловнаяМТК.Количество;
		ТабДок.Вывести(ОблГоловнаяМТК);
		ТабДок.НачатьГруппуСтрок("ГоловнаяМТК",Истина);	
		КонецЕсли; 
			Если ТекГоловнаяМТК <> ТЧ.ГоловнаяМТК Тогда
				Если ТекГоловнаяМТК <> Неопределено Тогда				
				ТабДок.ЗакончитьГруппуСтрок();
				КонецЕсли;          		
			ТекГоловнаяМТК = ТЧ.ГоловнаяМТК;
			ОблГоловнаяМТК.Параметры.МТК = ТЧ.ГоловнаяМТК;
			ОблГоловнаяМТК.Параметры.Наименование = СокрЛП(ТЧ.ГоловнаяМТК.Номенклатура.Наименование);
			ОблГоловнаяМТК.Параметры.Изделие = ТЧ.ГоловнаяМТК.Номенклатура;
			ОблГоловнаяМТК.Параметры.Количество = ТЧ.ГоловнаяМТК.Количество;
			ТабДок.Вывести(ОблГоловнаяМТК);
			ТабДок.НачатьГруппуСтрок("ГоловнаяМТК",Истина);	
			КонецЕсли; 
	ОблПФ.Параметры.МТК = ТЧ.МТК;
	ОблПФ.Параметры.Наименование = СокрЛП(ТЧ.ПФ.Наименование);
	ОблПФ.Параметры.Изделие = ТЧ.ПФ;
	ОблПФ.Параметры.ДатаВыпуска = ТЧ.ДатаВыпуска;
	ОблПФ.Параметры.ДатаПеремещения = ТЧ.ДатаПеремещения;
	ОблПФ.Параметры.КоличествоНевостребованных = ТЧ.КоличествоНПФ;
	ОблПФ.Параметры.ДатаПостановки = ТЧ.ДатаПостановки;
	ОблПФ.Параметры.ДатаОкончания = ТЧ.ДатаОкончания;
	ТабДок.Вывести(ОблПФ);		
	КонецЦикла; 
		Если ТекЛинейка <> Неопределено Тогда				
		ТабДок.ЗакончитьГруппуСтрок();
		КонецЕсли; 
			Если ТекГоловнаяМТК <> Неопределено Тогда				
			ТабДок.ЗакончитьГруппуСтрок();
			КонецЕсли;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаСервере
Процедура СформироватьПоСтандартнымПФ()
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет2");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблЛинейка = Макет.ПолучитьОбласть("Линейка");
ОблМТК = Макет.ПолучитьОбласть("МТК");
ОблПЗ = Макет.ПолучитьОбласть("ПЗ");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Отчет.Период.ДатаНачала;
ОблШапка.Параметры.ДатаКон = Отчет.Период.ДатаОкончания;
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.Линейка КАК Линейка,
	|	ЛьготнаяОчередь.ПЗ.ДокументОснование КАК МТК,
	|	ЛьготнаяОчередь.Период КАК Период,
	|	ЛьготнаяОчередь.ДатаОкончания КАК ДатаОкончания,
	|	ЛьготнаяОчередь.НормаРасходов.Элемент КАК ПФ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И ЛьготнаяОчередь.ПЗ.ДокументОснование.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ЛьготнаяОчередь.НормаРасходов.Элемент.Канбан.Подразделение В(&СписокПодразделений)
	|	И ЛьготнаяОчередь.НормаРасходов.Элемент.Канбан.Служебный = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Линейка,
	|	МТК,
	|	ПФ,
	|	Период
	|ИТОГИ ПО
	|	Линейка,
	|	МТК,
	|	ПФ";
Запрос.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаЛинейка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЛинейка.Следующий() Цикл
	ОблЛинейка.Параметры.Линейка = ВыборкаЛинейка.Линейка;
	ТабДок.Вывести(ОблЛинейка);
	ТабДок.НачатьГруппуСтрок("Линейка",Истина);
	ВыборкаМТК = ВыборкаЛинейка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаМТК.Следующий() Цикл
		Номенклатура = ВыборкаМТК.МТК.Номенклатура;
		ОблМТК.Параметры.МТК = ВыборкаМТК.МТК;
		ОблМТК.Параметры.Наименование = СокрЛП(Номенклатура.Наименование);
		ОблМТК.Параметры.Изделие = Номенклатура;
		ОблМТК.Параметры.Количество = ВыборкаМТК.МТК.Количество;
		ТабДок.Вывести(ОблМТК);
		ТабДок.НачатьГруппуСтрок("МТК",Истина);
		ВыборкаПФ = ВыборкаМТК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПФ.Следующий() Цикл
			ПФ = ВыборкаПФ.ПФ;
			ОблПЗ.Параметры.Наименование = СокрЛП(ПФ.Наименование);
			ОблПЗ.Параметры.Изделие = ПФ;			
			ЯчейкиКомплектации = ОбщийМодульРаботаСРегистрами.ПолучитьЯчейкуКомплектации(ВыборкаЛинейка.Линейка,ПФ);
			ОблПЗ.Параметры.КолЯчеек = ЯчейкиКомплектации.КоличествоЯчеек;
			ОблПЗ.Параметры.КолВЯчейке = ЯчейкиКомплектации.КоличествоВЯчейке;
			ОблПЗ.Параметры.ТочкаЗаказа = ЯчейкиКомплектации.ТочкаЗаказа;
			ОблПЗ.Параметры.ДатаВыпуска = Дата(1,1,1);
			ОблПЗ.Параметры.ДатаПоступления = Дата(1,1,1);
			ОблПЗ.Параметры.ДатаПостановки = Дата(1,1,1);
			ОблПЗ.Параметры.ДатаОкончания = Дата(1,1,1); 
			НомСтр = 1;
			ВыборкаДетальныеЗаписи = ВыборкаПФ.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если НомСтр = 1 Тогда
					ОблПЗ.Параметры.ДатаПостановки = ВыборкаДетальныеЗаписи.Период;
					КонецЕсли; 
				ОблПЗ.Параметры.ДатаОкончания = ВыборкаДетальныеЗаписи.ДатаОкончания;			
				НомСтр = НомСтр + 1;
				КонецЦикла;
					Если ОблПЗ.Параметры.ДатаОкончания <> Дата(1,1,1) Тогда
					ОблПЗ.Параметры.ДатаВыпуска = ПолучитьДатуВыпускаДо(ПФ,ОблПЗ.Параметры.ДатаОкончания);
					ОблПЗ.Параметры.ДатаПоступления = ПолучитьДатуПоступленияДо(ПФ,ОблПЗ.Параметры.ДатаОкончания);				
					КонецЕсли;
			ТабДок.Вывести(ОблПЗ); 
			КонецЦикла;
		ТабДок.ЗакончитьГруппуСтрок();
		КонецЦикла;
	ТабДок.ЗакончитьГруппуСтрок();
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ВидОтчёта = 0 Тогда	
	СформироватьПоНестандартнымПФ();	
	Иначе
	СформироватьПоСтандартнымПФ();
	КонецЕсли;	 
КонецПроцедуры
