
Процедура ОбработкаПроведения(Отказ, Режим)
// регистр Передач в производство Приход
Движения.ПередачиВПроизводство.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
	Движение = Движения.ПередачиВПроизводство.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Документ = ТекСтрокаТабличнаяЧасть.Документ;
	Движение.ВидМПЗ = ТекСтрокаТабличнаяЧасть.ВидМПЗ;
	Движение.МПЗ = ТекСтрокаТабличнаяЧасть.МПЗ;
	Движение.Количество = ТекСтрокаТабличнаяЧасть.Количество;
	КонецЦикла;
КонецПроцедуры
