
&НаСервере
Процедура ЗагрузитьНаСервере(Наименование,УсловныйКоэффициент)
Номен = Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина);
	Если Не Номен.Пустая() Тогда
		Если Объект.ВидУсловногоКоэффициента = 1 Тогда
			Если Номен.УсловныеПриборы <> УсловныйКоэффициент Тогда
			НоменОбъект = Номен.ПолучитьОбъект();
			НоменОбъект.УсловныеПриборы = УсловныйКоэффициент;
			НоменОбъект.Записать();
			КонецЕсли;
		Иначе
			Если Номен.УсловныйКоэффициентПЭО <> УсловныйКоэффициент Тогда
			НоменОбъект = Номен.ПолучитьОбъект();
			НоменОбъект.УсловныйКоэффициентПЭО = УсловныйКоэффициент;
			НоменОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	Иначе	
	Сообщить(Наименование + " - не найдена в справочнике!");
	КонецЕсли; 
КонецПроцедуры 

&НаКлиенте
Процедура Загрузить(Команда) 
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c условными коэффициентами");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка условных коэффициентов из файла..."); 
        ЗагрузитьНаСервере(СокрЛП(ExcelЛист.Cells(к,1).Value),СокрЛП(ExcelЛист.Cells(к,2).Value));
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры
