
&НаСервере
Процедура ОстановитьНаСервере()
	Если Не ЗначениеЗаполнено(Объект.ПричинаОстановки) Тогда
	Сообщить("Выберите причину остановки!");
	Возврат;
	КонецЕсли;
Запрос = Новый Запрос;
 
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
		Для каждого ТЧ Из Объект.Канбаны Цикл
			Если ТЧ.Пометка Тогда
            Остановки = РегистрыСведений.ОстановкиКанбанов.СоздатьМенеджерЗаписи();
			Остановки.Период = ТекущаяДата();
			Остановки.Подразделение = Объект.Подразделение;
			Остановки.МПЗ = ТЧ.МПЗ;
			Остановки.Причина = Объект.ПричинаОстановки;
			Остановки.Записать();
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПростойЛинейки.Период,
				|	ПростойЛинейки.Линейка,
				|	ПростойЛинейки.Причина,
				|	ПростойЛинейки.Примечание
				|ИЗ
				|	РегистрСведений.ПростойЛинейки КАК ПростойЛинейки
				|ГДЕ
				|	ПростойЛинейки.Причина = &Причина
				|	И ПростойЛинейки.Окончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
			Запрос.УстановитьПараметр("Причина", ТЧ.МПЗ);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОстановкаЛинейки = РегистрыСведений.ПростойЛинейки.СоздатьМенеджерЗаписи();
				ОстановкаЛинейки.Период = ВыборкаДетальныеЗаписи.Период;
				ОстановкаЛинейки.Линейка = ВыборкаДетальныеЗаписи.Линейка;
				ОстановкаЛинейки.Причина = ТЧ.МПЗ;
				ОстановкаЛинейки.Примечание = ВыборкаДетальныеЗаписи.Примечание;
				ОстановкаЛинейки.Остановка = Ложь;
				ОстановкаЛинейки.Окончание = ТекущаяДата();
				ОстановкаЛинейки.Записать(Истина);
				КонецЦикла;
			КонецЕсли; 
		КонецЦикла; 
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;	
	ОстановкаПриИзмененииНаСервере();
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);	
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура СнятьОстановкуНаСервере()
Запрос = Новый Запрос;
Запрос1 = Новый Запрос;

	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;	
		Для каждого ТЧ Из Объект.Канбаны Цикл
			Если ТЧ.Пометка Тогда
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОстановкиКанбанов.Период,
				|	ОстановкиКанбанов.Подразделение,
				|	ОстановкиКанбанов.МПЗ,
				|	ОстановкиКанбанов.Причина
				|ИЗ
				|	РегистрСведений.ОстановкиКанбанов КАК ОстановкиКанбанов
				|ГДЕ
				|	ОстановкиКанбанов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|	И ОстановкиКанбанов.МПЗ = &МПЗ";
			Запрос.УстановитьПараметр("МПЗ",ТЧ.МПЗ);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	          	Остановки = РегистрыСведений.ОстановкиКанбанов.СоздатьМенеджерЗаписи();
				Остановки.Период = ВыборкаДетальныеЗаписи.Период;
				Остановки.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
				Остановки.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
				Остановки.Причина = ВыборкаДетальныеЗаписи.Причина;
		        Остановки.ДатаОкончания = ТекущаяДата();
				Остановки.Записать(Истина);
				Запрос1.Текст = 
					"ВЫБРАТЬ
					|	МаршрутнаяКарта.Ссылка
					|ИЗ
					|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
					|ГДЕ
					|	МаршрутнаяКарта.ИнициаторОстановки = &ИнициаторОстановки
					|	И МаршрутнаяКарта.МПЗОстановки = &МПЗОстановки
					|	И МаршрутнаяКарта.ДатаОкончанияОстановки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
				Запрос1.УстановитьПараметр("ИнициаторОстановки",Объект.Подразделение);
				Запрос1.УстановитьПараметр("МПЗОстановки",ВыборкаДетальныеЗаписи.МПЗ);
				РезультатЗапроса1 = Запрос1.Выполнить();
				ВыборкаМТК = РезультатЗапроса1.Выбрать();
					Пока ВыборкаМТК.Следующий() Цикл
					Статус = 0;
					ВыборкаПЗ = Документы.ПроизводственноеЗадание.Выбрать(,,Новый Структура("ДокументОснование",ВыборкаМТК.Ссылка));	
						Пока ВыборкаПЗ.Следующий() Цикл
							Если ВыборкаПЗ.ДатаЗапуска <> Дата(1,1,1) Тогда
							Статус = 1;
							КонецЕсли;
						Прервать;			
						КонецЦикла;
					МТК = ВыборкаМТК.Ссылка.ПолучитьОбъект();
					МТК.ДатаОкончанияОстановки = ТекущаяДата();
					МТК.Статус = Статус;
					МТК.Записать(РежимЗаписиДокумента.Проведение);
					КонецЦикла;
				КонецЦикла;
			КонецЕсли; 
		КонецЦикла;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;	
	ОстановкаПриИзмененииНаСервере();
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);	
	КонецПопытки; 
КонецПроцедуры

&НаКлиенте
Процедура ОстановкаПриИзменении(Элемент)
ОстановкаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОстановкаПриИзмененииНаСервере()
Объект.Канбаны.Очистить();
Запрос = Новый Запрос;
Запрос1 = Новый Запрос;

	Если Остановка = 1 Тогда
	Элементы.Обработать.Заголовок = "Остановить";
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОборотКанбанов.МПЗ КАК МПЗ
		|ИЗ
		|	РегистрСведений.ОборотКанбанов КАК ОборотКанбанов
		|ГДЕ
		|	ОборотКанбанов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ОборотКанбанов.МПЗ.Канбан.Подразделение = &Подразделение
		|ИТОГИ ПО
		|	МПЗ";
	Запрос.УстановитьПараметр("Подразделение",Объект.Подразделение);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаМПЗ.Следующий() Цикл
		Запрос1.Текст = 
			"ВЫБРАТЬ
			|	ОстановкиКанбанов.МПЗ,
			|	ОстановкиКанбанов.Причина
			|ИЗ
			|	РегистрСведений.ОстановкиКанбанов КАК ОстановкиКанбанов
			|ГДЕ
			|	ОстановкиКанбанов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|	И ОстановкиКанбанов.МПЗ = &МПЗ";
		Запрос1.УстановитьПараметр("МПЗ",ВыборкаМПЗ.МПЗ);
		РезультатЗапроса1 = Запрос1.Выполнить();
			Если РезультатЗапроса1.Пустой() Тогда
			ТЧ = Объект.Канбаны.Добавить();
			ТЧ.МПЗ = ВыборкаМПЗ.МПЗ;			
			КонецЕсли; 				
		КонецЦикла;		
	Иначе
	Элементы.Обработать.Заголовок = "Снять остановку";
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстановкиКанбанов.МПЗ,
		|	ОстановкиКанбанов.Причина
		|ИЗ
		|	РегистрСведений.ОстановкиКанбанов КАК ОстановкиКанбанов
		|ГДЕ
		|	ОстановкиКанбанов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТЧ = Объект.Канбаны.Добавить();
		ТЧ.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
		ТЧ.ПричинаОстановки = ВыборкаДетальныеЗаписи.Причина;
		КонецЦикла;	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Остановка = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
ОстановкаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Обработать(Команда)
	Если Остановка = 1 Тогда
		Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ОстановитьНаСервере();
		КонецЕсли; 
	Иначе
	СнятьОстановкуНаСервере();
	КонецЕсли;
КонецПроцедуры
