
&НаСервере
Процедура ЗаписатьДМНаСервере()
НаборЗаписей = РегистрыСведений.ДрагоценныеМеталлы.СоздатьНаборЗаписей();
НаборЗаписей.Отбор.ПЗ.Установить(Параметры.ПроизводственноеЗадание);
НаборЗаписей.Прочитать();
    Для Каждого Запись Из НаборЗаписей Цикл 
	Запись.ДМУзел = ДМУзел; 
    КонецЦикла;
НаборЗаписей.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДМ(Команда)
ЗаписатьДМНаСервере();
ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДрагоценныеМеталлы.ДМ1,
	|	ДрагоценныеМеталлы.ДМ2,
	|	ДрагоценныеМеталлы.ДМУзел
	|ИЗ
	|	РегистрСведений.ДрагоценныеМеталлы КАК ДрагоценныеМеталлы
	|ГДЕ
	|	ДрагоценныеМеталлы.ПЗ = &ПЗ";
Запрос.УстановитьПараметр("ПЗ", Параметры.ПроизводственноеЗадание);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныхЗаписей = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
	ДМ1 = ВыборкаДетальныхЗаписей.ДМ1;
	ДМ2 = ВыборкаДетальныхЗаписей.ДМ2;
	ДМУзел = ВыборкаДетальныхЗаписей.ДМУзел;
	КонецЦикла; 
КонецПроцедуры
