
Процедура ПередЗаписью(Отказ)
	Если Не ЭтоГруппа Тогда
		Если Не Авторизовано Тогда
		Запрос = Новый Запрос;

		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ КАК ПЗ
			|ИЗ
			|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних КАК ЭтапыПроизводственныхЗаданийСрезПоследних
			|ГДЕ
			|	ЭтапыПроизводственныхЗаданийСрезПоследних.РабочееМесто = &РабочееМесто
			|	И ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|	И ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.ДокументОснование.Статус <> 2";
		Запрос.УстановитьПараметр("РабочееМесто", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;
			Сообщить("На рабочем месте есть не завершенные задания!");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
