
&НаКлиенте
Процедура РаскрытьАрхивИЗапустить(Команда)
Файл = Новый Файл(РабочийКаталог+Формат(ТекущаяДата(),"ДФ=ddMMyyyy"));
	Если Не Файл.Существует() Тогда
	Состояние("Обработка...",,"Удаление старых файлов из рабочего каталога...",БиблиотекаКартинок.ДлительнаяОперация);
	Оп = Новый ОписаниеОповещения("ПослеУдаленияФайлов", ЭтотОбъект);
	НачатьУдалениеФайлов(Оп,РабочийКаталог,"*.*");
	Иначе
	ПослеУдаленияФайлов("");	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдаленияФайлов(Каталог) Экспорт
ИмяФайла = ОбщийМодульВызовСервера.ПолучитьФайлДокумента(Элементы.СписокПО.ТекущиеДанные.Значение);
ФС = Новый Файл(ИмяФайла);
	Если Найти(ВРег(ИмяФайла),".ZIP") = 0 Тогда
	Сообщить("Файл не является ZIP-архивом!");
	Возврат;
	КонецЕсли; 
Состояние("Обработка...",,"Распаковка архива в рабочий каталог...",БиблиотекаКартинок.ДлительнаяОперация);
Файл = Новый Файл(РабочийКаталог+Формат(ТекущаяДата(),"ДФ=ddMMyyyy")+"\"+ФС.ИмяБезРасширения);
	Если Не Файл.Существует() Тогда
	ЧтениеZIP = Новый ЧтениеZipФайла(ИмяФайла);
	ЧтениеZIP.ИзвлечьВсе(РабочийКаталог+Формат(ТекущаяДата(),"ДФ=ddMMyyyy"), РежимВосстановленияПутейФайловZIP.Восстанавливать);
	ЧтениеZIP.Закрыть();	
	КонецЕсли; 
Состояние("Обработка...",,"Поиск запускаемого файла...",БиблиотекаКартинок.ДлительнаяОперация);
МассивНайденныхФайлов = НайтиФайлы(РабочийКаталог+Формат(ТекущаяДата(),"ДФ=ddMMyyyy"), "*.bat",Истина);
	Если МассивНайденныхФайлов.Количество() > 0 Тогда
	    Для Каждого Файл Из МассивНайденныхФайлов Цикл
		Состояние("Обработка...",,"Запуск приложения...",БиблиотекаКартинок.ДлительнаяОперация);
		КомандаСистемы(Файл.ПолноеИмя, Файл.Путь); 
		Прервать;
	    КонецЦикла;
	Иначе
	Сообщить("Запускаемый файл с расширением *.bat не найден в архиве!");	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СпецификацияПриИзменении(Элемент)
СписокПО.Очистить();
ПолучитьСписокПО();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокПО()
НР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_Д(Спецификация,ТекущаяДата());
	Пока НР.Следующий() Цикл
		Если НР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Программа Тогда
			Если Найти(НР.Наименование,"ПО_embSoft_") > 0 Тогда
			СписокПО.Добавить(НР.Элемент,СокрЛП(НР.Наименование));
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура РабочийКаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
Диалог.Заголовок = "Выберите рабочий каталог";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
Диалог.Каталог = РабочийКаталог;
	Если Диалог.Выбрать() Тогда
	РабочийКаталог = Диалог.Каталог+"\"; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("Спецификация") Тогда
	Спецификация = ЭтаФорма.Параметры.Спецификация;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Спецификация.Пустая() Тогда	
	СписокПО.Очистить();
	ПолучитьСписокПО();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СписокПОПриАктивизацииСтроки(Элемент)
	Если Элементы.СписокПО.ТекущаяСтрока = Неопределено Тогда
	Возврат;
	КонецЕсли; 
Файл = Новый Файл(ОбщийМодульВызовСервера.ПолучитьФайлДокумента(Элементы.СписокПО.ТекущиеДанные.Значение));
	Если Файл.Существует() Тогда
		Если Не Файл.ЭтоКаталог() Тогда
		Элементы.ДанныеПоФайлу.Заголовок = "Имя файла: "+СокрЛП(Файл.Имя)+"; размер: "+Файл.Размер()+" байт; дата создания: "+Файл.ПолучитьВремяИзменения();
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
