
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ВыборкаНР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н(ЭтаФорма.Параметры.МТК.Номенклатура,ТекущаяДата());
	Пока ВыборкаНР.Следующий() Цикл
		Если ВыборкаНР.Элемент.Канбан = ЭтаФорма.Параметры.ВидКанбана Тогда	
		ПФ = ВыборкаНР.Элемент;
		Прервать;
		КонецЕсли; 
	КонецЦикла;
Количество = ЭтаФорма.Параметры.МТК.Количество;
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПривязатьПЗКНовойМТК(СтараяМТК,НоваяМТК)	
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Ссылка
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПроизводственноеЗадание.Номер";
Запрос.УстановитьПараметр("ДокументОснование", СтараяМТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
КолМТК = 0;
НомПЗ = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	КолМТК = КолМТК + 1;
		Если КолМТК > СтараяМТК.Количество Тогда
		НомПЗ = НомПЗ + 1;
		ПЗ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ПЗ.Номер = СокрЛП(НоваяМТК.Номер)+"-"+Формат(НомПЗ,"ЧЦ=3; ЧВН=");
		ПЗ.ДокументОснование = НоваяМТК;	
		ПЗ.Записать();
		КонецЕсли; 	
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Функция РазделитьМТКНаСервере()
	Для каждого ТЧ Из ТаблицаОстатков Цикл
		Если ТЧ.Пометка Тогда
			Попытка
			НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
			МТК = ЭтаФорма.Параметры.МТК.ПолучитьОбъект();
			МТК.Количество = МТК.Количество - ТЧ.Количество;
			МТК.Записать(РежимЗаписиДокумента.Проведение);
			НоваяМТК = МТК.Скопировать();
			НоваяМТК.Дата = ТекущаяДата();
			НоваяМТК.Количество = ТЧ.Количество;
			НоваяМТК.Комментарий = "Дополнительная МТК";				
			НоваяМТК.Записать(РежимЗаписиДокумента.Проведение);
			ПривязатьПЗКНовойМТК(МТК.Ссылка,НоваяМТК.Ссылка);
			//ОбщийМодульСозданиеДокументов.СоздатьМТК(МТК.Линейка,МТК.Номенклатура,ТЧ.Количество,МТК.СтандартныйКомментарий,МТК.Проект,,,,МТК.Счёт,МТК.ДатаОтгрузки,,,,МТК.НомерОчереди,,"Дополнительная МТК");		
			ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
			Исключение
			Сообщить(ОписаниеОшибки());
			ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
			Возврат(Ложь);
			КонецПопытки;	
		КонецЕсли;	
	КонецЦикла; 
Возврат(Истина);
КонецФункции

&НаКлиенте
Процедура РазделитьМТК(Команда)
	Если РазделитьМТКНаСервере() Тогда
	ЭтаФорма.Закрыть(Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Для каждого МестоХранения Из СписокМестХранения Цикл	
	ТЧ = ТаблицаОстатков.Добавить();
	ТЧ.МестоХранения = МестоХранения.Значение;
	ТЧ.Количество = ОбщийМодульВызовСервера.ПолучитьОстатокПоМестуХранения(МестоХранения.Значение,ПФ);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОстатковПометкаПриИзменении(Элемент)
	Если (Элементы.ТаблицаОстатков.ТекущиеДанные.Количество = 0)или(Элементы.ТаблицаОстатков.ТекущиеДанные.Количество >= Количество) Тогда
	Сообщить("При разделении МТК количество требуемого п.ф. на складе должно быть меньше, чем количество в МТК.");
	Элементы.ТаблицаОстатков.ТекущиеДанные.Пометка = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
ПриОткрытииНаСервере();
КонецПроцедуры
