
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

Макет = Отчеты.ОтчетПоЗаменеПолуфабрикатов.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = НачалоДня(Отчет.Период.ДатаНачала);
ОблШапка.Параметры.ДатаКон = КонецДня(Отчет.Период.ДатаОкончания);
ТабДок.Вывести(ОблШапка);

ЗапросРемонт = Новый Запрос;

ЗапросРемонт.Текст =
	"ВЫБРАТЬ
	|	РемонтнаяКартаЗаменяемыеЭлементы.МПЗ КАК МПЗ,
	|	РемонтнаяКартаЗаменяемыеЭлементы.Документ КАК Документ,
	|	РемонтнаяКартаЗаменяемыеЭлементы.Ссылка.Линейка КАК Линейка,
	|	РемонтнаяКартаЗаменяемыеЭлементы.Ссылка.ДокументОснование КАК ДокументОснование,
	|	РемонтнаяКартаЗаменяемыеЭлементы.Ссылка.ДокументОснование.Изделие КАК Изделие
	|ИЗ
	|	Документ.РемонтнаяКарта.ЗаменяемыеЭлементы КАК РемонтнаяКартаЗаменяемыеЭлементы
	|ГДЕ
	|	РемонтнаяКартаЗаменяемыеЭлементы.Ссылка.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И РемонтнаяКартаЗаменяемыеЭлементы.Ссылка.ДатаОкончания МЕЖДУ &ДатаНач И &ДатаКон";
	Если ТолькоНевыполненные Тогда
	ЗапросРемонт.Текст = ЗапросРемонт.Текст + " И Документ = &ПустоеПеремещение";
	ЗапросРемонт.УстановитьПараметр("ПустоеПеремещение", Документы.ДвижениеМПЗ.ПустаяСсылка());
	КонецЕсли; 
		Если СортироватьПо = 1 Тогда
		ЗапросРемонт.Текст = ЗапросРемонт.Текст + " УПОРЯДОЧИТЬ ПО Линейка";
		ИначеЕсли СортироватьПо = 2 Тогда
		ЗапросРемонт.Текст = ЗапросРемонт.Текст + " УПОРЯДОЧИТЬ ПО МПЗ";
		ИначеЕсли СортироватьПо = 3 Тогда
		ЗапросРемонт.Текст = ЗапросРемонт.Текст + " УПОРЯДОЧИТЬ ПО Изделие";
		КонецЕсли; 		
ЗапросРемонт.УстановитьПараметр("СписокЛинеек", СписокЛинеек);		
ЗапросРемонт.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
ЗапросРемонт.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
РезультатЗапросаРемонт = ЗапросРемонт.Выполнить();			
ВыборкаДетальныеЗаписиРемонт = РезультатЗапросаРемонт.Выбрать();			
	Пока ВыборкаДетальныеЗаписиРемонт.Следующий() Цикл
		Если ТипЗнч(ВыборкаДетальныеЗаписиРемонт.МПЗ) <> Тип("СправочникСсылка.Номенклатура") Тогда
		Продолжить;
		КонецЕсли; 
	ОблСтрока.Параметры.Линейка = ВыборкаДетальныеЗаписиРемонт.Линейка;
	ОблСтрока.Параметры.НаименованиеСпецификации = СокрЛП(ВыборкаДетальныеЗаписиРемонт.ПроизводственноеЗадание.Изделие.Наименование);
	ОблСтрока.Параметры.Спецификация = ВыборкаДетальныеЗаписиРемонт.Изделие;
	ОблСтрока.Параметры.НомерПЗ = ВыборкаДетальныеЗаписиРемонт.ПроизводственноеЗадание.Номер;
	ОблСтрока.Параметры.ПЗ = ВыборкаДетальныеЗаписиРемонт.ПроизводственноеЗадание;
	ОблСтрока.Параметры.НаименованиеПФ = СокрЛП(ВыборкаДетальныеЗаписиРемонт.МПЗ.Наименование);
	ОблСтрока.Параметры.ПФ = ВыборкаДетальныеЗаписиРемонт.Элемент;
		Если Не ВыборкаДетальныеЗаписиРемонт.Документ.Пустая() Тогда
		ОблСтрока.Параметры.НомерДок = ВыборкаДетальныеЗаписиРемонт.Документ.Номер;
		ОблСтрока.Параметры.Перемещение = ВыборкаДетальныеЗаписиРемонт.Документ;	
		Иначе
		ОблСтрока.Параметры.НомерДок = "";
		ОблСтрока.Параметры.Перемещение = "";		
		КонецЕсли; 
	ТабДок.Вывести(ОблСтрока);
	КонецЦикла;	
ТабДок.Вывести(ОблКонец);		
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

