
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Объект.Ссылка.Пустая() Тогда
		Если ПараметрыСеанса.Пользователь.Подразделения.Найти(Объект.Подразделение,"Подразделение") = Неопределено Тогда
		Сообщить("У Вас нет прав для просмотра этого документа!");
		Отказ = Истина;
		Возврат;
		КонецЕсли;
			Если Не ПараметрыСеанса.Пользователь.Должность.ПросмотрВсехДокументовРазрешенныхПодразделений Тогда	
				Если ПараметрыСеанса.Пользователь <> Объект.Автор Тогда
				Сообщить("У Вас нет прав для просмотра этого документа!");
				Отказ = Истина;
				КонецЕсли; 
			КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ЭтотОбъект.ТолькоПросмотр = ОбщийМодульСозданиеДокументов.ЗапретРедактирования(Объект.Ссылка,Ложь,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Отказ = Не ЭтаФорма.ПроверитьЗаполнение();
КонецПроцедуры

&НаСервере
Функция ПечатьОплатаПоПроектуНаСервере()
ТабДок = Новый ТабличныйДокумент;

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("ОплатаПоПроекту");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.Директор = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Директор завода");
ОблШапка.Параметры.Номер = Объект.Номер;
ОблШапка.Параметры.ГодДаты = Формат(КонецМесяца(Объект.Дата),"ДФ=yyyy");
ОблШапка.Параметры.Проект = СокрЛП(Объект.Проект.Наименование);
ОблШапка.Параметры.ДатаНач = Формат(НачалоМесяца(Объект.Дата),"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(КонецМесяца(Объект.Дата),"ДФ=dd.MM.yyyy");	
ОблШапка.Параметры.Подразделение = Объект.Подразделение;
ОблШапка.Параметры.Комментарий = Объект.Комментарий;
ТабДок.Вывести(ОблШапка);
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	ОблСтрока.Параметры.Заполнить(ТЧ);		
	ОблСтрока.Параметры.Сотрудник = СокрЛП(ТЧ.Исполнитель.Наименование);
	ОблСтрока.Параметры.Должность = СокрЛП(ТЧ.Исполнитель.Должность.Наименование);
	ОблСтрока.Параметры.ТабНомер = ТЧ.Исполнитель.ТабельныйНомер;
	ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
ОблКонец.Параметры.Мастер = Объект.Автор;
ОблКонец.Параметры.Сумма = Объект.ТабличнаяЧасть.Итог("Сумма");
ОблКонец.Параметры.Документ = Объект.Ссылка; 
ТабДок.Вывести(ОблКонец);
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура ПечатьОплатаПоПроекту(Команда)
ТД = ПечатьОплатаПоПроектуНаСервере();
ТД.Показать("Индивидуальный наряд");
КонецПроцедуры
        
&НаСервере
Процедура ЛинейкаПриИзмененииНаСервере()
Объект.Подразделение = Объект.Линейка.Подразделение;
КонецПроцедуры

&НаКлиенте
Процедура ЛинейкаПриИзменении(Элемент)
ЛинейкаПриИзмененииНаСервере();
КонецПроцедуры
