
&НаСервере
Процедура ПолучитьСписокКодов(СписокКодов,КодТовара,КодПоставщика)
Запрос = Новый Запрос;

Товар = Справочники.Товары.ПустаяСсылка();

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.Товар.Код = &Код
	|	И Материалы.ПометкаУдаления = ЛОЖЬ";
Запрос.УстановитьПараметр("Код", КодТовара);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Материал = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
		Если Не Материал.Пустая() Тогда
		СписокКодов.Добавить(Материал,КодПоставщика); 			
		Иначе
		Сообщить(""+КодТовара+" - материал не найден по коду товара!");
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(СписокКодов)
КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	Для каждого МПЗ Из СписокКодов  Цикл
	Выборка = КонтрагентОбъект.ТаблицаКодов.НайтиСтроки(Новый Структура("КодПоставщика",МПЗ.Представление));
		Если Выборка.Количество() = 0 Тогда
		Выборка = КонтрагентОбъект.ТаблицаКодов.НайтиСтроки(Новый Структура("МПЗ",МПЗ.Значение));
			Если Выборка.Количество() = 0 Тогда
			ТЧ = КонтрагентОбъект.ТаблицаКодов.Добавить();
			ТЧ.МПЗ = МПЗ.Значение;
			ТЧ.КодПоставщика = МПЗ.Представление;
			Иначе
			Выборка[0].КодПоставщика = МПЗ.Представление;
			КонецЕсли; 
		Иначе
		Выборка[0].МПЗ = МПЗ.Значение;
		КонецЕсли;
	КонецЦикла;
КонтрагентОбъект.Записать(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКоды(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c кодами поставщика");
	Если Результат <> Неопределено Тогда
	СписокКодов = Новый СписокЗначений;

	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Создание списка МПЗ по файлу..."); 
		ПолучитьСписокКодов(СписокКодов,Число(ExcelЛист.Cells(к,1).Value),СокрЛП(ExcelЛист.Cells(к,2).Value));
	    КонецЦикла;  
	Результат.Excel.Quit();
	КонецЕсли;		
		Если СписокКодов.Количество() > 0 Тогда
		Состояние("Обработка...",,"Загрузка кодов поставщика...");
		ЗагрузитьНаСервере(СписокКодов);
		КонецЕсли;  
КонецПроцедуры

&НаСервере
Функция ПроверитьНаСервере(КодПоставщика)
Выборка = Контрагент.ТаблицаКодов.НайтиСтроки(Новый Структура("КодПоставщика",КодПоставщика));
	Если Выборка.Количество() = 0 Тогда
	Сообщить(КодПоставщика + " - не найден в таблице кодов поставщика!");
	Возврат(Ложь);
	КонецЕсли;
Возврат(Истина);
КонецФункции

&НаСервере
Процедура ЗагрузитьСвободныеОстаткиНаСервере(КодПоставщика,СписокДанных,СрокПоставки)
Выборка = Контрагент.ТаблицаКодов.НайтиСтроки(Новый Структура("КодПоставщика",КодПоставщика));
	Если Выборка.Количество() = 0 Тогда
	Возврат;
	КонецЕсли;
МПЗ = Выборка[0].МПЗ;
СОП = РегистрыСведений.СвободныеОстаткиПоставщиков.СоздатьНаборЗаписей();
СОП.Отбор.МПЗ.Установить(МПЗ);
СОП.Записать();
	Для каждого Данные Из СписокДанных Цикл
	КолОстатков = Число(Данные.Представление);
		Если КолОстатков > 0 Тогда
		СОП = РегистрыСведений.СвободныеОстаткиПоставщиков.СоздатьМенеджерЗаписи();
		СОП.Период = Данные.Значение;
		СОП.МПЗ = МПЗ;
		СОП.Количество = КолОстатков;
		СОП.СрокПоставки = СрокПоставки;
		СОП.Записать();	
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСвободныеОстаткиПоставщика(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл cо свободными остатками");
	Если Результат <> Неопределено Тогда
	флПроверка = Истина;
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл				
		Состояние("Проверка...",к*100/КолСтрок,"Проверка материалов из файла..."); 
			Если Не ПроверитьНаСервере(СокрЛП(ExcelЛист.Cells(к,2).Value)) Тогда
			флПроверка = Ложь;
			КонецЕсли;
	    КонецЦикла;
			Если флПроверка Тогда
			СписокДанных = Новый СписокЗначений;

			КолКолонок = Результат.КоличествоКолонок;
			    Для стр = 2 по КолСтрок Цикл
				Состояние("Обработка...",к*100/КолСтрок,"Загрузка свободных остатков из файла...");
				СписокДанных.Очистить();
					Для к = 2 по КолКолонок Цикл
						Если к = 2 Тогда
						КодПоставщика = СокрЛП(ExcelЛист.Cells(стр,2).Value);
						ИначеЕсли к = 3 Тогда
						СрокПоставки = Число(ExcelЛист.Cells(стр,3).Value);
						Иначе
						СписокДанных.Добавить(Дата(ExcelЛист.Cells(стр,к+1).Value),Строка(ExcelЛист.Cells(стр,к).Value));
						к = к + 1;						
						КонецЕсли; 					
					КонецЦикла; 
		        ЗагрузитьСвободныеОстаткиНаСервере(КодПоставщика,СписокДанных,СрокПоставки);
			    КонецЦикла;
			Иначе
			Предупреждение("Загрузите недостающие коды поставщика и повторите обработку!");
			КонецЕсли; 
	Результат.Excel.Quit();
	КонецЕсли;		  
КонецПроцедуры
