
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
ШаблонПараметров.Отбор.Элементы.Очистить();
ЭлементОтбора = ШаблонПараметров.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
ЭлементОтбора.Использование = Истина;
ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
ЭлементОтбора.ПравоеЗначение = Элементы.Список.ТекущаяСтрока;
КонецПроцедуры

&НаКлиенте
Процедура НазначитьМатериалам(Команда)
ОткрытьФорму("Обработка.НазначениеВидовМатериалов.Форма",Новый Структура("ВидМатериала",Элементы.Список.ТекущаяСтрока),,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПараметров(Владелец)
Запрос = Новый Запрос;
СписокПараметров = Новый СписокЗначений;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныПараметровМатериалов.ПараметрМатериала КАК ПараметрМатериала
	|ИЗ
	|	Справочник.ШаблоныПараметровМатериалов КАК ШаблоныПараметровМатериалов
	|ГДЕ
	|	ШаблоныПараметровМатериалов.Владелец = &Владелец";
Запрос.УстановитьПараметр("Владелец", Владелец);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокПараметров.Добавить(ВыборкаДетальныеЗаписи.ПараметрМатериала);
	КонецЦикла;
Возврат(СписокПараметров);
КонецФункции

&НаКлиенте
Процедура ВыгрузитьШаблон(Команда)
ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
ДиалогОткрытияФайла.МножественныйВыбор   = Ложь; 
ДиалогОткрытияФайла.Заголовок            = "Выберите каталог для выгрузки"; 
	Если Не ДиалогОткрытияФайла.Выбрать() Тогда 
	Сообщить("Каталог не выбран!");
    Возврат;
    КонецЕсли;
ЗаписьТекста = Новый ЗаписьТекста(ДиалогОткрытияФайла.Каталог+"\"+Элементы.Список.ТекущаяСтрока+".txt",КодировкаТекста.ANSI,,Ложь);

ЗаписьТекста.ЗаписатьСтроку(":ID_template:"+Элементы.Список.ТекущиеДанные.Код);
СписокПараметров = ПолучитьСписокПараметров(Элементы.Список.ТекущаяСтрока);
	Для каждого Парам Из СписокПараметров Цикл	
	ЗаписьТекста.ЗаписатьСтроку(":"+Парам.Значение+"::");
	КонецЦикла;
ЗаписьТекста.Закрыть();
КонецПроцедуры
