
Процедура ОбработкаПроведения(Отказ, Режим)
// регистр ЗаявкиНаЗакупку Приход
Движения.ЗаявкиНаЗакупку.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
	Движение = Движения.ЗаявкиНаЗакупку.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Подразделение = Подразделение;
	Движение.МПЗ = ТекСтрокаТабличнаяЧасть.МПЗ;
	Движение.Количество = ТекСтрокаТабличнаяЧасть.Количество;
	Движение.ЗаявкаНаЗакупку = ТекСтрокаТабличнаяЧасть.ЗаявкаНаЗакупку;
	КонецЦикла;
КонецПроцедуры
