
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("ВидМатериала") Тогда
	ВидМатериала = ЭтаФорма.Параметры.ВидМатериала;
	КонецЕсли;
		Если ЭтаФорма.Параметры.Свойство("ГруппаМатериалов") Тогда
		ГруппаМатериалов = ЭтаФорма.Параметры.ГруппаМатериалов;
		КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ГруппаМатериаловПриИзмененииНаСервере()
ТаблицаМатериалов.Очистить();
Выборка = Справочники.Материалы.Выбрать(ГруппаМатериалов,,,"Наименование");
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.ЭтоГруппа Тогда		
		ТЧ = ТаблицаМатериалов.Добавить();
		ТЧ.Материал = Выборка.Ссылка;
		ТЧ.ВидМатериала = Выборка.ВидМатериала;
		КонецЕсли;	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ГруппаМатериаловПриИзменении(Элемент)
ГруппаМатериаловПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыбратьПоПризнакуНаСервере(Признак)
	Для каждого ТЧ Из ТаблицаМатериалов Цикл	
		Если Найти(ТЧ.Материал.Наименование,Признак) > 0 Тогда
		ТЧ.Пометка = Истина;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПоПризнаку(Команда)
Признак = "";
	Если ВвестиСтроку(Признак,"Введите признак",100) Тогда
	ВыбратьПоПризнакуНаСервере(Признак);	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из ТаблицаМатериалов Цикл	
	ТЧ.Пометка = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура НазначитьВидМатериалаНаСервере()
	Для каждого ТЧ Из ТаблицаМатериалов Цикл	
		Если ТЧ.Пометка Тогда
		Мат = ТЧ.Материал.ПолучитьОбъект();
		Мат.ВидМатериала = ВидМатериала;
		Мат.Записать();
		ТЧ.ВидМатериала = ВидМатериала;
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НазначитьВидМатериала(Команда)
НазначитьВидМатериалаНаСервере();
КонецПроцедуры
