
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
РасчетныйСчет = Константы.ОсновнойБанковскийСчёт.Получить();
	Если Не ПараметрыСеанса.Пользователь.СервисЦентр.Контрагент.Пустая() Тогда
	Контрагент = ПараметрыСеанса.Пользователь.СервисЦентр.Контрагент;
	Договор = ПараметрыСеанса.Пользователь.СервисЦентр.Контрагент.ОсновнойДоговор;
	Подразделение = Справочники.Подразделения.НайтиПоКоду("04");
	КонецЕсли; 
Коэфф = 1;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
	УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение,Дата));
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
// регистр ЗаявкиОтПокупателей Приход
Движения.ЗаявкиОтПокупателей.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
	Движение = Движения.ЗаявкиОтПокупателей.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.МПЗ = ТекСтрокаТабличнаяЧасть.МПЗ;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.ДатаИсполнения = ДатаИсполнения;
	Движение.ЗаявкаОтПокупателя = Ссылка;
	Движение.Количество = ПолучитьБазовоеКоличество(ТекСтрокаТабличнаяЧасть.Количество,ТекСтрокаТабличнаяЧасть.ЕдиницаИзмерения);
	КонецЦикла;
КонецПроцедуры
