
&НаСервере
Процедура СохранитьПараметрСеанса(ВыбПараметр)
КлючНазначенияИспользования = "СохранениеЭлементаСправочника";
ИмяНастройки = "["+ТипЗнч(ВыбПараметр)+"]"+Символы.Таб+СокрЛП(ВыбПараметр.Наименование);
СписокНастроек = ХранилищеОбщихНастроек.ПолучитьСписок(КлючНазначенияИспользования, ИмяПользователя()); 
Стр = СписокНастроек.НайтиПоЗначению(ИмяНастройки);
	Если Стр = Неопределено Тогда
	ХранилищеОбщихНастроек.Сохранить(КлючНазначенияИспользования, ИмяНастройки, ВыбПараметр, ИмяПользователя());
	Иначе
	Сообщить("Элемент уже сохранён!");
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
СохранитьПараметрСеанса(ПараметрКоманды);
КонецПроцедуры
