
&НаСервере
Функция ДобавитьПоПроектуНаСервере(Проект,Стр)
	Если Стр.ЭтоГруппа Тогда
	ТекГруппа = Стр;
	Иначе
	ТекГруппа = Стр.Родитель;	
	КонецЕсли; 
Статья = Справочники.СтатьиПоступленийСписанийПрочих.СоздатьЭлемент();
Статья.Родитель = ТекГруппа;
Статья.Код = Проект.Код;
Статья.Наименование = СокрЛП(Проект.Код)+" "+Проект.Наименование; 
Статья.Проект = Проект;
Статья.Записать();
Возврат(Статья.Ссылка);
КонецФункции

&НаКлиенте
Процедура ДобавитьПоПроекту(Команда)
ВыбПроект = Неопределено;
	Если ВвестиЗначение(ВыбПроект,"Выберите проект",Тип("СправочникСсылка.Проекты")) Тогда
	НовыйЭлемент = ДобавитьПоПроектуНаСервере(ВыбПроект,Элементы.Список.ТекущаяСтрока);
	Элементы.Список.Обновить();
	Элементы.Список.ТекущаяСтрока = НовыйЭлемент;
	КонецЕсли; 
КонецПроцедуры
