
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
Статус = 2;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Статус = 2 Тогда
	Сообщить("Документ имеет статус Перепрогон!");
	Отказ = Истина;
	Возврат;
	КонецЕсли; 
		Если ТабличнаяЧасть.Количество() > 0 Тогда
			Если Не ЗначениеЗаполнено(ДокументСписания) Тогда
			Сообщить("Не создан документ списания");
			Отказ = Истина;
			Возврат;
			КонецЕсли;	
		КонецЕсли;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеМПЗ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ДвижениеМПЗ КАК ДвижениеМПЗ
	|ГДЕ
	|	ДвижениеМПЗ.ДокументОснование = &ДокументОснование
	|	И ДвижениеМПЗ.Проведен = ИСТИНА";	
Запрос.УстановитьПараметр("ДокументОснование", Ссылка);	
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Отказ = Истина;
	Сообщить("Документ движения уже создан!");
	Возврат;
	КонецЦикла;

//Создание документа движения
МестоХраненияПерепрогон = Константы.МестоХраненияПерепрогон.Получить();
Перемещение = Документы.ДвижениеМПЗ.СоздатьДокумент();
Перемещение.Дата = ТекущаяДата();
Перемещение.УстановитьНовыйНомер(ПрисвоитьПрефикс(МестоХраненияПерепрогон.Подразделение));
Перемещение.Автор = ПараметрыСеанса.Пользователь;
Перемещение.ДокументОснование = Ссылка;
Перемещение.Подразделение = МестоХраненияПерепрогон.Подразделение;
Перемещение.МестоХранения = МестоХраненияПерепрогон;
Перемещение.МестоХраненияВ = МестоХранения;
ТЧ = Перемещение.ТабличнаяЧасть.Добавить();
	Если ТипЗнч(Изделие) = Тип("СправочникСсылка.Номенклатура") Тогда
	ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
	Иначе				
	ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
	КонецЕсли; 
ТЧ.МПЗ = Изделие;
ТЧ.Количество = Количество/Изделие.ОсновнаяЕдиницаИзмерения.Коэффициент;
ТЧ.ЕдиницаИзмерения = Изделие.ОсновнаяЕдиницаИзмерения;	
Перемещение.Записать(РежимЗаписиДокумента.Проведение);	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеМПЗ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ДвижениеМПЗ КАК ДвижениеМПЗ
	|ГДЕ
	|	ДвижениеМПЗ.ДокументОснование = &ДокументОснование";	
Запрос.УстановитьПараметр("ДокументОснование", Ссылка);	
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Перемещение = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Перемещение.УстановитьПометкуУдаления(Истина);
	Перемещение.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;
КонецПроцедуры

