
&НаСервере
Функция ПолучитьСписокРеализаций()
СписокРеализаций = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реализация.Ссылка
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И Реализация.Проведен = ИСТИНА
	|	И Реализация.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реализация.Номер";
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.Период.ДатаОкончания));
Запрос.УстановитьПараметр("Контрагент", Контрагент);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокРеализаций.Добавить(ВыборкаДетальныеЗаписи.Ссылка,ВыборкаДетальныеЗаписи.Ссылка.Номер);
	КонецЦикла;
Возврат(СписокРеализаций);
КонецФункции

&НаСервере
Функция ПолучитьДатуРеализации(Док)
Возврат(Док.Дата);
КонецФункции

&НаСервере
Функция ПолучитьКомментарийРеализации(Док)
Возврат(Док.Комментарий);
КонецФункции

&НаСервере
Функция ЗаполненДокументОснование(Док)
Возврат(ЗначениеЗаполнено(Док.ДокументОснование));
КонецФункции

&НаСервере
Функция ПолучитьНомерДокументаОснования(Док)
Возврат(Док.ДокументОснование.Номер);
КонецФункции

&НаСервере
Функция ПолучитьДатуДокументаОснования(Док)
Возврат(Док.ДокументОснование.Дата);
КонецФункции

&НаСервере
Функция ПолучитьМестоХраненияРеализации(Док)
Возврат(Док.МестоХранения);
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуМПЗ(Док)
ТаблицаМПЗ.Очистить();
	Для каждого ТЧ Из Док.ТабличнаяЧасть Цикл
	ТЧ_МПЗ = ТаблицаМПЗ.Добавить();
		Если ТЧ.ВидТовара = Перечисления.ВидыМПЗ.Материалы Тогда	
		ТЧ_МПЗ.ВидМПЗ = 1;
		Иначе
		ТЧ_МПЗ.ВидМПЗ = 2;
		КонецЕсли; 
	ТЧ_МПЗ.МПЗ = СокрЛП(ТЧ.Товар.Наименование);
	ТЧ_МПЗ.Количество = ТЧ.Количество;
	ТЧ_МПЗ.ЕдиницаИзмерения = СокрЛП(ТЧ.ЕдиницаИзмерения.Наименование);
	ТЧ_МПЗ.Цена = ТЧ.Цена;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ПоступлениеТоваров(БазаХарькова,Проверить,Реализация,РеализацияНомер)
РеализацияДата = ПолучитьДатуРеализации(Реализация);
МестоХранения = ПолучитьМестоХраненияРеализации(Реализация);

Док = БазаХарькова.Документы.ПоступлениеМПЗ.НайтиПоРеквизиту("НомерДокВходящий",РеализацияНомер);
	Если Не Док.Пустая() Тогда
	Сообщить("Реализация №"+РеализацияНомер+" уже перенесён в производственную базу 1С8 Харькова.");
	Возврат;
	КонецЕсли;
Док = БазаХарькова.Документы.ПоступлениеМПЗ.СоздатьДокумент();
	Если ИспользоватьРучнуюНумерацию Тогда
	Док.Номер = Прав(Год(РеализацияДата),2)+"-"+Формат(ТекНомерП,"ЧЦ=6; ЧВН=; ЧГ=0");
	ТекНомерП = ТекНомерП + 1;
	//Иначе
	//Док.УстановитьНовыйНомер(Прав(Год(РеализацияДата),2)+"-");	
	КонецЕсли; 
Док.Дата = РеализацияДата;	                      
Док.НомерДокВходящий = РеализацияНомер;
Док.ДатаДокВходящий = РеализацияДата;
Док.Курс = 0.2;
Док.Комментарий = ПолучитьКомментарийРеализации(Реализация);
ЗаполнитьТаблицуМПЗ(Реализация);              
	Для каждого ТЧ Из ТаблицаМПЗ Цикл
		Если ТЧ.ВидМПЗ = 1 Тогда
		Мат = БазаХарькова.Справочники.Материалы.НайтиПоНаименованию(ТЧ.МПЗ,Истина);
			Если Не Мат.Пустая() Тогда
			ТЧ_МПЗ = Док.ТабличнаяЧасть.Добавить();
			ТЧ_МПЗ.ВидМПЗ = БазаХарькова.Перечисления.ВидыМПЗ.Материалы;  
			ТЧ_МПЗ.МПЗ = Мат;                
			ТЧ_МПЗ.Количество = ТЧ.Количество;                                 
			ТЧ_МПЗ.ЦенаВалюта = ТЧ.Цена; 					
			ТЧ_МПЗ.ЕдиницаИзмерения = БазаХарькова.Справочники.ОсновныеЕдиницыИзмерений.НайтиПоНаименованию(ТЧ.ЕдиницаИзмерения,Истина,,Мат);									
			Иначе
			Сообщить("Материал "+ТЧ.МПЗ+" - не найден в производственной базе 1С8 Харькова!");	
			КонецЕсли;
		Иначе
		Номен = БазаХарькова.Справочники.Номенклатура.НайтиПоНаименованию(ТЧ.МПЗ,Истина);
			Если Не Номен.Пустая() Тогда
			ТЧ_МПЗ = Док.ТабличнаяЧасть.Добавить();
			ТЧ_МПЗ.ВидМПЗ = БазаХарькова.Перечисления.ВидыМПЗ.Полуфабрикаты;  
			ТЧ_МПЗ.МПЗ = Номен;                
			ТЧ_МПЗ.Количество = ТЧ.Количество;                                 
			ТЧ_МПЗ.ЦенаВалюта = ТЧ.Цена; 					
			ТЧ_МПЗ.ЕдиницаИзмерения = БазаХарькова.Справочники.ОсновныеЕдиницыИзмерений.НайтиПоНаименованию(ТЧ.ЕдиницаИзмерения,Истина,,Номен);				
			Иначе
				Если СоздатьНедостающиеПолуфабрикаты Тогда
				НоменНовый = БазаХарькова.Справочники.Номенклатура.СоздатьЭлемент();
				НоменНовый.Родитель = БазаХарькова.Справочники.Номенклатура.НайтиПоНаименованию("Товары для перепродажи",Истина);
				НоменНовый.Наименование = ТЧ.МПЗ;
				НоменНовый.ПолнНаименование = ТЧ.МПЗ;
				НоменНовый.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерений.НайтиПоНаименованию("шт",Истина);			
				НоменНовый.Записать();
				ОснЕИ = БазаХарькова.Справочники.ОсновныеЕдиницыИзмерений.СоздатьЭлемент();
				ОснЕИ.Владелец = НоменНовый.Ссылка;
				ОснЕИ.ЕдиницаИзмерения = НоменНовый.ЕдиницаИзмерения;
				ОснЕИ.Коэффициент = 1;
				ОснЕИ.Наименование = НоменНовый.ЕдиницаИзмерения.Наименование;
				ОснЕИ.Записать();
				НоменНовый.ОсновнаяЕдиницаИзмерения = ОснЕИ.Ссылка;  
				НоменНовый.Записать();	                                       
				Сообщить("Полуфабрикат "+ТЧ.МПЗ+" - создан в производственной базе 1С8 Харькова!");								
				Иначе	
				Сообщить("Полуфабрикат "+ТЧ.МПЗ+" - не найден в производственной базе 1С8 Харькова!");
				КонецЕсли; 
			КонецЕсли;			
		КонецЕсли; 		
	КонецЦикла;
		Если Не Проверить Тогда
			Если Док.ТабличнаяЧасть.Количество() > 0 Тогда
				Если ЗаполненДокументОснование(Реализация) Тогда
				ЗаказПоставщику = БазаХарькова.Документы.ЗаказПоставщику.НайтиПоНомеру(ПолучитьНомерДокументаОснования(Реализация),ПолучитьДатуДокументаОснования(Реализация));
				Док.ДокументОснование = ЗаказПоставщику;
				КонецЕсли; 
					Попытка
					Док.Записать();
					Сообщить("Реализация материалов №"+РеализацияНомер+" перенесён в Поступление МПЗ №"+СокрЛП(Док.Номер));
					Исключение
					Сообщить(ОписаниеОшибки());
					Сообщить("Реализация материалов №"+РеализацияНомер+" не перенесён.");
					КонецПопытки;
			Иначе
			Сообщить("Реализация материалов №"+РеализацияНомер+" не перенесён из-за отсутствия элементов в базе.");
			КонецЕсли; 				
		КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере(СписокРеализаций)
БазаХарькова = ОбщийМодульСинхронизации.УстановитьCOMСоединение(Объект.ОбменДанными);
	Если БазаХарькова = Неопределено Тогда
	Сообщить("Не открыто соединение с производственной базой Харькова!");
	Возврат;
	КонецЕсли;
		Для каждого Реализация Из СписокРеализаций Цикл
		ПоступлениеТоваров(БазаХарькова,Истина,Реализация.Значение,Реализация.Представление);
		КонецЦикла;
КонецПроцедуры 

&НаКлиенте
Процедура Проверить(Команда)
Состояние("Обработка...",,"Получение списка документов Реализация...");
СписокРеализаций = ПолучитьСписокРеализаций();
Состояние("Обработка...",,"Проверка поступлений...");
ПроверитьНаСервере(СписокРеализаций);
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере(СписокРеализаций)
БазаХарькова = ОбщийМодульСинхронизации.УстановитьCOMСоединение(Объект.ОбменДанными);
	Если БазаХарькова = Неопределено Тогда
	Сообщить("Не открыто соединение с производственной базой Харькова!");
	Возврат;
	КонецЕсли;
		Для каждого Реализация Из СписокРеализаций Цикл
		ПоступлениеТоваров(БазаХарькова,Ложь,Реализация.Значение,Реализация.Представление);
		КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Соединиться(Команда,Проверить = Ложь)
Состояние("Обработка...",,"Получение списка документов Реализация...");
СписокРеализаций = ПолучитьСписокРеализаций();
Состояние("Обработка...",,"Выгрузка реализаций...");
ВыгрузитьНаСервере(СписокРеализаций);  
КонецПроцедуры
