
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблННС = Макет.ПолучитьОбласть("ННС");
ОблПродукция = Макет.ПолучитьОбласть("Продукция");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НакладнаяНаСборку.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НакладнаяНаСборку КАК НакладнаяНаСборку
	|ГДЕ
	|	НакладнаяНаСборку.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И НакладнаяНаСборку.Проведен = ИСТИНА";
	Если Не Автор.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборку.Автор = &Автор";
	Запрос.УстановитьПараметр("Автор", Автор);
	КонецЕсли;
		Если Не Контрагент.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборку.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		КонецЕсли;
			Если ЛинейкаУпаковки > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборку.ЛинейкаУпаковки = &ЛинейкаУпаковки";
			Запрос.УстановитьПараметр("ЛинейкаУпаковки", ЛинейкаУпаковки);
			КонецЕсли;
				Если ЗначениеЗаполнено(ДатаОтгрузки) Тогда
				Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборку.ДатаОтгрузки = &ДатаОтгрузки";
				Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
				КонецЕсли; 
Запрос.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО НакладнаяНаСборку.Дата";
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
КоличествоВсего = 0;
КоличествоНаСборке = 0;
КоличествоСобрано = 0;
КоличествоНаУпаковке = 0;
КоличествоУпаковано = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ННС = ВыборкаДетальныеЗаписи.Ссылка;
	ИсполнительННС = ННС.ТабличнаяЧасть[0].Исполнитель;
		Если Не Исполнитель.Пустая() Тогда
			Если ИсполнительННС <> Исполнитель Тогда
			Продолжить;
			КонецЕсли;	
		КонецЕсли; 
	ОблННС.Параметры.Номер = ННС.Номер;
	ОблННС.Параметры.Дата = ННС.Дата;
	ОблННС.Параметры.ННС = ННС;
	ОблННС.Параметры.ЛинейкаУпаковки = ННС.ЛинейкаУпаковки;
	ОблННС.Параметры.НомераТары = ННС.НомераТары;
	ОблННС.Параметры.Клиент = ННС.Контрагент;
	ОблННС.Параметры.КартаДоставки = ННС.КартаДоставки;
	ОблННС.Параметры.Исполнитель = ИсполнительННС;
	ОблННС.Параметры.Автор = ННС.Автор;
	Количество = 0;
		Для каждого ТЧ Из ННС.ТабличнаяЧасть Цикл
		Количество = Количество + ТЧ.Количество;
		КонецЦикла; 
	ОблННС.Параметры.Количество = Количество;
	ДатаСоздан = ННС.Дата;
    ДатаНаСборке = "";
    ДатаСобран = "";
    ДатаНаУпаковке = "";
    ДатаУпакован = "";
	НаборЗаписей = РегистрыСведений.СтатусыНакладныхНаСборку.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НакладнаяНаСборку.Установить(ННС);
	НаборЗаписей.Прочитать();
	    Для Каждого Запись Из НаборЗаписей Цикл
        	Если Запись.Статус = Перечисления.СтатусыНакладнойНаСборку.Создан Тогда
			ДатаСоздан = Запись.Период;
        	ИначеЕсли Запись.Статус = Перечисления.СтатусыНакладнойНаСборку.НаСборке Тогда
			ДатаНаСборке = Запись.Период;
			КоличествоНаСборке = КоличествоНаСборке + Количество;
        	ИначеЕсли Запись.Статус = Перечисления.СтатусыНакладнойНаСборку.Собран Тогда
			ДатаСобран = Запись.Период;
			КоличествоСобрано = КоличествоСобрано + Количество;
        	ИначеЕсли Запись.Статус = Перечисления.СтатусыНакладнойНаСборку.НаУпаковке Тогда
			ДатаНаУпаковке = Запись.Период;
			КоличествоНаУпаковке = КоличествоНаУпаковке + Количество;
        	ИначеЕсли Запись.Статус = Перечисления.СтатусыНакладнойНаСборку.Упакован Тогда
			ДатаУпакован = Запись.Период;					
			КоличествоУпаковано = КоличествоУпаковано + Количество;
			КонецЕсли; 
		КонецЦикла;
	ОблННС.Параметры.ДатаСоздан = ДатаСоздан;
	ОблННС.Параметры.ДатаНаСборке = ДатаНаСборке;
	ОблННС.Параметры.ДатаСобран = ДатаСобран;
	ОблННС.Параметры.ДатаНаУпаковке = ДатаНаУпаковке;
	ОблННС.Параметры.ДатаУпакован = ДатаУпакован;
	ТабДок.Вывести(ОблННС);
	КоличествоВсего = КоличествоВсего + Количество;
		Если Расшифровать Тогда	
		ТабДок.НачатьГруппуСтрок(ННС,Истина);
			Для каждого ТЧ Из ННС.ТабличнаяЧасть Цикл
			ОблПродукция.Параметры.Продукция = ТЧ.Продукция;
			ОблПродукция.Параметры.Количество = ТЧ.Количество;
			ОблПродукция.Параметры.Исполнитель = ТЧ.Исполнитель;		
			ТабДок.Вывести(ОблПродукция);
			КонецЦикла; 
		ТабДок.ЗакончитьГруппуСтрок();
		КонецЕсли; 
	КонецЦикла;
ОблКонец.Параметры.Количество = КоличествоВсего;
ОблКонец.Параметры.КоличествоНаСборке = КоличествоНаСборке; 
ОблКонец.Параметры.КоличествоСобрано = КоличествоСобрано;
ОблКонец.Параметры.КоличествоНаУпаковке = КоличествоНаУпаковке;
ОблКонец.Параметры.КоличествоУпаковано = КоличествоУпаковано;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
