
&НаСервере
Функция ПолучитьСписокСохранений()
Возврат(ХранилищеОбщихНастроек.ПолучитьСписок("СохранениеЭлементаСправочника", ИмяПользователя()));
КонецФункции 

&НаСервере
Функция ОКНаСервере(ВыбИмяНастройки)
Возврат(ХранилищеОбщихНастроек.Загрузить("СохранениеЭлементаСправочника", ВыбИмяНастройки ,ИмяПользователя()));
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
СписокСправочника = Новый СписокЗначений();

СписокСохранений = ПолучитьСписокСохранений();
	Для каждого Стр Из СписокСохранений Цикл
		Если ТипЗнч(ОКНаСервере(Стр.Значение)) = ТипЗнч(ПараметрыВыполненияКоманды.Источник.Элементы.Список.ТекущаяСтрока) Тогда
		СписокСправочника.Добавить(Стр.Значение);
		КонецЕсли;	
	КонецЦикла;
		Если СписокСправочника.Количество() = 1 Тогда
		ПараметрыВыполненияКоманды.Источник.Элементы.Список.ТекущаяСтрока = ОКНаСервере(СписокСправочника[0].Значение);
		ИначеЕсли СписокСправочника.Количество() > 0 Тогда
		Элемент = СписокСправочника.ВыбратьЭлемент("Выберите элемент");	
			Если Элемент <> Неопределено Тогда
			ПараметрыВыполненияКоманды.Источник.Элементы.Список.ТекущаяСтрока = ОКНаСервере(Элемент.Значение);
			Иначе
			Возврат;
			КонецЕсли;
		Иначе
		Состояние("ВНИМАНИЕ!",,"Нет сохранённого значения",БиблиотекаКартинок.Удалить);	
		КонецЕсли; 
КонецПроцедуры
