
&НаСервере
Процедура ЗагрузитьНаСервере(Код)
Выбор = Справочники.КодыIMEI.НайтиПоКоду(Код);
	Если Выбор.Пустая() Тогда
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БарКоды.БарКод КАК БарКод
		|ИЗ
		|	РегистрСведений.БарКоды КАК БарКоды
		|ГДЕ
		|	БарКоды.IMEI = &IMEI";
	Запрос.УстановитьПараметр("IMEI", Код);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		Спр = Справочники.КодыIMEI.СоздатьЭлемент();
		Спр.Код = Код; 
		Спр.Записать();	
		Иначе
	    Сообщить(Код+" уже присвоен изделию!");
		КонецЕсли; 
	Иначе
	Сообщить(Код+" уже загружен в базу!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
Текст = Новый ТекстовыйДокумент;
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);

Диалог.Заголовок = "Выберите файл с кодами IMEI";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Текстовый файл (*.txt)|*.txt"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
	Если Диалог.Выбрать() Тогда
	Текст.Прочитать(Диалог.ПолноеИмяФайла);
		Для НомерСтроки = 1 По Текст.КоличествоСтрок() Цикл 
		ЗагрузитьНаСервере(Текст.ПолучитьСтроку(НомерСтроки));
		КонецЦикла;
	Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры
