
&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Отчет.Период.ДатаНачала = Результат;
	Отчет.Период.ДатаОкончания = КонецМесяца(Результат);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьЗарплату()
Запрос = Новый Запрос;

НачисленоЗП = 0;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	БригаднаяСделкаТабличнаяЧасть.Итого КАК Итого
	|ИЗ
	|	Документ.БригаднаяСделка.ТабличнаяЧасть КАК БригаднаяСделкаТабличнаяЧасть
	|ГДЕ
	|	БригаднаяСделкаТабличнаяЧасть.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И БригаднаяСделкаТабличнаяЧасть.Ссылка.Подразделение = &Подразделение
	|	И БригаднаяСделкаТабличнаяЧасть.Ссылка.ПометкаУдаления = ЛОЖЬ
	|ИТОГИ
	|	СУММА(Итого)
	|ПО
	|	ОБЩИЕ";
Запрос.УстановитьПараметр("Подразделение", Подразделение);
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Отчет.Период.ДатаОкончания));
РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	ВыборкаИтого = РезультатЗапроса.Выбрать();
	ВыборкаИтого.Следующий();
	НачисленоЗП = ВыборкаИтого.Итого;
	КонецЕсли; 
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИндивидуальнаяСделкаТабличнаяЧасть.Итого КАК Итого
	|ИЗ
	|	Документ.ИндивидуальнаяСделка.ТабличнаяЧасть КАК ИндивидуальнаяСделкаТабличнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИндивидуальнаяСделка.ТехОперации КАК ИндивидуальнаяСделкаТехОперации
	|		ПО ИндивидуальнаяСделкаТабличнаяЧасть.Исполнитель = ИндивидуальнаяСделкаТехОперации.Исполнитель
	|ГДЕ
	|	ИндивидуальнаяСделкаТабличнаяЧасть.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ИндивидуальнаяСделкаТабличнаяЧасть.Ссылка.Подразделение = &Подразделение
	|	И ИндивидуальнаяСделкаТабличнаяЧасть.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ИндивидуальнаяСделкаТехОперации.ТехОперация В(&СписокТО)
	|ИТОГИ
	|	СУММА(Итого)
	|ПО
	|	ОБЩИЕ";
Запрос.УстановитьПараметр("Подразделение", Подразделение);
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокТО", СписокТО);
РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	ВыборкаИтого = РезультатЗапроса.Выбрать();
	ВыборкаИтого.Следующий();
	НачисленоЗП = НачисленоЗП + ВыборкаИтого.Итого;
	КонецЕсли;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьПоОкладамТабличнаяЧасть.Итого КАК Итого
	|ИЗ
	|	Документ.ВедомостьПоОкладам.ТабличнаяЧасть КАК ВедомостьПоОкладамТабличнаяЧасть
	|ГДЕ
	|	ВедомостьПоОкладамТабличнаяЧасть.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВедомостьПоОкладамТабличнаяЧасть.Подразделение = &Подразделение
	|	И ВедомостьПоОкладамТабличнаяЧасть.Ссылка.НакладныеРасходы = ЛОЖЬ
	|	И ВедомостьПоОкладамТабличнаяЧасть.Ссылка.ПометкаУдаления = ЛОЖЬ
	|ИТОГИ
	|	СУММА(Итого)
	|ПО
	|	ОБЩИЕ";
Запрос.УстановитьПараметр("Подразделение", Подразделение);
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Отчет.Период.ДатаОкончания));
РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	ВыборкаИтого = РезультатЗапроса.Выбрать();
	ВыборкаИтого.Следующий();
	НачисленоЗП = НачисленоЗП + ВыборкаИтого.Итого;
	КонецЕсли;
Возврат(НачисленоЗП);
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
ТаблицаИзделий = Новый ТаблицаЗначений;

ТаблицаИзделий.Колонки.Добавить("Изделие",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТаблицаИзделий.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(14,3)));

ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапкаОбщая = Макет.ПолучитьОбласть("Шапка|Общая");
ОблШапкаТехОперация = Макет.ПолучитьОбласть("Шапка|ТехОперация");
ОблШапкаИтого = Макет.ПолучитьОбласть("Шапка|Итого");
ОблИзделиеОбщая = Макет.ПолучитьОбласть("Изделие|Общая");
ОблИзделиеТехОперация = Макет.ПолучитьОбласть("Изделие|ТехОперация");
ОблИзделиеИтого = Макет.ПолучитьОбласть("Изделие|Итого");
ОблКонецОбщая = Макет.ПолучитьОбласть("Конец|Общая");
ОблКонецТехОперация = Макет.ПолучитьОбласть("Конец|ТехОперация");
ОблКонецИтого = Макет.ПолучитьОбласть("Конец|Итого");

ОблШапкаОбщая.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапкаОбщая.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапкаОбщая);
	Для каждого ТО Из СписокТО Цикл	
	ОблШапкаТехОперация.Параметры.ТО = ТО.Значение;
	ТабДок.Присоединить(ОблШапкаТехОперация);				
	КонецЦикла;
ТабДок.Присоединить(ОблШапкаИтого);

ПолнаяСуммаЗП = ОбщийМодульВызовСервера.ПолучитьПолнуюСуммуЗарплаты(Подразделение,Справочники.Линейки.ПустаяСсылка(),Отчет.Период.ДатаОкончания);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииКанбан.Изделие КАК Изделие,
	|	ВыпускПродукцииКанбан.Количество КАК Количество,
	|	ВыпускПродукцииКанбан.Изделие.Наименование КАК ИзделиеНаименование
	|ИЗ
	|	Документ.ВыпускПродукцииКанбан КАК ВыпускПродукцииКанбан
	|ГДЕ
	|	ВыпускПродукцииКанбан.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВыпускПродукцииКанбан.Подразделение = &Подразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИзделиеНаименование
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Изделие"; 
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("Подразделение", Подразделение);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаИзделия = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
ВремяВсего = 0;
	Пока ВыборкаИзделия.Следующий() Цикл
	Время = 0;
	ТЧ = ТаблицаИзделий.Добавить();
	ТЧ.Изделие = ВыборкаИзделия.Изделие;
	ТЧ.Количество = ВыборкаИзделия.Количество;
		Для каждого ТО Из СписокТО Цикл
		НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("МПЗ,ТехОперация",ТЧ.Изделие,ТО.Значение));
		Время = Время + НормыВремени.НормаВремени;
		КонецЦикла;
	ВремяВсего = ВремяВсего + Время*ВыборкаИзделия.Количество;
	КонецЦикла;
НомСтр = 0;
	Для каждого ТЧ Из ТаблицаИзделий Цикл 
	Время = 0;
	Себестоимость = 0;
	НомСтр = НомСтр + 1;
	ОблИзделиеОбщая.Параметры.НомСтр = НомСтр;
	ОблИзделиеОбщая.Параметры.Статус = ПолучитьСтатус(ТЧ.Изделие);
	ОблИзделиеОбщая.Параметры.Наименование = СокрЛП(ТЧ.Изделие.Наименование);
	ОблИзделиеОбщая.Параметры.Изделие = ТЧ.Изделие;
	ОблИзделиеОбщая.Параметры.Количество = ТЧ.Количество;
	ТабДок.Вывести(ОблИзделиеОбщая);
		Для каждого ТО Из СписокТО Цикл
		НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("МПЗ,ТехОперация",ТЧ.Изделие,ТО.Значение));
		ОблИзделиеТехОперация.Параметры.НВ = НормыВремени.НормаВремени;
		ТабДок.Присоединить(ОблИзделиеТехОперация);
		Время = Время + НормыВремени.НормаВремени;
		КонецЦикла;
	ОблИзделиеИтого.Параметры.Время = Время*ТЧ.Количество;
	СебестоимостьПолная = ?(ВремяВсего > 0,ПолнаяСуммаЗП/ВремяВсего*Время,0);
	ОблИзделиеИтого.Параметры.СебестоимостьПолная = СебестоимостьПолная;
		Если СохранитьДанныеСебестоимости Тогда
		РегистрСведенийСебестоимость = РегистрыСведений.Себестоимость.СоздатьМенеджерЗаписи();
		РегистрСведенийСебестоимость.Период = Отчет.Период.ДатаНачала;
    	РегистрСведенийСебестоимость.Подразделение = Подразделение;
	    РегистрСведенийСебестоимость.Номенклатура = ТЧ.Изделие;
		РегистрСведенийСебестоимость.ЗарплатнаяЧасть = СебестоимостьПолная;
		РегистрСведенийСебестоимость.Записать(Истина);
		КонецЕсли;
	ТабДок.Присоединить(ОблИзделиеИтого);
	КонецЦикла;	
ТабДок.Вывести(ОблКонецОбщая);
	Для каждого ТО Из СписокТО Цикл
	ТабДок.Присоединить(ОблКонецТехОперация);				
	КонецЦикла;
ОблКонецИтого.Параметры.ВремяВсего = ВремяВсего;
ОблКонецИтого.Параметры.ПолнаяСуммаЗП = ПолнаяСуммаЗП;
ТабДок.Присоединить(ОблКонецИтого);
ТабДок.ФиксацияСверху = 3;
ТабДок.ФиксацияСлева = 4;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();		
	КонецЕсли; 
КонецПроцедуры

