
&НаСервере
Процедура ПолучитьИзделияНаСервере()
Запрос = Новый Запрос;

СписокИзделий.Очистить();

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.Линейка = &Линейка";
Запрос.УстановитьПараметр("Линейка", Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокИзделий.Добавить(ВыборкаДетальныеЗаписи.Ссылка,,Истина);
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Линейка = &Линейка";
Запрос.УстановитьПараметр("Линейка", Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокИзделий.Добавить(ВыборкаДетальныеЗаписи.Ссылка,,Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИзделия(Команда)
ПолучитьИзделияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрисвоитьЛинейкуНаСервере()
	Для каждого Изделие Из СписокИзделий Цикл
		Если Изделие.Пометка Тогда
		ИзделиеОбъект = Изделие.Значение.ПолучитьОбъект();
		ИзделиеОбъект.Линейка = ЛинейкаНовая;
		ИзделиеОбъект.Записать();
		КонецЕсли;	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПрисвоитьЛинейку(Команда)
ПрисвоитьЛинейкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуру(Наименование)
Номен = Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина);
	Если Не Номен.Пустая() Тогда
	СписокИзделий.Добавить(Номен);			
	Иначе	
	Сообщить(Наименование+" - спецификация не найдена!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл cо спецификациями");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок; 
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка номенклатуры из файла...");
		ДобавитьНоменклатуру(СокрЛП(ExcelЛист.Cells(к,1).Value)); 
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры
