
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)Экспорт
Фильтр   = Новый Структура;
Автор = ПараметрыСеанса.Пользователь;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДвижениеМПЗ") Тогда
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	Подразделение = ДанныеЗаполнения.Подразделение;
	МестоХранения = ДанныеЗаполнения.МестоХранения;
	МестоХраненияВ = ДанныеЗаполнения.МестоХраненияВ;
		Для Каждого ТЧ Из ДанныеЗаполнения.ТабличнаяЧасть Цикл
		Требуется = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения);
		Фильтр.Вставить("МестоХранения",МестоХранения);
		Фильтр.Вставить("Продукция", ТЧ.МПЗ);
		ТабОстатков = РегистрыНакопления.РезервированиеГП.Остатки(ТекущаяДата(),Фильтр);
			Для каждого ТЧ_Р Из ТабОстатков Цикл
			НоваяСтрока = ТабличнаяЧасть.Добавить();
			НоваяСтрока.ВидМПЗ = ТЧ.ВидМПЗ;
			НоваяСтрока.МПЗ = ТЧ.МПЗ;
			НоваяСтрока.ЕдиницаИзмерения = ТЧ.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ТЧ_Р.Количество;
			НоваяСтрока.ЗаказНаПроизводство = ТЧ_Р.Документ;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
	УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение,Дата));
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если МестоХранения.Пустая() Тогда
	Отказ = Истина;
	Сообщить("Укажите исходное место хранения резерва ГП!");
	Возврат;
	КонецЕсли;
		Если МестоХраненияВ.Пустая() Тогда
		Отказ = Истина;
		Сообщить("Укажите место хранения для перемещения резерва ГП!");
		Возврат;
		КонецЕсли;
Движения.РезервированиеГП.Записывать = Истина;
ВиртуальнаяТабличнаяЧасть = ТабличнаяЧасть.Выгрузить();
ВиртуальнаяТабличнаяЧасть.Свернуть("ВидМПЗ,МПЗ,ЕдиницаИзмерения,ЗаказНаПроизводство","Количество");
	Для Каждого ТЧ Из ВиртуальнаяТабличнаяЧасть Цикл
	Требуется = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения);
	КолОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокВРезерве(МестоХранения,ТЧ.МПЗ,ТЧ.ЗаказНаПроизводство,Дата);
		Если КолОстаток >= Требуется Тогда
		Движение = Движения.РезервированиеГП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.МестоХранения = МестоХранения;
		Движение.Продукция = ТЧ.МПЗ;
		Движение.Количество = Требуется;
		Движение.Документ = ТЧ.ЗаказНаПроизводство;
		Движение = Движения.РезервированиеГП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.МестоХранения = МестоХраненияВ;
		Движение.Продукция = ТЧ.МПЗ;
		Движение.Количество = Требуется;
		Движение.Документ = ТЧ.ЗаказНаПроизводство;
		Иначе
		Отказ = Истина;
		Сообщить("МПЗ: "+СокрЛП(ТЧ.МПЗ.Наименование)+" требуется: "+Требуется+" недостаёт в резерве: "+Строка(Требуется-КолОстаток));
		КонецЕсли;		 
	КонецЦикла;
КонецПроцедуры
