
Функция ОткрытьФайлExcel(Заголовок,ИмяФайла = "",Лист = 1) Экспорт
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытияФайла.Фильтр               = "Книга Excel(*.xlsx)|*.xlsx|Excel(*.xls)|*.xls"; 
	ДиалогОткрытияФайла.МножественныйВыбор   = Ложь; 
	ДиалогОткрытияФайла.Заголовок            = Заголовок; 
		Если ДиалогОткрытияФайла.Выбрать() Тогда 
		ИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
		Иначе
		Сообщить("Файл не выбран!");
	    Возврат(Неопределено);
	    КонецЕсли;
	КонецЕсли; 

Файл = Новый Файл(ИмяФайла);
Состояние("Обработка...",,"Установка соединения с Microsoft Excel...");
	Попытка
	Excel = Новый COMОбъект("Excel.Application");
	Excel.DisplayAlerts = Ложь;
	Версия = Число(Лев(Excel.Version,Найти(Excel.Version,".")-1));
		//Если Версия >= 16 тогда
		//Excel.WorkBooks.Open(ИмяФайла,,,,,,,,,,,,,,2);
		//Иначе
		//Excel.WorkBooks.Open(ИмяФайла);
		//КонецЕсли;
		Попытка
		ExcelКнига = Excel.WorkBooks.Open(ИмяФайла);
		Исключение
		ExcelКнига = Excel.WorkBooks.Open(ИмяФайла,,,,,,,,,,,,,,2);
		КонецПопытки;
	ExcelЛист = Excel.Sheets(Лист);
		Если Версия >= 8 тогда
	    КолСтрок = ExcelЛист.Cells.CurrentRegion.Rows.Count;
		КолКолонок = ExcelЛист.Cells.CurrentRegion.Columns.Count;
		Иначе
	  	КолСтрок = ExcelЛист.Cells(1,1).SpecialCells(11).Row;
		КолКолонок = ExcelЛист.Cells(1,1).SpecialCells(11).Column;  
	 	КонецЕсли;
	Возврат(Новый Структура("Файл,ПолноеИмяФайла,Excel,ExcelКнига,ExcelЛист,КоличествоСтрок,КоличествоКолонок",Файл.ИмяБезРасширения,ИмяФайла,Excel,ExcelКнига,ExcelЛист,КолСтрок,КолКолонок));
	Исключение
	Сообщить("Версия Excel: "+Версия);
	Сообщить(ОписаниеОшибки());
	Возврат(Неопределено);
	КонецПопытки;
КонецФункции

Процедура ОткрытьФайлДокумента(ВыбДок) Экспорт
Перем ВыбранныйФайл;

СписокРолей = ОбщийМодульВызовСервера.ПолучитьСписокРолей();
	Если (СписокРолей[0].Значение = "СервисЦентр") и (СписокРолей.Количество() = 1) Тогда
		Если ОбщийМодульВызовСервера.ПросмотрЗапрещён(ВыбДок) Тогда
		Сообщить("У Вас нет прав для просмотра этого файла!");
		Возврат;
		КонецЕсли; 
	КонецЕсли; 

СписокФайлов = ОбщийМодульВызовСервера.ПолучитьСписокФайлов(ВыбДок);
	Если СписокФайлов.Количество() > 2 Тогда
	ВыбранныйФайл = СписокФайлов.ВыбратьЭлемент("Выберите файл",ВыбранныйФайл);
		Если ВыбранныйФайл <> Неопределено Тогда
			Если ВыбранныйФайл.Значение = ВыбДок Тогда
			ЗапуститьПриложение(ОбщийМодульВызовСервера.ПолучитьФайлДокумента(ВыбДок));
			Иначе
			ЗапуститьПриложение(ОбщийМодульВызовСервера.ПолучитьФайлДокумента(ВыбДок, ВыбранныйФайл.Значение));
			КонецЕсли; 
		КонецЕсли; 
	ИначеЕсли СписокФайлов.Количество() = 2 Тогда
	ЗапуститьПриложение(ОбщийМодульВызовСервера.ПолучитьФайлДокумента(СписокФайлов[0].Значение));
	Иначе
	Сообщить("Файл не найден!");
	КонецЕсли;
КонецПроцедуры

Функция ПодключитьсяК1С77(Путь,Пользователь,Пароль) Экспорт
	Если Не ЗначениеЗаполнено(Путь) Тогда
    Сообщить("Не указан путь к базе данных!");
    V7 = "";
    Возврат(Неопределено);
    КонецЕсли;
Состояние("Обработка...",,"Создание COM объекта 1С7.7...");  	
	Попытка
	V7 = Новый COMОбъект("V77s.Application");
	Исключение
	Сообщить(ОписаниеОшибки());
	Возврат(Неопределено);
	КонецПопытки; 
Состояние("Обработка...",,"Установка соединения с 1С7.7...");
СтрокаПодключения = "/D"+Путь+" /N"+СокрЛП(Пользователь)+" /P"+СокрЛП(Пароль);
	Попытка
    Connection = V7.Initialize(V7.RMTrade,СтрокаПодключения,"NO_SPLASH_SHOW");
	Исключение
	Сообщить(ОписаниеОшибки());
	Возврат(Неопределено);
	КонецПопытки;
    	Если Connection = 0 Тогда
    	Сообщить("Не подключились!");
    	V7 = "";
		Возврат(Неопределено);
		КонецЕсли;
Возврат(V7);
КонецФункции
