
&НаКлиенте
Процедура КаталогДокументовИПрограммНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
Диалог.Заголовок = "Выберите каталог документов и программ";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
Диалог.Каталог = НаборКонстант.КаталогДокументовИПрограмм;
	Если Диалог.Выбрать() Тогда
	НаборКонстант.КаталогДокументовИПрограмм = Диалог.Каталог+"\"; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогОбменаДаннымиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
Диалог.Заголовок = "Выберите каталог обмена данными на сервере";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
Диалог.Каталог = НаборКонстант.КаталогОбменаДанными;
	Если Диалог.Выбрать() Тогда
	НаборКонстант.КаталогОбменаДанными = Диалог.Каталог+"\"; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКБазе1СПроизводствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
Диалог.Заголовок = "Выберите каталог базы данных 1С: Производство";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
Диалог.Каталог = НаборКонстант.ПутьКБазе1СПроизводство;
	Если Диалог.Выбрать() Тогда
	НаборКонстант.ПутьКБазе1СПроизводство = Диалог.Каталог+"\"; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогМониторингаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
Диалог.Заголовок = "Выберите каталог мониторинга на сервере";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
Диалог.Каталог = НаборКонстант.КаталогМониторинга;
	Если Диалог.Выбрать() Тогда
	НаборКонстант.КаталогМониторинга = Диалог.Каталог+"\"; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогОбменаДаннымиТНПНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
Диалог.Заголовок = "Выберите каталог обмена данными ТНП";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
Диалог.Каталог = НаборКонстант.КаталогОбменаДаннымиТНП;
	Если Диалог.Выбрать() Тогда
	НаборКонстант.КаталогОбменаДаннымиТНП = Диалог.Каталог+"\"; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогОбменаДаннымиСчетовЗаказовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
Диалог.Заголовок = "Выберите каталог обмена данными счетов-заказов";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
Диалог.Каталог = НаборКонстант.КаталогОбменаДаннымиСчетовЗаказов;
	Если Диалог.Выбрать() Тогда
	НаборКонстант.КаталогОбменаДаннымиСчетовЗаказов = Диалог.Каталог+"\"; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогФотографийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
Диалог.Заголовок = "Выберите каталог фотографий";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
Диалог.Каталог = НаборКонстант.КаталогФотографий;
	Если Диалог.Выбрать() Тогда
	НаборКонстант.КаталогФотографий = Диалог.Каталог+"\"; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогДокументовИПрограммДопНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
Диалог.Заголовок = "Выберите каталог документов и программ дополнительный";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
Диалог.Каталог = НаборКонстант.КаталогДокументовИПрограммДоп;
	Если Диалог.Выбрать() Тогда
	НаборКонстант.КаталогДокументовИПрограммДоп = Диалог.Каталог+"\"; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогФотографийЛокальныйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
Диалог.Заголовок = "Выберите локальный каталог фотографий";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
Диалог.Каталог = НаборКонстант.КаталогФотографийЛокальный;
	Если Диалог.Выбрать() Тогда
	НаборКонстант.КаталогФотографийЛокальный = Диалог.Каталог+"\"; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиСвободныхОстатковНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
Диалог.Заголовок = "Выберите каталог выгрузки свободных остатков";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
Диалог.Каталог = НаборКонстант.КаталогВыгрузкиСвободныхОстатков;
	Если Диалог.Выбрать() Тогда
	НаборКонстант.КаталогВыгрузкиСвободныхОстатков = Диалог.Каталог+"\"; 
	КонецЕсли;
КонецПроцедуры
