
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КоличествоВ = 1;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
СписокРабочихМестСтенд.Очистить();
Запрос = Новый Запрос;
ТаблицаСП = Новый ТаблицаЗначений;

ТаблицаСП.Колонки.Добавить("Линейка",Новый ОписаниеТипов("СправочникСсылка.Линейки"));
ТаблицаСП.Колонки.Добавить("Исполнитель",Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
ТаблицаСП.Колонки.Добавить("КолПоставлено",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));
ТаблицаСП.Колонки.Добавить("КолСнято",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));
ТаблицаСП.Колонки.Добавить("КолРемонт",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));
ТаблицаСП.Колонки.Добавить("КолВторичныйПрогон",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));

Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеек.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек КАК РабочиеМестаЛинеек
	|ГДЕ
	|	РабочиеМестаЛинеек.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И РабочиеМестаЛинеек.ГруппаРабочихМест.Наименование ПОДОБНО &Наименование";
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
Запрос.УстановитьПараметр("Наименование", "СТ%");
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокРабочихМестСтенд.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
 
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблИсполнитель = Макет.ПолучитьОбласть("Исполнитель");
ОблИсполнительИтого = Макет.ПолучитьОбласть("ИсполнительИтого");
ОблЛинейка = Макет.ПолучитьОбласть("Линейка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтендовыйПрогон.ИсполнительПоступление,
	|	СтендовыйПрогон.ДатаПоступления,
	|	СтендовыйПрогон.Прогон,
	|	СтендовыйПрогон.Изделие,
	|	СтендовыйПрогон.ПЗ.Линейка КАК Линейка
	|ИЗ
	|	РегистрСведений.СтендовыйПрогон КАК СтендовыйПрогон
	|ГДЕ
	|	СтендовыйПрогон.ПЗ.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И СтендовыйПрогон.ДатаПоступления МЕЖДУ &ДатаНач И &ДатаКон";
	Если Не Исполнитель.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И СтендовыйПрогон.ИсполнительПоступление = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель",Исполнитель);
	КонецЕсли; 	
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаСП.Добавить();
	ТЧ.Линейка = Выборка.Линейка;
	ТЧ.Исполнитель = Выборка.ИсполнительПоступление;
		Если Выборка.Прогон > 1 Тогда
			Если КоличествоВ = 1 Тогда
			ТЧ.КолВторичныйПрогон = 1;				
			Иначе
			ТЧ.КолВторичныйПрогон = Выборка.Изделие.УсловныеПриборы;
			КонецЕсли;				
		КонецЕсли; 
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтендовыйПрогон.Изделие,
	|	СтендовыйПрогон.ПЗ.Линейка КАК Линейка,
	|	СтендовыйПрогон.ИсполнительПостановка,
	|	СтендовыйПрогон.ДатаПостановки
	|ИЗ
	|	РегистрСведений.СтендовыйПрогон КАК СтендовыйПрогон
	|ГДЕ
	|	СтендовыйПрогон.ПЗ.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И СтендовыйПрогон.ДатаПостановки МЕЖДУ &ДатаНач И &ДатаКон";
	Если Не Исполнитель.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И СтендовыйПрогон.ИсполнительПостановка = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель",Исполнитель);
	КонецЕсли;	
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаСП.Добавить();
	ТЧ.Линейка = Выборка.Линейка;
	ТЧ.Исполнитель = Выборка.ИсполнительПостановка;
		Если КоличествоВ = 1 Тогда
		ТЧ.КолПоставлено = 1;				
		Иначе
		ТЧ.КолПоставлено = Выборка.Изделие.УсловныеПриборы;
		КонецЕсли; 
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтендовыйПрогон.Изделие,
	|	СтендовыйПрогон.ПЗ.Линейка КАК Линейка,
	|	СтендовыйПрогон.ИсполнительСнятие,
	|	СтендовыйПрогон.ДатаСнятия
	|ИЗ
	|	РегистрСведений.СтендовыйПрогон КАК СтендовыйПрогон
	|ГДЕ
	|	СтендовыйПрогон.ПЗ.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И СтендовыйПрогон.ДатаСнятия МЕЖДУ &ДатаНач И &ДатаКон";
	Если Не Исполнитель.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И СтендовыйПрогон.ИсполнительСнятие = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель",Исполнитель);
	КонецЕсли;	
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаСП.Добавить();
	ТЧ.Линейка = Выборка.Линейка;
	ТЧ.Исполнитель = Выборка.ИсполнительСнятие;
		Если КоличествоВ = 1 Тогда
		ТЧ.КолСнято = 1;				
		Иначе
		ТЧ.КолСнято = Выборка.Изделие.УсловныеПриборы;
		КонецЕсли; 
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	РемонтнаяКарта.Ссылка,
	|	РемонтнаяКарта.ДокументОснование.Изделие КАК Изделие,
	|	РемонтнаяКарта.РабочееМесто.Стенд.Исполнитель КАК Исполнитель
	|ИЗ
	|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
	|ГДЕ
	|	РемонтнаяКарта.РабочееМесто В(&СписокРабочихМестСтенд)
	|	И РемонтнаяКарта.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	Если Не Исполнитель.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И РемонтнаяКарта.РабочееМесто.Стенд.Исполнитель = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель",Исполнитель);
	КонецЕсли;	
Запрос.УстановитьПараметр("СписокРабочихМестСтенд",СписокРабочихМестСтенд);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаСП.Добавить();
	ТЧ.Линейка = Выборка.Ссылка.Линейка;
	ТЧ.Исполнитель = Выборка.Исполнитель;
		Если КоличествоВ = 1 Тогда
		ТЧ.КолРемонт = 1;				
		Иначе
		ТЧ.КолРемонт = Выборка.Изделие.УсловныеПриборы;
		КонецЕсли; 
	КонецЦикла;
ТаблицаСП.Свернуть("Исполнитель,Линейка","КолПоставлено,КолСнято,КолРемонт,КолВторичныйПрогон"); 
ТаблицаСП.Сортировать("Исполнитель,Линейка");
ТекИсполнитель = "";
КолПоставленоИсполнитель = 0;
КолСнятоИсполнитель = 0;
КолРемонтИсполнитель = 0;	
КолВторичныйПрогонИсполнитель = 0;
	Для каждого ТЧ Из ТаблицаСП Цикл
	КолПоставлено = ТЧ.КолПоставлено;
	КолСнято = ТЧ.КолСнято;
	КолРемонт = ТЧ.КолРемонт;	
	КолВторичныйПрогон = ТЧ.КолВторичныйПрогон;
		Если ТекИсполнитель <> ТЧ.Исполнитель Тогда
			Если ТекИсполнитель <> "" Тогда
			ОблИсполнительИтого.Параметры.КолПоставлено = КолПоставленоИсполнитель;
			ОблИсполнительИтого.Параметры.КолСнято = КолСнятоИсполнитель;
			ОблИсполнительИтого.Параметры.КолРемонт = КолРемонтИсполнитель;
			ОблИсполнительИтого.Параметры.КолВторичныйПрогон = КолВторичныйПрогонИсполнитель;
			ТабДок.Вывести(ОблИсполнительИтого);
			КонецЕсли;
		ОблИсполнитель.Параметры.Исполнитель = СокрЛП(ТЧ.Исполнитель.Наименование);
		ТабДок.Вывести(ОблИсполнитель);
		КолПоставленоИсполнитель = 0;
		КолСнятоИсполнитель = 0;
		КолРемонтИсполнитель = 0;	
		КолВторичныйПрогонИсполнитель = 0;
		ТекИсполнитель = ТЧ.Исполнитель;
		КонецЕсли;
	ОблЛинейка.Параметры.Линейка = ""+ТЧ.Линейка + " ("+ТЧ.Линейка.Комментарий+")";
	ОблЛинейка.Параметры.КолПоставлено = КолПоставлено;
	ОблЛинейка.Параметры.КолСнято = КолСнято;
	ОблЛинейка.Параметры.КолРемонт = КолРемонт;
	ОблЛинейка.Параметры.КолВторичныйПрогон = КолВторичныйПрогон;
	ТабДок.Вывести(ОблЛинейка);			
	КолПоставленоИсполнитель = КолПоставленоИсполнитель+КолПоставлено;
	КолСнятоИсполнитель = КолСнятоИсполнитель+КолСнято;
	КолРемонтИсполнитель = КолРемонтИсполнитель+КолРемонт;	
	КолВторичныйПрогонИсполнитель = КолВторичныйПрогонИсполнитель+КолВторичныйПрогон; 
	КонецЦикла;
ОблИсполнительИтого.Параметры.КолПоставлено = КолПоставленоИсполнитель;
ОблИсполнительИтого.Параметры.КолСнято = КолСнятоИсполнитель;
ОблИсполнительИтого.Параметры.КолРемонт = КолРемонтИсполнитель;
ОблИсполнительИтого.Параметры.КолВторичныйПрогон = КолВторичныйПрогонИсполнитель;
ТабДок.Вывести(ОблИсполнительИтого);
ОблКонец.Параметры.КолПоставленоВсего = ТаблицаСП.Итог("КолПоставлено");
ОблКонец.Параметры.КолСнятоВсего = ТаблицаСП.Итог("КолСнято");
ОблКонец.Параметры.КолРемонтВсего = ТаблицаСП.Итог("КолРемонт");
ОблКонец.Параметры.КолВторичныйПрогонВсего = ТаблицаСП.Итог("КолВторичныйПрогон");
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
