
&НаКлиенте
Процедура ОК(Команда)
Идентификатор = ВыполнитьФоновоеЗадание();
Закрыть(Идентификатор);
КонецПроцедуры

&НаСервере
Функция ВыполнитьФоновоеЗадание()
	Попытка	
	ФоновоеЗадание = ФоновыеЗадания.Выполнить(ИмяМетода,, Ключ, Наименование);
	Возврат(ФоновоеЗадание.УникальныйИдентификатор);
	Исключение	
	Сообщить(ОписаниеОшибки(), СтатусСообщения.Внимание);
	Возврат(Неопределено);
	КонецПопытки;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЗаданиеИД = Параметры.ИдентификаторЗадания;
ФоновоеЗадание = Обработки.КонсольЗаданий.Создать().ПолучитьОбъектФоновогоЗадания(ЗаданиеИД);
	Если ФоновоеЗадание <> Неопределено Тогда
	ИмяМетода = ФоновоеЗадание.ИмяМетода;
	Наименование = ФоновоеЗадание.Наименование;
	Ключ = ФоновоеЗадание.Ключ;
	Иначе
	//Ключ = Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры
