
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ПараметрыТоварныхГрупп.Параметры.УстановитьЗначениеПараметра("ТоварнаяГруппа",Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура КопироватьПараметрыНаСервере(ТоварнаяГруппа)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыТоварныхГрупп.ТоварнаяГруппа,
	|	ПараметрыТоварныхГрупп.ПараметрТоварнойГруппы,
	|	ПараметрыТоварныхГрупп.ЗначениеПараметра
	|ИЗ
	|	РегистрСведений.ПараметрыТоварныхГрупп КАК ПараметрыТоварныхГрупп
	|ГДЕ
	|	ПараметрыТоварныхГрупп.ТоварнаяГруппа = &ТоварнаяГруппа";
Запрос.УстановитьПараметр("ТоварнаяГруппа", ТоварнаяГруппа);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ПТГ = РегистрыСведений.ПараметрыТоварныхГрупп.СоздатьМенеджерЗаписи();
	ПТГ.ТоварнаяГруппа = Объект.Ссылка;
	ПТГ.ПараметрТоварнойГруппы = ВыборкаДетальныеЗаписи.ПараметрТоварнойГруппы;
	ПТГ.ЗначениеПараметра = ВыборкаДетальныеЗаписи.ЗначениеПараметра;
	ПТГ.Записать(Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КопироватьПараметры(Команда)
	Если Не ЭтаФорма.Модифицированность Тогда
	ТоварнаяГруппа = Объект.Ссылка;
		Если ВвестиЗначение(ТоварнаяГруппа,"Выберите товарную группу",Новый ОписаниеТипов("СправочникСсылка.ТоварныеГруппы")) Тогда
		КопироватьПараметрыНаСервере(ТоварнаяГруппа);
		ПриОткрытии(Ложь);
		КонецЕсли;
	Иначе
	Сообщить("Сначала запишите элемент!");
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура КопироватьШаблоныНаСервере(ТоварнаяГруппа)
	Для каждого ТЧ Из ТоварнаяГруппа.ШаблоныПечатныхДокументов Цикл	
	ТЧ_Шаблон = Объект.ШаблоныПечатныхДокументов.Добавить();
	ТЧ_Шаблон.Шаблон = ТЧ.Шаблон;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура КопироватьШаблоны(Команда)
	Если Не ЭтаФорма.Модифицированность Тогда
	ТоварнаяГруппа = Объект.Ссылка;
		Если ВвестиЗначение(ТоварнаяГруппа,"Выберите товарную группу",Новый ОписаниеТипов("СправочникСсылка.ТоварныеГруппы")) Тогда
		КопироватьШаблоныНаСервере(ТоварнаяГруппа);
		ПриОткрытии(Ложь);
		КонецЕсли;
	Иначе
	Сообщить("Сначала запишите элемент!");
	КонецЕсли;
КонецПроцедуры
