
&НаСервере
Процедура ПодборМПЗНаСервере(ТаблицаМПЗ)
ТабДок.Очистить();
barcode = ПолучитьCOMОбъект("","STROKESCRIBE.StrokeScribeClass.1");
barcode.Alphabet=25; //QRCODE
Макет = ПолучитьОбщийМакет("QRКодКанбан4");
ОблQRКод = Макет.ПолучитьОбласть("QRКод|Секция");
МаксКолНаЛисте = 5;
Четный = Ложь;
	Для каждого ТЧ Из ТаблицаМПЗ Цикл
	QRCode = ЗначениеВСтрокуВнутр(ТЧ.МПЗ)+";"+ТЧ.Количество;
	ИмяФайла=ПолучитьИмяВременногоФайла("wmf");
	barcode.Text=QRCode;
	barcode.UTF8=1;
	barcode.QrECL=2;
	код=barcode.SavePicture(ИмяФайла,7,100,100);          
		Если код <> 0 Тогда //Проверка результата генерации штрихкода
		Сообщить(строка(код) + " - " + barcode.ErrorDescription);
		Возврат;
		КонецЕсли;
	рис=ОблQRКод.Рисунки.QRCode;
	рис.РазмерКартинки=РазмерКартинки.Пропорционально;
	рис.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	рис.Картинка = Новый Картинка(ИмяФайла);
	ОблQRКод.Параметры.Наименование = СокрЛП(ТЧ.МПЗ.Наименование);
	ОблQRКод.Параметры.Количество = ТЧ.Количество;
	ОблQRКод.Параметры.ЕдИзм = ТЧ.МПЗ.ЕдиницаИзмерения;
	ОблQRКод.Параметры.МестоХранения = СокрЛП(МестоХранения.Наименование);
	ТабДок.Вывести(ОблQRКод);
	МаксКолНаЛисте = МаксКолНаЛисте - 1;
		Если МаксКолНаЛисте = 0 Тогда
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		МаксКолНаЛисте = 5;				
		КонецЕсли;  
	УдалитьФайлы(ИмяФайла);
	КонецЦикла;
ТабДок.РазмерСтраницы = "A4";
ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
ТабДок.ПолеСлева = 0;
ТабДок.ПолеСверху = 0;
ТабДок.ПолеСнизу = 0;
ТабДок.ПолеСправа = 0;
ТабДок.РазмерКолонтитулаСверху = 0;
ТабДок.РазмерКолонтитулаСнизу = 0; 
КонецПроцедуры

&НаКлиенте
Процедура ПодборМПЗ(Команда)
ТаблицаМПЗ = ОткрытьФормуМодально("ОбщаяФорма.ПодборМПЗ", Новый Структура("МестоХранения",Неопределено));
	Если ТаблицаМПЗ <> Неопределено Тогда
		Если ТаблицаМПЗ.Количество() > 0 Тогда
		ПодборМПЗНаСервере(ТаблицаМПЗ);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры