
&НаСервере
Процедура СформироватьНаСервере()
СписокТО = Новый СписокЗначений;
ТаблицаИзделий = Новый ТаблицаЗначений;
ТаблицаТО = Новый ТаблицаЗначений;

ТаблицаИзделий.Колонки.Добавить("Изделие",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТаблицаИзделий.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(14,3)));

ТаблицаТО.Колонки.Добавить("ТО",Новый ОписаниеТипов("СправочникСсылка.ТехОперации"));
ТаблицаТО.Колонки.Добавить("СуммаТО",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(14,2)));

	Если Линейка.ЭтоГруппа Тогда
	Выборка = Справочники.Линейки.Выбрать(Линейка);
		Если Выборка.Следующий() Тогда
		ГруппаТехОпераций = Справочники.ТехОперации.НайтиПоРеквизиту("Подразделение",Выборка.Подразделение);
		КонецЕсли;	
	Иначе	
	ГруппаТехОпераций = Справочники.ТехОперации.НайтиПоРеквизиту("Подразделение",Линейка.Подразделение);	
	КонецЕсли; 
ВыборкаТО = Справочники.ТехОперации.ВыбратьИерархически(ГруппаТехОпераций);
	Пока ВыборкаТО.Следующий() Цикл
		Если ВыборкаТО.ЭтоГруппа Тогда
		Продолжить;	
		КонецЕсли;
	СписокТО.Добавить(ВыборкаТО.Ссылка,ВыборкаТО.Ссылка.Код);
	ТЧ = ТаблицаТО.Добавить();
	ТЧ.ТО = ВыборкаТО.Ссылка;
	КонецЦикла;
СписокТО.СортироватьПоПредставлению();
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапкаОбщая = Макет.ПолучитьОбласть("Шапка|Общая");
ОблШапкаТехОперация = Макет.ПолучитьОбласть("Шапка|ТехОперация");
ОблШапкаИтого = Макет.ПолучитьОбласть("Шапка|Итого");
ОблИзделиеОбщая = Макет.ПолучитьОбласть("Изделие|Общая");
ОблИзделиеТехОперация = Макет.ПолучитьОбласть("Изделие|ТехОперация");
ОблИзделиеИтого = Макет.ПолучитьОбласть("Изделие|Итого");
ОблКонецОбщая = Макет.ПолучитьОбласть("Конец|Общая");
ОблКонецТехОперация = Макет.ПолучитьОбласть("Конец|ТехОперация");
ОблКонецИтого = Макет.ПолучитьОбласть("Конец|Итого");

ОблШапкаОбщая.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапкаОбщая.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапкаОбщая);
	Для каждого ТО Из СписокТО Цикл	
	ОблШапкаТехОперация.Параметры.ТО = ТО.Значение;
	ТабДок.Присоединить(ОблШапкаТехОперация);				
	КонецЦикла;
ТабДок.Присоединить(ОблШапкаИтого);

ПолнаяСуммаЗП = ОбщийМодульВызовСервера.ПолучитьПолнуюСуммуЗарплаты(Линейка.Подразделение,Линейка,Отчет.Период.ДатаОкончания);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииПоступление.Номенклатура КАК Изделие,
	|	ВыпускПродукцииПоступление.Количество КАК Количество,
	|	ВыпускПродукцииПоступление.Номенклатура.Наименование КАК НоменклатураНаименование
	|ИЗ
	|	Документ.ВыпускПродукции.Поступление КАК ВыпускПродукцииПоступление
	|ГДЕ
	|	ВыпускПродукцииПоступление.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВыпускПродукцииПоступление.Ссылка.НаСклад = ИСТИНА
	|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.ДокументОснование.Ремонт = ЛОЖЬ
	|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.Линейка В ИЕРАРХИИ(&ГруппаЛинеек)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураНаименование
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Изделие"; 
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("ГруппаЛинеек", Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаИзделия = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
СуммаИтогоВсего = 0;
	Пока ВыборкаИзделия.Следующий() Цикл
	Время = 0;
	ТЧ = ТаблицаИзделий.Добавить();
	ТЧ.Изделие = ВыборкаИзделия.Изделие;
	ТЧ.Количество = ВыборкаИзделия.Количество;
		Для каждого ТО Из СписокТО Цикл
		НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("МПЗ,ТехОперация",ТЧ.Изделие,ТО.Значение));
		НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("ТехОперация",ТО.Значение));
		Расценка = НормыВремени.НормаВремени/60*НормыТО.Стоимость;
		СуммаИтогоВсего = СуммаИтогоВсего + Расценка*ТЧ.Количество;
		КонецЦикла;
	КонецЦикла;
КоличествоВсего = 0;
//СуммаИтогоВсего = 0;
НомСтр = 0;
	Для каждого ТЧ Из ТаблицаИзделий Цикл
	НВИтого = 0;
	РасценкаИтого = 0;
	СуммаИтого = 0;
	Время = 0;
	Себестоимость = 0;
	НомСтр = НомСтр + 1;
	ОблИзделиеОбщая.Параметры.НомСтр = НомСтр;
	ОблИзделиеОбщая.Параметры.Статус = ПолучитьСтатус(ТЧ.Изделие);
	ОблИзделиеОбщая.Параметры.Наименование = СокрЛП(ТЧ.Изделие.Наименование);
	ОблИзделиеОбщая.Параметры.Изделие = ТЧ.Изделие;
	ОблИзделиеОбщая.Параметры.Количество = ТЧ.Количество;
	ТабДок.Вывести(ОблИзделиеОбщая);
	КоличествоВсего = КоличествоВсего + ТЧ.Количество;
		Для каждого ТО Из СписокТО Цикл
		НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("МПЗ,ТехОперация",ТЧ.Изделие,ТО.Значение));
		НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("ТехОперация",ТО.Значение));
		Расценка = НормыВремени.НормаВремени/60*НормыТО.Стоимость;
		ОблИзделиеТехОперация.Параметры.НВ = НормыВремени.НормаВремени;
		ОблИзделиеТехОперация.Параметры.Расценка = Расценка;
		Сумма = Расценка*ТЧ.Количество;
		ОблИзделиеТехОперация.Параметры.Сумма = Сумма;
		ТабДок.Присоединить(ОблИзделиеТехОперация);
		НВИтого = НВИтого + НормыВремени.НормаВремени;
		РасценкаИтого = РасценкаИтого + Расценка;
		СуммаИтого = СуммаИтого + Сумма;
		Выборка = ТаблицаТО.НайтиСтроки(Новый Структура("ТО",ТО.Значение));
		Выборка[0].СуммаТО = Выборка[0].СуммаТО + Сумма;
		Время = Время + НормыВремени.НормаВремени;				
		КонецЦикла;
	ОблИзделиеИтого.Параметры.НВИтого = НВИтого;
	ОблИзделиеИтого.Параметры.РасценкаИтого = РасценкаИтого;
	ОблИзделиеИтого.Параметры.СуммаИтого = СуммаИтого;
	СебестоимостьПолная = ПолнаяСуммаЗП/СуммаИтогоВсего*РасценкаИтого;
	ОблИзделиеИтого.Параметры.СебестоимостьПолная = СебестоимостьПолная;
	ТабДок.Присоединить(ОблИзделиеИтого);			
		Если СохранитьДанныеСебестоимости Тогда
		РегистрСведенийСебестоимость = РегистрыСведений.Себестоимость.СоздатьМенеджерЗаписи();
		РегистрСведенийСебестоимость.Период = Отчет.Период.ДатаНачала;
	    РегистрСведенийСебестоимость.Подразделение = Линейка.Подразделение;
	    РегистрСведенийСебестоимость.Линейка = Линейка;
	    РегистрСведенийСебестоимость.Номенклатура = ТЧ.Изделие;
		РегистрСведенийСебестоимость.ЗарплатнаяЧасть = СебестоимостьПолная;
		РегистрСведенийСебестоимость.Записать(Истина);
		КонецЕсли;
//	СуммаИтогоВсего = СуммаИтогоВсего + СуммаИтого;
	КонецЦикла;
ОблКонецОбщая.Параметры.КоличествоВсего = КоличествоВсего;
ТабДок.Вывести(ОблКонецОбщая);
	Для каждого ТО Из СписокТО Цикл
	Выборка = ТаблицаТО.Найти(ТО.Значение,"ТО");
	ОблКонецТехОперация.Параметры.СуммаВсего = Выборка.СуммаТО;
	ТабДок.Присоединить(ОблКонецТехОперация); 	
	КонецЦикла;
ОблКонецИтого.Параметры.СуммаИтогоВсего = СуммаИтогоВсего;
ОблКонецИтого.Параметры.ПолнаяСуммаЗП = ПолнаяСуммаЗП;
ТабДок.Присоединить(ОблКонецИтого);
ТабДок.ФиксацияСверху = 3;
ТабДок.ФиксацияСлева = 4;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЛинеек()
СписокЛинеек = Новый СписокЗначений;

	Если Линейка.ЭтоГруппа Тогда
	Выборка = Справочники.Линейки.Выбрать(Линейка);
		Если Выборка.Следующий() Тогда
		СписокЛинеек.Добавить(Выборка.Ссылка);
		КонецЕсли;	
	Иначе	
	СписокЛинеек.Добавить(Линейка);	
	КонецЕсли;
Возврат(СписокЛинеек);
КонецФункции 

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если ОбщийМодульВызовСервера.РазрешенныйСписокЛинеек(ПолучитьСписокЛинеек()) Тогда
		СформироватьНаСервере();
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Отчет.Период.ДатаНачала = Результат;
	Отчет.Период.ДатаОкончания = КонецМесяца(Результат);
	КонецЕсли; 
КонецПроцедуры
