
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого МПЗ Из ЭтаФорма.Параметры.СписокМПЗ Цикл
	ТЧ = ТаблицаМПЗ.Добавить();
	ТЧ.МПЗ = МПЗ.Значение;
	ТЧ.КоличествоКопий = 1;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция КнопкаПечатьНаСервере()
ТабДок = Новый ТабличныйДокумент;

Макет = Документы.ДвижениеМПЗ.ПолучитьМакет("ЭтикеткаSMD");
ОблЭтикетка = Макет.ПолучитьОбласть("Этикетка");
	Для каждого ТЧ Из ТаблицаМПЗ Цикл
	ОблЭтикетка.Параметры.Наимен = СокрЛП(ТЧ.МПЗ.Наименование);	
	ЯХ = ОбщийМодульРаботаСРегистрами.ПолучитьЯчейкуХранения(ТЧ.МПЗ,Параметры.МестоХранения);	
		Для к = 1 По ТЧ.КоличествоКопий Цикл
			Если ЯХ <> Неопределено Тогда
			ОблЭтикетка.Параметры.Стеллаж = ЯХ.Стеллаж;
			ОблЭтикетка.Параметры.Полка = ЯХ.Полка;
			ОблЭтикетка.Параметры.УникальныйНомер = ЯХ.УникальныйНомер;		
			Иначе	
			ОблЭтикетка.Параметры.Стеллаж = "-";
			ОблЭтикетка.Параметры.Полка = "-";
			ОблЭтикетка.Параметры.УникальныйНомер = "-";		
			КонецЕсли;
		ТабДок.Вывести(ОблЭтикетка);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;
	КонецЦикла;
ТабДок.РазмерСтраницы = "Custom";
ТабДок.ВысотаСтраницы = 70;
ТабДок.ШиринаСтраницы = 30;
ТабДок.ПолеСверху = 0;
ТабДок.ПолеСлева = 0;
ТабДок.ПолеСнизу = 0;
ТабДок.ПолеСправа = 0;
ТабДок.РазмерКолонтитулаСверху = 0;
ТабДок.РазмерКолонтитулаСнизу = 0;
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура КнопкаПечать(Команда)
ТД = КнопкаПечатьНаСервере();
ТД.Показать("Этикетка SMD");
ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтмена(Команда)
ЭтаФорма.Закрыть();
КонецПроцедуры
