
Процедура ОбработкаПроведения(Отказ, Режим)
	Если ТипЗнч(МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
	ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
	Иначе
	ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
	КонецЕсли;
КолОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоМестуХранения(МестоХранения,МПЗ,Дата);
	Если КолОстаток >= Количество Тогда
	// регистр МестаХранения Расход
	Движения.МестаХранения.Записывать = Истина;
	Движение = Движения.МестаХранения.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.МестоХранения = МестоХранения;
	Движение.ВидМПЗ = ВидМПЗ;
	Движение.МПЗ = МПЗ;
	Движение.Количество = Количество;
	Иначе
	Отказ = Истина;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Текст = "МПЗ: "+СокрЛП(МПЗ.Наименование)+" требуется передать: "+Количество+" недостаёт на складе: "+Строка(Количество-КолОстаток);
	Сообщение.Сообщить();
	КонецЕсли;

// регистр ПередачиНаЛинейки Приход
Движения.ПередачиНаЛинейки.Записывать = Истина;
Движение = Движения.ПередачиНаЛинейки.Добавить();
Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
Движение.Период = Дата;
Движение.МестоХранения = МестоХраненияКанбанов;
Движение.НомерЯчейки = НомерЯчейки;
Движение.ВидМПЗ = ВидМПЗ;
Движение.МПЗ = МПЗ;
Движение.Количество = Количество;
Движение.ПередачаНаЛинейку = Ссылка; 
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
	УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение,Дата));
	КонецЕсли;
КонецПроцедуры
