
&НаСервере
Функция НайтиКонтрагентаПоНаименованию(Наименование)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Наименование ПОДОБНО &Наименование";
Запрос.УстановитьПараметр("Наименование", Наименование+"%");
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
Возврат(Справочники.Контрагенты.ПустаяСсылка());
КонецФункции 

&НаСервере
Функция ПолучитьВидКИ(КИ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыКИ._Description
	|ИЗ
	|	ВнешнийИсточникДанных.БазаБитФинанс.Таблица.ВидыКИ КАК ВидыКИ
	|ГДЕ
	|	ВидыКИ._IDRRef = &_IDRRef";
Запрос.УстановитьПараметр("_IDRRef", КИ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи._Description);
	КонецЦикла;
Возврат("");
КонецФункции 

&НаСервере
Процедура ПолучитьКонтактнуюИнформацию(КИ,_IDRRef)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты_КИ.Вид,
	|	Контрагенты_КИ.Представление
	|ИЗ
	|	ВнешнийИсточникДанных.БазаБитФинанс.Таблица.Контрагенты_КИ КАК Контрагенты_КИ
	|ГДЕ
	|	Контрагенты_КИ._Reference81_IDRRef = &_Reference81_IDRRef";
Запрос.УстановитьПараметр("_Reference81_IDRRef", _IDRRef);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = КИ.Добавить();
	ТЧ.Вид = ПолучитьВидКИ(ВыборкаДетальныеЗаписи.Вид);
	ТЧ.Представление = ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(Родитель)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты._IDRRef,
	|	Контрагенты._Code,
	|	Контрагенты._Description,
	|	Контрагенты.НаименованиеПолное,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты._Folder,
	|	ДОБАВИТЬКДАТЕ(Контрагенты.ДатаСоздания, МЕСЯЦ, -24000) КАК ДатаСоздания
	|ИЗ
	|	ВнешнийИсточникДанных.БазаБитФинанс.Таблица.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты._ParentIDRRef = &_ParentIDRRef
	|	И Контрагенты._Folder <> &_Folder";
	Если ЗначениеЗаполнено(Объект.Период.ДатаНачала) Тогда	
	Запрос.Текст = Запрос.Текст + " И ДОБАВИТЬКДАТЕ(Контрагенты.ДатаСоздания, МЕСЯЦ, -24000) МЕЖДУ &ДатаНач И &ДатаКон";
	Запрос.УстановитьПараметр("ДатаНач",Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Объект.Период.ДатаОкончания);
	КонецЕсли; 
		Если ЗначениеЗаполнено(Наименование) Тогда
		Запрос.Текст = Запрос.Текст + " И Контрагенты._Description ПОДОБНО &Наименование";
		Запрос.УстановитьПараметр("Наименование","%"+Наименование+"%");		
		КонецЕсли;
			Если ЗначениеЗаполнено(ИНН) Тогда
			Запрос.Текст = Запрос.Текст + " И Контрагенты.ИНН ПОДОБНО &ИНН";
			Запрос.УстановитьПараметр("ИНН","%"+ИНН+"%");		
			КонецЕсли;  
Запрос.УстановитьПараметр("_ParentIDRRef",Родитель);
Запрос.УстановитьПараметр("_Folder","00");
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = ТаблицаКонтрагентов.Добавить();
	ТЧ.Код = ВыборкаДетальныеЗаписи._Code;
	ТЧ.Наименование = ВыборкаДетальныеЗаписи._Description;
	ТЧ.НаименованиеПолное = ВыборкаДетальныеЗаписи.НаименованиеПолное;
	ТЧ.ИНН = ВыборкаДетальныеЗаписи.ИНН;
	ТЧ.КПП = ВыборкаДетальныеЗаписи.КПП;
	ТЧ.ДатаСоздания = ВыборкаДетальныеЗаписи.ДатаСоздания;
	ПолучитьКонтактнуюИнформацию(ТЧ.КонтактнаяИнформация,ВыборкаДетальныеЗаписи._IDRRef);
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИНН) Тогда
		ТЧ.Ссылка = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",СокрЛП(ВыборкаДетальныеЗаписи.ИНН));
		КонецЕсли;
			Если ТЧ.Ссылка.Пустая() Тогда
			ТЧ.Ссылка = НайтиКонтрагентаПоНаименованию(ВыборкаДетальныеЗаписи._Description);
				Если Не ТЧ.Ссылка.Пустая() Тогда	
					Если СокрЛП(ВРЕГ(ТЧ.Ссылка.Наименование)) <> СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи._Description)) Тогда
					ТЧ.НеточноеСоответствие = Истина;
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли;  
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура НайтиРодителей()
Запрос = Новый Запрос;
СписокРодителей = Новый СписокЗначений;

СписокРодителей.Добавить("00-011907");
СписокРодителей.Добавить("00-011908");
СписокРодителей.Добавить("00-011958");
СписокРодителей.Добавить("00-013553");
СписокРодителей.Добавить("00-014274");
СписокРодителей.Добавить("00-011552");
СписокРодителей.Добавить("00-014960");
СписокРодителей.Добавить("00-011553");
СписокРодителей.Добавить("00-011731");

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты._IDRRef
	|ИЗ
	|	ВнешнийИсточникДанных.БазаБитФинанс.Таблица.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты._Code В(&СписокРодителей)";
Запрос.УстановитьПараметр("СписокРодителей",СписокРодителей);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ЗагрузитьНаСервере(ВыборкаДетальныеЗаписи._IDRRef);
	КонецЦикла;
ТаблицаКонтрагентов.Сортировать("Наименование");
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
ТаблицаКонтрагентов.Очистить();
НайтиРодителей();
КонецПроцедуры

&НаСервере
Процедура ДобавитьКонтрагентовНаСервере()
	Для каждого ТЧ Из ТаблицаКонтрагентов Цикл	
		Если ТЧ.Пометка Тогда
			Если ТЧ.Ссылка.Пустая() Тогда
			Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
			Контрагент.ДатаСоздания = ТЧ.ДатаСоздания;
			Контрагент.Наименование = ТЧ.Наименование;
			Контрагент.ПолнНаименование = ТЧ.НаименованиеПолное;
			Контрагент.ИНН = ТЧ.ИНН;
			Контрагент.КПП = ТЧ.КПП;
				Для каждого КИ Из ТЧ.КонтактнаяИнформация Цикл	
					Если СокрЛП(КИ.Вид) = "Юридический адрес" Тогда
					Контрагент.ЮридическийАдрес = КИ.Представление;
					ИначеЕсли СокрЛП(КИ.Вид) = "Почтовый адрес" Тогда
					Контрагент.ПочтовыйАдрес = КИ.Представление;
					ИначеЕсли СокрЛП(КИ.Вид) = "Телефон" Тогда
					Контрагент.Телефоны = КИ.Представление;					
					ИначеЕсли СокрЛП(КИ.Вид) = "Email" Тогда
					Контрагент.Email = КИ.Представление;				
					КонецЕсли; 
				КонецЦикла;		
			Контрагент.Записать();
			ТЧ.Ссылка = Контрагент.Ссылка;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКонтрагентов(Команда)
ДобавитьКонтрагентовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого ТЧ Из ТаблицаКонтрагентов Цикл	
	ТЧ.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из ТаблицаКонтрагентов Цикл	
	ТЧ.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры
