
&НаСервере
Процедура РаскрытьНаМПЗ(ЭтапСпецификации)
НормРасх = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_ТОсн(ЭтапСпецификации,ТекущаяДата());
	Пока НормРасх.Следующий() Цикл			
		Если ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.ТехОснастка")Тогда
		СписокТО.Добавить(НормРасх.Элемент);
		Иначе
	    РаскрытьНаМПЗ(НормРасх.Элемент);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
Запрос = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет"); 
ОблШапка = Макет.ПолучитьОбласть("Шапка");	
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблТО = Макет.ПолучитьОбласть("ТехОснастка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОстаткиИОбороты.МПЗ КАК МПЗ,
	|	МестаХраненияОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход
	|ИЗ
	|	РегистрНакопления.МестаХранения.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , ) КАК МестаХраненияОстаткиИОбороты";
	Если СписокМестХраненияГП.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + "	ГДЕ МестаХраненияОстаткиИОбороты.МестоХранения В(&МестоХранения)";		
	Запрос.УстановитьПараметр("МестоХранения", СписокМестХраненияГП);
	КонецЕсли;
Запрос.Текст = Запрос.Текст + "	УПОРЯДОЧИТЬ ПО КоличествоПриход УБЫВ";
Запрос.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ОблМПЗ.Параметры.Наименование = СокрЛП(ВыборкаДетальныеЗаписи.МПЗ.Наименование);
	ОблМПЗ.Параметры.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
	ОблМПЗ.Параметры.Количество = ВыборкаДетальныеЗаписи.КоличествоПриход;
	ТабДок.Вывести(ОблМПЗ);
	СписокТО.Очистить();
	РаскрытьНаМПЗ(ВыборкаДетальныеЗаписи.МПЗ);
		Для каждого ТО Из СписокТО Цикл
		ОблТО.Параметры.ТехОстастка = ТО.Значение;
		ТабДок.Вывести(ОблТО);		
		КонецЦикла; 
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
