
&НаСервере
Функция СписатьНаСервере()
Запрос = Новый Запрос;

Списание = Документы.СписаниеМПЗПрочее.СоздатьДокумент();
Списание.Дата = ТекущаяДата();
Списание.УстановитьНовыйНомер(ПрисвоитьПрефикс(Объект.МестоХранения.Подразделение));
Списание.Автор = ПараметрыСеанса.Пользователь;
Списание.Подразделение = Объект.МестоХранения.Подразделение;
Списание.МестоХранения = Объект.МестоХранения;
Списание.Статья = Объект.СтатьяСписания;
Списание.Утвердил = Объект.Утвердил;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОстатки.ВидМПЗ,
	|	МестаХраненияОстатки.МПЗ,
	|	МестаХраненияОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.МестаХранения.Остатки(&НаДату, ) КАК МестаХраненияОстатки
	|ГДЕ
	|	МестаХраненияОстатки.МестоХранения = &МестоХранения
	|	И МестаХраненияОстатки.ВидМПЗ = &ВидМПЗ";
Запрос.УстановитьПараметр("МестоХранения", Объект.МестоХранения);
Запрос.УстановитьПараметр("ВидМПЗ", ?(ВидМПЗ = 1, Перечисления.ВидыМПЗ.Материалы, Перечисления.ВидыМПЗ.Полуфабрикаты));
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = Списание.ТабличнаяЧасть.Добавить();
	ТЧ.ВидМПЗ = ВыборкаДетальныеЗаписи.ВидМПЗ;
	ТЧ.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
	ТЧ.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток/ВыборкаДетальныеЗаписи.МПЗ.ОсновнаяЕдиницаИзмерения.Коэффициент;
	ТЧ.ЕдиницаИзмерения =  ВыборкаДетальныеЗаписи.МПЗ.ОсновнаяЕдиницаИзмерения;	
	КонецЦикла;
		Если Списание.ТабличнаяЧасть.Количество() > 0 Тогда
		Списание.Записать(РежимЗаписиДокумента.Проведение);	
		Возврат(Списание.Ссылка);
		Иначе
		Возврат(Документы.СписаниеМПЗПрочее.ПустаяСсылка());
		КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура Списать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Док = СписатьНаСервере();	
		Если Не Док.Пустая() Тогда
		П = Новый Структура("Ключ",Док);
		ОткрытьФорму("Документ.СписаниеМПЗПрочее.Форма.ФормаДокумента",П);
		Иначе
		Сообщить("Документ списания не создан!");
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ВидМПЗ = 1;
КонецПроцедуры
