
&НаСервере
Процедура СформироватьНаСервере()
Запрос = Новый Запрос;

ТабДок.Очистить();
СписокЛиний.Очистить();
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");
ОблШапкаЛиния = Макет.ПолучитьОбласть("Шапка|Линия");
ОблМПЗОбщие = Макет.ПолучитьОбласть("МПЗ|Общие");
ОблМПЗЛиния = Макет.ПолучитьОбласть("МПЗ|Линия");
ОблКонецОбщие = Макет.ПолучитьОбласть("Конец|Общие");
ОблКонецЛиния = Макет.ПолучитьОбласть("Конец|Линия");	

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛинииSMD.Ссылка
	|ИЗ
	|	Справочник.ЛинииSMD КАК ЛинииSMD
	|ГДЕ
	|	ЛинииSMD.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛинииSMD.Код";
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокЛиний.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла; 
ОблШапкаОбщие.Параметры.НаДату = ТекущаяДата();
ТабДок.Вывести(ОблШапкаОбщие);
	Для каждого Линия Из СписокЛиний Цикл
	ОблШапкаЛиния.Параметры.ЛинияSMD = Линия.Значение;
	ТабДок.Присоединить(ОблШапкаЛиния);
	КонецЦикла;

СписокМПЗ = Новый СписокЗначений;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО СтатусыМПЗСрезПоследних.МПЗ = Номенклатура.Ссылка
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	|	И Номенклатура.Канбан = &Канбан
	|	И СтатусыМПЗСрезПоследних.Статус <> &Статус";
Запрос.УстановитьПараметр("Канбан",ВидКанбана);
Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыСпецификаций.Запрещённая);
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Ссылка.ЛинииSMD.Количество() = 0 Тогда
		Продолжить;	
		КонецЕсли;
	СписокМПЗ.Добавить(ВыборкаДетальныеЗаписи.Ссылка,глНаименованиеВСкобкахБезЭтапа(ВыборкаДетальныеЗаписи.Ссылка.Наименование));	 
	КонецЦикла;
СписокМПЗ.СортироватьПоПредставлению();
	Для каждого МПЗ Из СписокМПЗ Цикл	
	ОблМПЗОбщие.Параметры.Наименование = СокрЛП(МПЗ.Значение.Наименование);
	ОблМПЗОбщие.Параметры.МПЗ = МПЗ.Значение;
	ОблМПЗОбщие.Параметры.Статус = ПолучитьСтатус(МПЗ.Значение);
	ТабДок.Вывести(ОблМПЗОбщие);
		Для каждого Линия Из СписокЛиний Цикл
			Если МПЗ.Значение.ЛинииSMD.Найти(Линия.Значение,"Линия") <> Неопределено Тогда
			ОблМПЗЛиния.Параметры.Присвоен = "+";
			Иначе			
			ОблМПЗЛиния.Параметры.Присвоен = "";			
			КонецЕсли; 
		ТабДок.Присоединить(ОблМПЗЛиния);
		КонецЦикла;			
	КонецЦикла;
ТабДок.Вывести(ОблКонецОбщие);
	Для каждого Линия Из СписокЛиний Цикл
	ТабДок.Присоединить(ОблКонецЛиния);
	КонецЦикла;
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьЛиниюНаСервере(Спецификация,ЛинияSMD)
Номен = Спецификация.ПолучитьОбъект();
	Для каждого ТЧ Из Номен.ЛинииSMD Цикл
		Если ТЧ.Линия = ЛинияSMD Тогда
		Сообщить("Линия SMD уже добавлена в таблицу!");
		Возврат;		
		КонецЕсли;
	КонецЦикла; 
ТЧ = Номен.ЛинииSMD.Добавить();
ТЧ.Линия = ЛинияSMD;
Номен.Записать();
СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЛинию(Команда)
Спецификация = Неопределено;
ЛинияSMD = Неопределено;
	Если ВвестиЗначение(Спецификация,"Выберите спецификацию",Новый ОписаниеТипов("СправочникСсылка.Номенклатура")) Тогда
		Если ВвестиЗначение(ЛинияSMD,"Выберите линию SMD",Новый ОписаниеТипов("СправочникСсылка.ЛинииSMD")) Тогда
		ДобавитьЛиниюНаСервере(Спецификация,ЛинияSMD);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры
