
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Элементы.Проект.Видимость = ЭтаФорма.Параметры.Проектный;
Параметры.ТипСправочника = ЭтаФорма.Параметры.ТипСправочника;
Параметры.СписокПочтовойРассылки.ЗагрузитьЗначения(ЭтаФорма.Параметры.СписокРассылки);
НаДату = НачалоМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
НаДату = НачалоМесяца(НаДату);
КонецПроцедуры
              
&НаСервере
Процедура СоздатьТабличныйДокумент(ТабДок,ТабДокОшибок)
ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("ИзменениеПерспективногоПлана"); 
ОблШапка = Макет.ПолучитьОбласть("Шапка|Наименование");
ОблШапкаПериод = Макет.ПолучитьОбласть("Шапка|Период");

ОблШапка.Параметры.ДатаНач = Формат(НаДату,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(НаДату,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаВывода = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);
ОблШапкаПериод.Параметры.ММГГ = Формат(НаДату,"ДФ=MM.yy");
ТабДок.Присоединить(ОблШапкаПериод);

Макет = ОбъектЗн.ПолучитьМакет("ФайлОшибок");
ОблШапкаОшибок = Макет.ПолучитьОбласть("Шапка");
                                             
ОблШапкаОшибок.Параметры.ПП = "ПП";
ТабДокОшибок.Вывести(ОблШапкаОшибок);				
КонецПроцедуры  

&НаСервере
Функция ПолучитьEmailСотрудника()
Возврат(ПараметрыСеанса.Пользователь.Email);
КонецФункции

&НаСервере
Функция ПолучитьEmailПолучателя(Сотрудник)
Возврат(Сотрудник.Email);
КонецФункции

&НаКлиенте
Процедура ПочтоваяРассылка(ТабДок,ТабДокОшибок,ЕстьОшибки)
	Если Параметры.СписокПочтовойРассылки.Количество() = 0 Тогда
	Сообщить("Нет списка почтовой рассылки!");
	Возврат;
	КонецЕсли;
EmailСотрудника = ПолучитьEmailСотрудника();
Сообщение = Новый ИнтернетПочтовоеСообщение;
ИПП = Новый ИнтернетПочтовыйПрофиль; 

НастройкиПочты = ОбщийМодульВызовСервера.ПолучитьНастройкиПочты();
ИПП.АдресСервераSMTP = НастройкиПочты.АдресСервераSMTP; 
ИПП.ПортSMTP = НастройкиПочты.ПортSMTP;
ИПП.ВремяОжидания = 60; 
ИПП.Пароль = НастройкиПочты.ПарольПочтовогоСервера; 
ИПП.Пользователь = EmailСотрудника; 
	Для каждого Стр Из Параметры.СписокПочтовойРассылки Цикл
    Сообщение.Получатели.Добавить(ПолучитьEmailПолучателя(Стр.Значение));
	КонецЦикла; 
Сообщение.Отправитель.Адрес = EmailСотрудника;
Сообщение.Тема = "Загружен перспективный план за "+Формат(НаДату,"ДФ=dd.MM.yyyy"); 
Текст = "Здравствуйте!";
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "Загружен перспективный план за "+Формат(НаДату,"ДФ=dd.MM.yyyy");		
ИмяФайла = ПолучитьИмяВременногоФайла("xls");
ТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
Сообщение.Вложения.Добавить(ИмяФайла,"Перспективный план за период");
	Если ЕстьОшибки Тогда
	ИмяФайла = ПолучитьИмяВременногоФайла("xls");
	ТабДокОшибок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
	Сообщение.Вложения.Добавить(ИмяФайла,"Ошибки загрузки");
	Текст = Текст + Символы.ПС+ "";
	Текст = Текст + Символы.ПС+ "Есть ошибки загрузки (см. второй приложенный файл).";
	КонецЕсли;
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "С уважением, email: "+EmailСотрудника;
Сообщение.Тексты.Добавить(Текст);	
// Подключиться и отправить. 
Почта = Новый ИнтернетПочта; 
Почта.Подключиться(ИПП);
Почта.Послать(Сообщение); 
Почта.Отключиться();
ПоказатьОповещениеПользователя("Сообщение отправлено!");	
КонецПроцедуры
            
&НаСервере
Функция ЗагрузитьНаСервере(ТабДок,ТабДокОшибок)
ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("ИзменениеПерспективногоПлана"); 
ОблСтрока = Макет.ПолучитьОбласть("Строка|Наименование");
ОблСтрокаПериод = Макет.ПолучитьОбласть("Строка|Период");

Макет = ОбъектЗн.ПолучитьМакет("ФайлОшибок");
ОблСтрокаОшибок = Макет.ПолучитьОбласть("Строка");
флОшибки = Ложь;
	Для каждого ТЧ Из ТаблицаПП Цикл
		Если ЗначениеЗаполнено(ТЧ.Номенклатура) Тогда
		ОблСтрока.Параметры.Статус = ТЧ.Статус;
		ОблСтрока.Параметры.Наименование = СокрЛП(ТЧ.Наименование);
		ТабДок.Вывести(ОблСтрока);
		РегПП = РегистрыСведений.ПерспективныеПланы.Получить(НаДату,Новый Структура("МПЗ,Проект",ТЧ.Номенклатура,Проект));
		ОблСтрокаПериод.Параметры.КолППСтарое = РегПП.Количество;
		ОблСтрокаПериод.Параметры.КолППНовое = ТЧ.ПП;
		ОблСтрокаПериод.Параметры.КолРПСтарое = РегПП.РезПриб;
		ОблСтрокаПериод.Параметры.КолРПНовое = ТЧ.РП;
		ОблСтрокаПериод.Параметры.КолРКСтарое = РегПП.РезКм;
		ОблСтрокаПериод.Параметры.КолРКНовое = ТЧ.РК;
		ТабДок.Присоединить(ОблСтрокаПериод);
		РегППНовый = РегистрыСведений.ПерспективныеПланы.СоздатьМенеджерЗаписи();
		РегППНовый.Период = НаДату;
		РегППНовый.МПЗ = ТЧ.Номенклатура;
		РегППНовый.Проект = Проект; 
		РегППНовый.Количество = ?(ПП,ТЧ.ПП,РегПП.Количество);
		РегППНовый.РезПриб = ?(РП,ТЧ.РП,РегПП.РезПриб);
		РегППНовый.РезКм = ?(РК,ТЧ.РК,РегПП.РезКм);
		РегППНовый.Записать(Истина);
		Иначе
		ОблСтрокаОшибок.Параметры.Наименование = СокрЛП(ТЧ.Наименование);
 		ОблСтрокаОшибок.Параметры.ПП = ТЧ.ПП;
 		ОблСтрокаОшибок.Параметры.РК = ТЧ.РК;
 		ОблСтрокаОшибок.Параметры.РП = ТЧ.РП;
		ТабДокОшибок.Вывести(ОблСтрокаОшибок); 
		флОшибки = Истина;
		КонецЕсли;	
	КонецЦикла;
Возврат(флОшибки);	
КонецФункции

&НаКлиенте
Процедура КнопкаОК(Команда)
	Если Элементы.Проект.Видимость Тогда
		Если Не ЗначениеЗаполнено(Проект) Тогда
		Сообщить("Выберите проект разработки!");
		Возврат;
		КонецЕсли;	
	КонецЕсли;
		Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ТабДок = Новый ТабличныйДокумент;
		ТабДокОшибок = Новый ТабличныйДокумент;

		СоздатьТабличныйДокумент(ТабДок,ТабДокОшибок);
		Результат = ЗагрузитьНаСервере(ТабДок,ТабДокОшибок);
		ТабДок.Показать("Изменение помесячных перспективных планов");
			Если Результат Тогда
			ТабДокОшибок.Показать("Ошибки загрузки");
			КонецЕсли;
		ПочтоваяРассылка(ТабДок,ТабДокОшибок,Результат);
		ЭтаФорма.Закрыть(Истина); 
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(Наименование,ПП,РП,РК)
ТЧ = ТаблицаПП.Добавить();
ТЧ.Наименование = Наименование;
ТЧ.ПП = ПП;
ТЧ.РП = РП;
ТЧ.РК = РК;
	Если Параметры.ТипСправочника = 1 Тогда
	Выборка = Справочники.Материалы.Выбрать(,,Новый Структура("Наименование",Наименование));
	Иначе
	Выборка = Справочники.Номенклатура.Выбрать(,,Новый Структура("Наименование",Наименование));
	КонецЕсли;
флВыбран = Ложь;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда
		Продолжить;
		КонецЕсли;                            
	Статус = ПолучитьСтатус(Выборка.Ссылка);
	ТЧ_ТН = ТЧ.ТаблицаНоменклатуры.Добавить();
	ТЧ_ТН.Номенклатура = Выборка.Ссылка;
	ТЧ_ТН.Статус = Статус;	
		Если Параметры.ТипСправочника = 1 Тогда
			Если Статус = Перечисления.СтатусыМПЗ.Запрещённая Тогда
			Продолжить;
			КонецЕсли;
		Иначе
			Если Статус = Перечисления.СтатусыСпецификаций.Запрещённая Тогда
			Продолжить;
			КонецЕсли;
		КонецЕсли; 
			Если Проект.Пустая() Тогда
				Если Параметры.ТипСправочника = 1 Тогда
					Если Статус = Перечисления.СтатусыМПЗ.ОНР Тогда
					Продолжить;
					КонецЕсли;
				Иначе
					Если (Статус <> Перечисления.СтатусыСпецификаций.Предсерийная)и
						 (Статус <> Перечисления.СтатусыСпецификаций.Серийная) Тогда
					Продолжить;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
	ТЧ.Номенклатура = Выборка.Ссылка;
	ТЧ.Статус = Статус;
	флВыбран = Истина;
	КонецЦикла; 
		Если Не флВыбран Тогда
			Если ТЧ.ТаблицаНоменклатуры.Количество() = 0 Тогда
			ТЧ.Комментарий = "не найдена";
			Иначе
			ТЧ.Комментарий = "не выбрана из имеющихся";						
			КонецЕсли;		
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ТаблицаПП.Очистить();
	Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c перспективным планом");
		Если Результат <> Неопределено Тогда
		ExcelЛист = Результат.ExcelЛист;
		КолСтрок = Результат.КоличествоСтрок;
		    Для к = 2 по КолСтрок Цикл
			Состояние("Обработка...",к*100/КолСтрок,"Создание списка номенклатуры из файла...");
			ЗагрузитьИзФайлаНаСервере(СокрЛП(ExcelЛист.Cells(к,1).Value),Число(ExcelЛист.Cells(к,2).Value),Число(ExcelЛист.Cells(к,3).Value),Число(ExcelЛист.Cells(к,4).Value));
		    КонецЦикла;
		Результат.Excel.Quit();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
