
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТекущийПользователь = ПараметрыСеанса.Пользователь;
РолиКонфигурации = Метаданные.Роли;
	Для каждого Роль из РолиКонфигурации Цикл
		Если РольДоступна(Роль) Тогда
		СписокРолей.Добавить(Роль.Имя,,РольДоступна(Роль)); 
		КонецЕсли; 
	КонецЦикла;
ЭтаФорма.ПроверитьЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Элементы.ТекущаяДата.Заголовок = Формат(ТекущаяДата(),"ДЛФ=DD")+" ("+Формат(ТекущаяДата(),"ДФ=дддд")+")";
КонецПроцедуры

&НаКлиенте
Процедура ТехЛидерыЛинеек(Команда)
ИмяОтчета = "ОтчётПоРегиструПаспортЛинейки";
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
ПараметрыФормы.Вставить("КлючВарианта","СписокТехЛидеров"); 
ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаСайт(Команда)
ЗапуститьПриложение("http://www.owen.ru");
КонецПроцедуры

&НаКлиенте
Процедура СистемаЗаявокОВЕН(Команда)
ЗапуститьПриложение("https://master.owen.ru/site/login");
КонецПроцедуры
