
&НаСервере
Функция НеИмеетДоговоров()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Договоры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Владелец = &Владелец
	|	И Договоры.ДоговорСНефиксированнымиЦенами = ИСТИНА
	|	И Договоры.ПометкаУдаления = ЛОЖЬ";
Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СпецификацияКДоговоруСПоставщикомТабличнаяЧасть.Цена КАК Цена
		|ИЗ
		|	Документ.СпецификацияКДоговоруСПоставщиком.ТабличнаяЧасть КАК СпецификацияКДоговоруСПоставщикомТабличнаяЧасть
		|ГДЕ
		|	СпецификацияКДоговоруСПоставщикомТабличнаяЧасть.Ссылка.Договор = &Договор
		|	И СпецификацияКДоговоруСПоставщикомТабличнаяЧасть.Ссылка.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("Договор", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли; 
Возврат(РезультатЗапроса.Пустой());
КонецФункции

&НаКлиенте
Процедура ДоговорСНефиксированнымиЦенамиПриИзменении(Элемент)
	Если Объект.ДоговорСНефиксированнымиЦенами Тогда
		Если НеИмеетДоговоров() Тогда
		Объект.УчётКоличества = Ложь;		
		Объект.Наименование = "Договор с нефиксированными ценами";		
		Иначе
		Объект.ДоговорСНефиксированнымиЦенами = Ложь;
		Сообщить("Контрагент имеет другие договоры! Создание договора с нефиксированными ценами запрещено!");
		КонецЕсли;  
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура УчётКоличестваПриИзменении(Элемент)
	Если Объект.УчётКоличества Тогда
	Объект.ДоговорСНефиксированнымиЦенами = Ложь;
	КонецЕсли; 
КонецПроцедуры
