
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Объект.НаДату = НачалоМесяца(ТекущаяДата());
ВидЗагрузки = 1;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНормыУстановкиЭлементов(Наименование,НомерЛинии,НВ,НЧ)
МПЗ = Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина);
	Если Не МПЗ.Пустая() Тогда
		Если НомерЛинии = 1 Тогда
		Линейка = Справочники.Линейки.НайтиПоНаименованию("С01О",Истина);
		ИначеЕсли НомерЛинии = 2 Тогда
		Линейка = Справочники.Линейки.НайтиПоНаименованию("С02О",Истина);			
		ИначеЕсли НомерЛинии = 3 Тогда
		Линейка = Справочники.Линейки.НайтиПоНаименованию("С03О",Истина);
		ИначеЕсли НомерЛинии = 4 Тогда
		Линейка = Справочники.Линейки.НайтиПоНаименованию("С04О",Истина);		
		КонецЕсли; 
	НормыSMD = РегистрыСведений.НормыSMDПоЛинейкам.ПолучитьПоследнее(Объект.НаДату,Новый Структура("МПЗ,Линейка",МПЗ,Линейка));
		Если (НормыSMD.НормаВремени <> НВ)или(НормыSMD.ЦенаНормоЧаса <> НЧ) Тогда
		НоваяНормаSMD = РегистрыСведений.НормыSMDПоЛинейкам.СоздатьМенеджерЗаписи();
		НоваяНормаSMD.Период = Объект.НаДату;
	    НоваяНормаSMD.МПЗ = МПЗ;
		НоваяНормаSMD.Линейка = Линейка;
		НоваяНормаSMD.НормаВремени = НВ;
		НоваяНормаSMD.ЦенаНормоЧаса = НЧ;
		НоваяНормаSMD.Записать(Истина);
		КонецЕсли; 		
	Иначе	
	Сообщить(Наименование + " - не найдена в справочнике!");
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьНормыОптическогоТеста(Наименование,Коэффициент,Расценка)
МПЗ = Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина);
	Если Не МПЗ.Пустая() Тогда
	НормыОТ = РегистрыСведений.НормыОптическогоТеста.ПолучитьПоследнее(Объект.НаДату,Новый Структура("МПЗ",МПЗ));
		Если (НормыОТ.Коэффициент <> Коэффициент)или(НормыОТ.Расценка <> Расценка) Тогда
		НоваяНормаОТ = РегистрыСведений.НормыОптическогоТеста.СоздатьМенеджерЗаписи();
		НоваяНормаОТ.Период = Объект.НаДату;
	    НоваяНормаОТ.МПЗ = МПЗ;
		НоваяНормаОТ.Коэффициент = Коэффициент;
		НоваяНормаОТ.Расценка = Расценка;
		НоваяНормаОТ.Записать(Истина);
		КонецЕсли;
	Иначе	
	Сообщить(Наименование + " - не найдена в справочнике!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНормыЭлектроконтроля(Наименование,НормаВремени,Расценка)
МПЗ = Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина);
	Если Не МПЗ.Пустая() Тогда
	НормыЭК = РегистрыСведений.НормыЭлектроконтроля.ПолучитьПоследнее(Объект.НаДату,Новый Структура("МПЗ",МПЗ));
		Если (НормыЭК.НормаВремени <> НормаВремени)или(НормыЭК.Расценка <> Расценка) Тогда
		НоваяНормаЭК = РегистрыСведений.НормыЭлектроконтроля.СоздатьМенеджерЗаписи();
		НоваяНормаЭК.Период = Объект.НаДату;
	    НоваяНормаЭК.МПЗ = МПЗ;
		НоваяНормаЭК.НормаВремени = НормаВремени;
		НоваяНормаЭК.Расценка = Расценка;
		НоваяНормаЭК.Записать(Истина);
		КонецЕсли;
	Иначе	
	Сообщить(Наименование + " - не найдена в справочнике!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Если ВидЗагрузки = 1 Тогда
	Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c нормами на установку элементов");
		Если Результат <> Неопределено Тогда
		ExcelЛист = Результат.ExcelЛист;
		КолСтрок = Результат.КоличествоСтрок;
		    Для к = 2 по КолСтрок Цикл
			Состояние("Обработка...",к*100/КолСтрок,"Загрузка норм SMD из файла..."); 
	        ЗагрузитьНормыУстановкиЭлементов(СокрЛП(ExcelЛист.Cells(к,1).Value),ExcelЛист.Cells(к,2).Value,ExcelЛист.Cells(к,3).Value,ExcelЛист.Cells(к,4).Value);
		    КонецЦикла;
		Результат.Excel.Quit();
		КонецЕсли;
	ИначеЕсли ВидЗагрузки = 2 Тогда
	Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c нормами на оптический тест");
		Если Результат <> Неопределено Тогда
		ExcelЛист = Результат.ExcelЛист;
		КолСтрок = Результат.КоличествоСтрок;
		    Для к = 2 по КолСтрок Цикл
			Состояние("Обработка...",к*100/КолСтрок,"Загрузка норм SMD из файла..."); 
	        ЗагрузитьНормыОптическогоТеста(СокрЛП(ExcelЛист.Cells(к,1).Value),ExcelЛист.Cells(к,2).Value,ExcelЛист.Cells(к,3).Value);
		    КонецЦикла;
		Результат.Excel.Quit();
		КонецЕсли;
	ИначеЕсли ВидЗагрузки = 3 Тогда
	Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c нормами на электроконтроль");
		Если Результат <> Неопределено Тогда
		ExcelЛист = Результат.ExcelЛист;
		КолСтрок = Результат.КоличествоСтрок;
		    Для к = 2 по КолСтрок Цикл
			Состояние("Обработка...",к*100/КолСтрок,"Загрузка норм SMD из файла..."); 
	        ЗагрузитьНормыЭлектроконтроля(СокрЛП(ExcelЛист.Cells(к,1).Value),ExcelЛист.Cells(к,2).Value,ExcelЛист.Cells(к,3).Value);
		    КонецЦикла;
		Результат.Excel.Quit();
		КонецЕсли;
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура НаДатуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Объект.НаДату = НачалоМесяца(Результат);
	КонецЕсли;
КонецПроцедуры
