
&НаСервере
Процедура ИзменитьНаСервере()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Родитель = &Родитель
	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.Канбан = &Канбан";
Запрос.УстановитьПараметр("Родитель", Объект.ГруппаНоменклатуры);
Запрос.УстановитьПараметр("Канбан", Объект.ВидКанбана);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Номен = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Номен.Канбан = Объект.ВидКанбанаНовый;
	Номен.Записать();
	Сообщить(СокрЛП(ВыборкаДетальныеЗаписи.Ссылка.Наименование)+" - изменен вид канбана!");
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ИзменитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("ГруппаНоменклатуры") Тогда
	Объект.ГруппаНоменклатуры = ЭтаФорма.Параметры.ГруппаНоменклатуры;
	КонецЕсли; 
КонецПроцедуры
