
&НаКлиенте
Процедура МасштабПриИзменении(Элемент)
МасштабПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура МасштабПриИзмененииНаСервере()
Настройки = новый НастройкиКлиентскогоПриложения;
	Если Объект.Масштаб = 0 Тогда	
	Настройки.ВариантМасштабаФормКлиентскогоПриложения=ВариантМасштабаФормКлиентскогоПриложения.Авто;	
	ИначеЕсли Объект.Масштаб = 1 Тогда	
	Настройки.ВариантМасштабаФормКлиентскогоПриложения=ВариантМасштабаФормКлиентскогоПриложения.Компактный;	
	Иначе
	Настройки.ВариантМасштабаФормКлиентскогоПриложения=ВариантМасштабаФормКлиентскогоПриложения.Обычный;	
	КонецЕсли;     
ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения",,Настройки,,ПараметрыСеанса.Пользователь);
КонецПроцедуры
