
&НаСервере 
Функция ПолучитьДатуОбещаннойОтгрузки()
Выборка = ЗНП.Заказ.Найти(Продукция,"Продукция");
	Если Выборка <> Неопределено Тогда
	Возврат(Выборка.ДатаОтгрузкиОбещанная);
	Иначе
	Возврат(Дата(1,1,1));
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПолучитьКорректирующуюМТК(ТЧ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутнаяКарта.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ГДЕ
	|	МаршрутнаяКарта.ДокументОснование = &ДокументОснование
	|	И МаршрутнаяКарта.Номенклатура = &Номенклатура
	|	И МаршрутнаяКарта.Количество = &Количество";
Запрос.УстановитьПараметр("ДокументОснование", ТЧ.Списание);
Запрос.УстановитьПараметр("Номенклатура", ТЧ.Продукция);
Запрос.УстановитьПараметр("Количество", ТЧ.Количество);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ.МТК = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗНППриИзмененииНаСервере()
ТаблицаПотерь.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеМПЗПрочее.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеМПЗПрочее КАК СписаниеМПЗПрочее
	|ГДЕ
	|	СписаниеМПЗПрочее.ДокументОснование = &ДокументОснование
	|	И СписаниеМПЗПрочее.Проведен = ИСТИНА";
Запрос.УстановитьПараметр("ДокументОснование", ЗНП);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Списание = ВыборкаДетальныеЗаписи.Ссылка;
	ТЧ = ТаблицаПотерь.Добавить();
	ТЧ.Продукция = Списание.ТабличнаяЧасть[0].МПЗ;
	ТЧ.Количество = Списание.ТабличнаяЧасть[0].Количество;
	ТЧ.Списание = Списание;
		Если ТипЗнч(ТЧ.Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
		ПолучитьКорректирующуюМТК(ТЧ);
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ЗНППриИзменении(Элемент)
Продукция = Неопределено;
Количество = 0;
	Если ЗначениеЗаполнено(ЗНП) Тогда
	Элементы.Продукция.Доступность = Истина; 
	Элементы.Количество.Доступность = Истина;
	ЗНППриИзмененииНаСервере(); 
	Иначе
	Элементы.Продукция.Доступность = Ложь; 
	Элементы.Количество.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры
  
&НаСервере             
Функция ПолучитьНомерОчередиПриоритет(Линейка)
Запрос = Новый Запрос;
           
НомерОчереди = 0;
Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МаршрутнаяКарта.НомерОчереди КАК НомерОчереди
	|ИЗ
	|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ГДЕ
	|	МаршрутнаяКарта.Статус <> 3
	|	И МаршрутнаяКарта.Линейка = &Линейка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерОчереди";
Запрос.УстановитьПараметр("Линейка", Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НомерОчереди = ВыборкаДетальныеЗаписи.НомерОчереди;
	КонецЦикла;
Возврат(НомерОчереди-1);
КонецФункции

&НаСервере
Процедура ОформитьПотерюНаСервере()
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1; 
	Списание = Документы.СписаниеМПЗПрочее.СоздатьДокумент();
	Списание.Дата = ТекущаяДата();
	Списание.УстановитьНовыйНомер(ПрисвоитьПрефикс(Продукция.Линейка.Подразделение));
	Списание.Автор = ПараметрыСеанса.Пользователь;
	Списание.ДокументОснование = ЗНП;
	Списание.Подразделение = Продукция.Линейка.Подразделение;
		Если ТипЗнч(Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
		Списание.МестоХранения = Продукция.Линейка.МестоХраненияГП;		
		Иначе	
		Списание.МестоХранения = Константы.МестоХраненияТНП.Получить();
		КонецЕсли;
	Списание.Статья = Справочники.СтатьиПоступленийСписанийПрочих.НайтиПоНаименованию("Результат инвентаризации - недостачи",Истина);
	Списание.Утвердил = Продукция.Линейка.Подразделение.Руководитель;
	Списание.Комментарий = "Корректировка потери";
	ТЧ = Списание.ТабличнаяЧасть.Добавить();
		Если ТипЗнч(Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;	
		Иначе	
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
		КонецЕсли;		
	ТЧ.МПЗ = Продукция;
	ТЧ.Количество = Количество;
	ТЧ.ЕдиницаИзмерения = Продукция.ОсновнаяЕдиницаИзмерения;
	Списание.Записать(РежимЗаписиДокумента.Проведение);
	СтандартныйКомментарий = Справочники.СтандартныеКомментарии.НайтиПоНаименованию("Заказанные изделия для клиентов",Истина);
		Если ТипЗнч(Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
		МТК = ОбщийМодульСозданиеДокументов.СоздатьМТК(Продукция.Линейка,Продукция,Количество,СтандартныйКомментарий,,,,,ЗНП.Номер,ПолучитьДатуОбещаннойОтгрузки(),Списание.Ссылка,,,ПолучитьНомерОчередиПриоритет(Продукция.Линейка),,"Корректировка потери");
			Если МТК.Пустая() Тогда
			ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);			
			Возврат;
			КонецЕсли;
		КонецЕсли;			
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	ТЧ = ТаблицаПотерь.Добавить();
	ТЧ.Продукция = Продукция;
	ТЧ.Количество = Количество;
	ТЧ.Списание = Списание.Ссылка;
		Если ТипЗнч(Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
		ТЧ.МТК = МТК;
		КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОформитьПотерю(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ОформитьПотерюНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Функция ПолучитьПродукцию()
СписокПродукции = Новый СписокЗначений;
    
	Для каждого ТЧ Из ЗНП.Заказ Цикл
	СписокПродукции.Добавить(ТЧ.Продукция);
	КонецЦикла;
Возврат(СписокПродукции);
КонецФункции

&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
СписокПродукции = ПолучитьПродукцию(); 

ВыбПродукция = СписокПродукции.ВыбратьЭлемент("Выберите продукцию");
	Если ВыбПродукция <> Неопределено Тогда
	Продукция = ВыбПродукция.Значение;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПотерьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТаблицаПотерьСписание" Тогда	
	ОткрытьФорму("Документ.СписаниеМПЗПрочее.ФормаОбъекта",Новый Структура("Ключ",Элементы.ТаблицаПотерь.ТекущиеДанные.Списание));
	ИначеЕсли Поле.Имя = "ТаблицаПотерьМТК" Тогда	
	ОткрытьФорму("Документ.МаршрутнаяКарта.ФормаОбъекта",Новый Структура("Ключ",Элементы.ТаблицаПотерь.ТекущиеДанные.МТК));	
	КонецЕсли;
КонецПроцедуры
 