// ПодключаемоеОборудование
Перем глПодключаемоеОборудование Экспорт; // для кэширования на клиенте
// Конец ПодключаемоеОборудование

Процедура ПроверитьНаличиеСообщенийПользователю() Экспорт
МассивСообщений = ОбщийМодульВызовСервера.ПолучитьСообщения();
	Если МассивСообщений.Количество() > 0 Тогда 
	Ф = ПолучитьФорму("ОбщаяФорма.СообщениеПользователю");
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияОповещения",Ф);

		Если МассивСообщений.Количество() = 1 Тогда
		Сообщение = МассивСообщений[0];                                                 
			Если Сообщение.Важное Тогда         
				Попытка
				Ф.ОткрытьМодально();
				Исключение			
				КонецПопытки;			
			Иначе	
			ПоказатьОповещениеПользователя(Сообщение.Отправитель,Оп,Сообщение.Сообщение+"
																	|("+Сообщение.Время+")
																	|Открыть полный текст сообщения",БиблиотекаКартинок.Администратор,?(Сообщение.Важное,СтатусОповещенияПользователя.Важное,СтатусОповещенияПользователя.Информация));					
			КонецЕсли;
		Иначе
		ПоказатьОповещениеПользователя("Для Вас есть несколько сообщений!",Оп,"Открыть сообщения",БиблиотекаКартинок.Администратор,СтатусОповещенияПользователя.Важное);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

Процедура ПередНачаломРаботыСистемы(Отказ)

	//Попытка
	//ПодключитьВнешнююКомпоненту("AddIn.Scaner45");
	//Scaner = Новый("AddIn.Scaner45");
	//Scaner.DataEventEnabled = true;
	//Scaner.AutoDisable = false;
	//Scaner.OldVersion = true;
	//Исключение
	//
	//КонецПопытки;
	
// ПодключаемоеОборудование
МенеджерОборудованияКлиент.ПередНачаломРаботыСистемы();
// Конец ПодключаемоеОборудование
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
ПроверитьНаличиеСообщенийПользователю();
ПодключитьОбработчикОжидания("ПроверитьНаличиеСообщенийПользователю",20,);
	Если ОбщийМодульВызовСервера.ДоступностьРоли("Статистика") Тогда
	ОткрытьФорму("Отчет.ПроизводственныеПоказатели.Форма.Форма");
	КонецЕсли;
// ПодключаемоеОборудование
МенеджерОборудованияКлиент.ПриНачалеРаботыСистемы();
// Конец ПодключаемоеОборудование

//МенеджерОборудованияВызовСервераПереопределяемый.ОбновитьПоставляемыеДрайвера();

КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ)
// ПодключаемоеОборудование 
МенеджерОборудованияКлиент.ПередЗавершениемРаботыСистемы();
// Конец ПодключаемоеОборудование
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)

	// ПодключаемоеОборудование
	// Подготовить данные
	
	ОписаниеСобытия = Новый Структура();
	ОписаниеОшибки  = "";
	
	ОписаниеСобытия.Вставить("Источник", Источник);
	ОписаниеСобытия.Вставить("Событие",  Событие);
	ОписаниеСобытия.Вставить("Данные",   Данные);
	
	// Передать на обработку данные.
	Результат = МенеджерОборудованияКлиент.ОбработатьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
	Если Не Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При обработке внешнего события от устройства произошла ошибка.'")
		                                                 + Символы.ПС + ОписаниеОшибки);
	КонецЕсли;
	// Конец ПодключаемоеОборудование

КонецПроцедуры
