
&НаКлиенте
Процедура НаДатуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Объект.НаДату = НачалоМесяца(Результат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(ФИО,КоэффициентНаМВ)
Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ФИО,Истина);
	Если Не Сотрудник.Пустая() Тогда
	РКС = РегистрыСведений.КоэффициеныСотрудников.ПолучитьПоследнее(Объект.НаДату,Новый Структура("Сотрудник",Сотрудник));
		Если РКС.КоэффициентНаМВ <> КоэффициентНаМВ Тогда
		РКС = РегистрыСведений.КоэффициеныСотрудников.СоздатьМенеджерЗаписи();
		РКС.Период = Объект.НаДату;
	    РКС.Сотрудник = Сотрудник;
	    РКС.КоэффициентНаМВ = КоэффициентНаМВ;
		РКС.Записать(Истина);
		КонецЕсли; 	
	Иначе
	Сообщить(ФИО + " - не найден!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c коэфф. сотрудников");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка коэфф. сотрудников..."); 
        ЗагрузитьНаСервере(СокрЛП(ExcelЛист.Cells(к,1).Value),ExcelЛист.Cells(к,2).Value);
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры
