
&НаСервере
Функция НайтиМестоХраненияПоНаименованию(Наименование)
Возврат(Справочники.МестаХранения.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаСервере
Функция НайтиПолуфабрикатПоНаименованию(Наименование)
Возврат(Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаСервере
Функция НайтиМатериалПоНаименованию(Наименование)
Возврат(Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаСервере
Процедура СоздатьВводОстатковМПЗ(Автор)
ВводОстатковМПЗ = Документы.ВводОстатковМПЗ.СоздатьДокумент();
ВводОстатковМПЗ.Автор = ПараметрыСеанса.Пользователь;
ВводОстатковМПЗ.Дата = ТекущаяДата();
ВводОстатковМПЗ.МестоХранения = МестоХранения;
ВводОстатковМПЗ.Комментарий = "Инвентаризация №"+НомерДокументаИнвентаризации+", автор документа "+Автор;
	Для каждого ТЧ_МПЗ Из ТаблицаМПЗ Цикл
	ТЧ = ВводОстатковМПЗ.ТабличнаяЧасть.Добавить();
		Если ТипЗнч(ТЧ_МПЗ.МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
		ТЧ.МПЗ = ТЧ_МПЗ.МПЗ;
		ТЧ.Количество = ПолучитьБазовоеКоличество(ТЧ_МПЗ.Количество,ТЧ_МПЗ.МПЗ.ОсновнаяЕдиницаИзмерения);
		ТЧ.Цена = ТЧ_МПЗ.Сумма/ТЧ_МПЗ.Количество;
		Иначе	
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
		ТЧ.МПЗ = ТЧ_МПЗ.МПЗ;
		ТЧ.Количество = ПолучитьБазовоеКоличество(ТЧ_МПЗ.Количество,ТЧ_МПЗ.МПЗ.ОсновнаяЕдиницаИзмерения);
		КонецЕсли;				
	КонецЦикла;
		Если ВводОстатковМПЗ.ТабличнаяЧасть.Количество() > 0 Тогда
		ВводОстатковМПЗ.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Перенос остатков завершён!");
		Иначе
		Сообщить("Табличная часть документа пустая! Сохранение отменено!");
		КонецЕсли;
КонецПроцедуры
 
&НаКлиенте
Процедура Соединиться(Команда)
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
	Возврат;
	КонецЕсли;
НастройкиОбменаДанными = ОбщийМодульСинхронизации.ПолучитьНастройкиОбменаДанными("Производство");
V7 = ОбщийМодульКлиент.ПодключитьсяК1С77(НастройкиОбменаДанными.ПутьКБазеДанных,Объект.ИмяПользователя,Объект.Пароль);
	Если V7 = Неопределено Тогда
	Возврат;	
	КонецЕсли;
Состояние("Обработка...",,"Проверка списка МПЗ..."); 			
Док = V7.CreateObject("Документ.ИнвентаризацияМПЗ");	
	Если Док.НайтиПоНомеру(СокрЛП(НомерДокументаИнвентаризации),Формат(ТекущаяДата(),"ДФ=dd.MM.yy")) = 1 Тогда
    Док.ВыбратьСтроки();
		Пока Док.ПолучитьСтроку() = 1 Цикл
			Если Док.Количество > 0 Тогда
				Если Док.ВидМПЗ.ПорядковыйНомер() = 1 Тогда 
				МПЗ = НайтиМатериалПоНаименованию(Док.МПЗ.Наименование);
					Если Не МПЗ.Пустая() Тогда
					ТЧ = ТаблицаМПЗ.Добавить();
					ТЧ.МПЗ = МПЗ;
					ТЧ.Количество = Док.Количество;
					ТЧ.Сумма = Док.Сумма;
					Иначе
					Сообщить(СокрЛП(Док.МПЗ.Наименование)+" - материал не найден!");
					КонецЕсли; 
				Иначе	
				МПЗ = НайтиПолуфабрикатПоНаименованию(Док.МПЗ.Наименование);
					Если Не МПЗ.Пустая() Тогда
					ТЧ = ТаблицаМПЗ.Добавить();
					ТЧ.МПЗ = МПЗ;
					ТЧ.Количество = Док.Количество;
					Иначе
					Сообщить(СокрЛП(Док.МПЗ.Наименование)+" - полуфабрикат не найден!");
					КонецЕсли; 
				КонецЕсли;			
			КонецЕсли; 			
		КонецЦикла;
	Состояние("Обработка...",,"Создание ввода остатков МПЗ..."); 
	СоздатьВводОстатковМПЗ(Док.Автор.Наименование);
	Иначе
	Сообщить("Инвентаризация не найдена!");
	КонецЕсли;
КонецПроцедуры
