
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Отчет.Количество = 1;
Развёрнутый = Истина; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Спецификация) Тогда
	Отчет.Спецификация = ЭтаФорма.Параметры.Спецификация;
	Отчет.НаДату = ?(ЗначениеЗаполнено(ЭтаФорма.Параметры.НаДату),ЭтаФорма.Параметры.НаДату,ТекущаяДата());
	Отчет.Количество = ?(ЭтаФорма.Параметры.Количество > 0,ЭтаФорма.Параметры.Количество,1);
	Развёрнутый = ?(ЭтаФорма.Параметры.ТолькоКанбан,Ложь,Истина);		
	Сводный = Истина;
	ПоказатьАналоги = ?(ЭтаФорма.Параметры.ТолькоКанбан,Ложь,Истина);
	СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьУровень(Уровень)
Отступ = "";
	Для к = 1 По Уровень Цикл
	Отступ = Отступ + Символы.Таб;	
	КонецЦикла; 
Возврат(Отступ);
КонецФункции

&НаСервере
Функция РаскрытьНаМПЗ(Спецификация,ВидЭлемента,КолУзла,Уровень)
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("МакетРазвёрнутый"); 
ОблУзел = Макет.ПолучитьОбласть("Узел");
ОблУзелИтого = Макет.ПолучитьОбласть("УзелИтого");	
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблАналог = Макет.ПолучитьОбласть("Аналог");		

ОблУзел.Параметры.Уровень = ПолучитьУровень(Уровень);
ОблУзел.Параметры.Наименование = СокрЛП(Спецификация.Наименование);
ОблУзел.Параметры.МПЗ = Спецификация;
ОблУзел.Параметры.ВидЭлемента = ВидЭлемента;
ТабДок.Вывести(ОблУзел);
ТабДок.НачатьГруппуСтрок("Узел", Истина);

Стоимость = 0;
НормРасх = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_М(Спецификация,КонецДня(Отчет.НаДату));
	Пока НормРасх.Следующий() Цикл			
		Если ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Материалы")Тогда
		Цена = ОбщийМодульВызовСервера.ПолучитьПоследнююЦену(НормРасх.Элемент,КонецДня(Отчет.НаДату));
		Норма = ПолучитьБазовоеКоличествоБезОкругления(НормРасх.Норма,НормРасх.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
 		Стоимость = Стоимость + Норма*Цена;
		ОблМПЗ.Параметры.Уровень = ПолучитьУровень(Уровень);
		ОблМПЗ.Параметры.Наименование = СокрЛП(НормРасх.Элемент.Наименование);
		ОблМПЗ.Параметры.МПЗ = НормРасх.Элемент;
		ОблМПЗ.Параметры.ВидЭлемента = СокрЛП(НормРасх.Элемент.Родитель.Наименование);
		ОблМПЗ.Параметры.Норма = Норма;
		ОблМПЗ.Параметры.ЕдиницаИзмерения = НормРасх.Элемент.ЕдиницаИзмерения;
		ОблМПЗ.Параметры.Количество = Норма*Отчет.Количество;
		ОблМПЗ.Параметры.Цена = Цена;
		ОблМПЗ.Параметры.Сумма = Норма*Отчет.Количество*Цена;
		ТабДок.Вывести(ОблМПЗ);
			Если ПоказатьАналоги Тогда
			ТаблицаАналогов = ОбщегоНазначенияПовтИсп.ПолучитьАналогиНормРасходов(НормРасх.Ссылка,КонецДня(Отчет.НаДату),Истина);
				Для каждого ТЧ_ТА Из ТаблицаАналогов Цикл
				Цена = ОбщийМодульВызовСервера.ПолучитьПоследнююЦену(ТЧ_ТА.Элемент,КонецДня(Отчет.НаДату));
				Норма = ПолучитьБазовоеКоличествоБезОкругления(ТЧ_ТА.Норма,ТЧ_ТА.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
				ОблАналог.Параметры.Уровень = ПолучитьУровень(Уровень);
				ОблАналог.Параметры.Наименование = СокрЛП(ТЧ_ТА.Элемент.Наименование);
				ОблАналог.Параметры.МПЗ = ТЧ_ТА.Элемент;
					Если ТипЗнч(ТЧ_ТА.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
					ОблАналог.Параметры.ВидЭлемента = СокрЛП(ТЧ_ТА.Элемент.Родитель.Наименование);
					Иначе
					ОблАналог.Параметры.ВидЭлемента = ТЧ_ТА.ВидЭлемента;
					КонецЕсли;
				ОблАналог.Параметры.ОграниченноеИспользование = ?(ТЧ_ТА.Ссылка.ОграниченноеИспользование,"+",""); 
				ОблАналог.Параметры.Норма = Норма;
				ОблАналог.Параметры.ЕдиницаИзмерения = ТЧ_ТА.Элемент.ЕдиницаИзмерения;
				ОблАналог.Параметры.Количество = Норма*Отчет.Количество;
				ОблАналог.Параметры.Цена = Цена;
				ОблАналог.Параметры.Сумма = Норма*Отчет.Количество*Цена;
				ТабДок.Вывести(ОблАналог); 
				КонецЦикла;
			КонецЕсли; 			
		Иначе
			Если Параметры.ТолькоКанбан Тогда	
				Если Не НормРасх.Элемент.Канбан.Пустая() Тогда
				Продолжить;
				КонецЕсли; 
			КонецЕсли;
		Стоимость = Стоимость + РаскрытьНаМПЗ(НормРасх.Элемент,НормРасх.ВидЭлемента,ПолучитьБазовоеКоличествоБезОкругления(НормРасх.Норма,НормРасх.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла,Уровень+1);
		КонецЕсли; 
	КонецЦикла;
ТабДок.ЗакончитьГруппуСтрок();
ОблУзелИтого.Параметры.Уровень = ПолучитьУровень(Уровень);
ОблУзелИтого.Параметры.Наименование = СокрЛП(Спецификация.Наименование);
ОблУзелИтого.Параметры.МПЗ = Спецификация;
ОблУзелИтого.Параметры.Норма = КолУзла;
ОблУзелИтого.Параметры.ЕдиницаИзмерения = Спецификация.ЕдиницаИзмерения;
ОблУзелИтого.Параметры.Количество = КолУзла*Отчет.Количество;
ОблУзелИтого.Параметры.Цена = Стоимость;
ОблУзелИтого.Параметры.Сумма = Стоимость*Отчет.Количество;
ТабДок.Вывести(ОблУзелИтого);
Возврат(Стоимость);
КонецФункции

&НаСервере
Процедура РаскрытьНаМПЗСвёрнутый(Спецификация,КолУзла)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходов.Элемент,
	|	НормыРасходовСрезПоследних.Норма,
	|	НормыРасходов.Ссылка,
	|	НормыРасходов.ВидЭлемента
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних(&НаДату, ) КАК НормыРасходовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыРасходов КАК НормыРасходов
	|		ПО НормыРасходовСрезПоследних.НормаРасходов = НормыРасходов.Ссылка
	|ГДЕ
	|	НормыРасходов.ПометкаУдаления = ЛОЖЬ
	|	И НормыРасходов.Владелец = &Владелец
	|	И (ТИПЗНАЧЕНИЯ(НормыРасходов.Элемент) = ТИП(Справочник.Номенклатура)
	|			ИЛИ ТИПЗНАЧЕНИЯ(НормыРасходов.Элемент) = ТИП(Справочник.Материалы))
	|	И НормыРасходовСрезПоследних.Норма > 0";
Запрос.УстановитьПараметр("НаДату", КонецДня(Отчет.НаДату));
Запрос.УстановитьПараметр("Владелец", Спецификация);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаНР = РезультатЗапроса.Выбрать();
	Пока ВыборкаНР.Следующий() Цикл
	БазовоеКоличество = ПолучитьБазовоеКоличествоБезОкругления(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Материалы")Тогда
		ТЧ = ТаблицаМПЗ.Добавить();
		ТЧ.МПЗ = ВыборкаНР.Элемент;
		ТЧ.Количество = БазовоеКоличество;
		ТЧ.Цена = ОбщийМодульВызовСервера.ПолучитьПоследнююЦену(ВыборкаНР.Элемент,КонецДня(Отчет.НаДату));			
		Иначе
			Если Параметры.ТолькоКанбан Тогда	
				Если Не ВыборкаНР.Элемент.Канбан.Пустая() Тогда
				Продолжить;
				КонецЕсли; 
			КонецЕсли; 
		РаскрытьНаМПЗСвёрнутый(ВыборкаНР.Элемент,БазовоеКоличество);
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура РаскрытьНаТО(Спецификация,КолУзла)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходов.Элемент,
	|	НормыРасходовСрезПоследних.Норма,
	|	НормыРасходов.Ссылка,
	|	НормыРасходов.ВидЭлемента
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних(&НаДату, ) КАК НормыРасходовСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.НормыРасходов КАК НормыРасходов
	|		ПО НормыРасходовСрезПоследних.НормаРасходов = НормыРасходов.Ссылка
	|ГДЕ
	|	НормыРасходов.ПометкаУдаления = ЛОЖЬ
	|	И НормыРасходов.Владелец = &Владелец
	|	И (ТИПЗНАЧЕНИЯ(НормыРасходов.Элемент) = ТИП(Справочник.Номенклатура)
	|			ИЛИ ТИПЗНАЧЕНИЯ(НормыРасходов.Элемент) = ТИП(Справочник.ТехОперации))
	|	И НормыРасходовСрезПоследних.Норма > 0";
Запрос.УстановитьПараметр("НаДату", КонецДня(Отчет.НаДату));
Запрос.УстановитьПараметр("Владелец", Спецификация);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаНР = РезультатЗапроса.Выбрать();
	Пока ВыборкаНР.Следующий() Цикл
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.ТехОперации")Тогда
		ТЧ = ТаблицаМПЗ.Добавить();
		ТЧ.МПЗ = ВыборкаНР.Элемент;
		НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("ТехОперация",ВыборкаНР.Элемент));
		ТЧ.Количество = ВыборкаНР.Норма*НормыТО.Норма*КолУзла;
		ТЧ.Цена = НормыТО.Стоимость;
		ТЧ.МашинноеВремя = НормыТО.МашинноеВремя;			
		ИначеЕсли ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Номенклатура")Тогда
			Если Параметры.ТолькоКанбан Тогда	
				Если Не ВыборкаНР.Элемент.Канбан.Пустая() Тогда
				Продолжить;
				КонецЕсли; 
			КонецЕсли; 
		РаскрытьНаТО(ВыборкаНР.Элемент,ПолучитьБазовоеКоличествоБезОкругления(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла);
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
ТаблицаМПЗ.Очистить();
	Если Развёрнутый Тогда
	ОбъектЗн = РеквизитФормыВЗначение("Отчет");
	Макет = ОбъектЗн.ПолучитьМакет("МакетРазвёрнутый"); 
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблУзел = Макет.ПолучитьОбласть("Узел");
	ОблУзелИтого = Макет.ПолучитьОбласть("УзелИтого");	
	ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");		
	ОблКонец = Макет.ПолучитьОбласть("Конец");	

	ОблШапка.Параметры.Спецификация = СокрЛП(Отчет.Спецификация.Наименование);
	ОблШапка.Параметры.НаДату = Формат(Отчет.НаДату,"ДФ=dd.MM.yyyy");
	ОблШапка.Параметры.Количество = Отчет.Количество;
	ОблШапка.Параметры.ЕдиницаИзмерения = Отчет.Спецификация.ЕдиницаИзмерения;
	ТабДок.Вывести(ОблШапка);
	Стоимость = РаскрытьНаМПЗ(Отчет.Спецификация,"",1,0);
	ОблКонец.Параметры.Сумма = Стоимость*Отчет.Количество;
	ТабДок.Вывести(ОблКонец);
	КонецЕсли; 
		Если Сводный Тогда
		ОбъектЗн = РеквизитФормыВЗначение("Отчет");
		Макет = ОбъектЗн.ПолучитьМакет("МакетСводный"); 
		ОблШапка = Макет.ПолучитьОбласть("Шапка");
		ОблУзел = Макет.ПолучитьОбласть("Узел");	
		ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");		
		ОблКонец = Макет.ПолучитьОбласть("Конец");	

		ОблШапка.Параметры.Спецификация = СокрЛП(Отчет.Спецификация.Наименование);
		ОблШапка.Параметры.НаДату = Формат(Отчет.НаДату,"ДФ=dd.MM.yyyy");
		ОблШапка.Параметры.Количество = Отчет.Количество;
		ТабДок.Вывести(ОблШапка);
		РаскрытьНаМПЗСвёрнутый(Отчет.Спецификация,1);
		ТЗ = ТаблицаМПЗ.Выгрузить();
		ТЗ.Свернуть("МПЗ,Цена","Количество");
		ТЗ.Сортировать("МПЗ");
		ИтогоСумма = 0;
			Для каждого ТЧ Из ТЗ Цикл	
			ОблМПЗ.Параметры.Наименование = СокрЛП(ТЧ.МПЗ.Наименование);
			ОблМПЗ.Параметры.МПЗ = ТЧ.МПЗ;
			ОблМПЗ.Параметры.ЕдиницаИзмерения = ТЧ.МПЗ.ЕдиницаИзмерения;
			ОблМПЗ.Параметры.Норма = ТЧ.Количество;
			ОблМПЗ.Параметры.Количество = ТЧ.Количество*Отчет.Количество;
			ОблМПЗ.Параметры.Цена = ТЧ.Цена;
			Сумма = ТЧ.Количество*Отчет.Количество*ТЧ.Цена;
			ОблМПЗ.Параметры.Сумма = Сумма;
			ТабДок.Вывести(ОблМПЗ);	
			ИтогоСумма = ИтогоСумма + Сумма;		
			КонецЦикла; 
		ОблКонец.Параметры.Сумма = ИтогоСумма;
		ТабДок.Вывести(ОблКонец);
		КонецЕсли;
			Если ТехОперации Тогда
			ТаблицаМПЗ.Очистить();
			ОбъектЗн = РеквизитФормыВЗначение("Отчет");
			Макет = ОбъектЗн.ПолучитьМакет("МакетТехОперации"); 
			ОблШапка = Макет.ПолучитьОбласть("Шапка");	
			ОблТО = Макет.ПолучитьОбласть("ТО");		
			ОблКонец = Макет.ПолучитьОбласть("Конец");	

			ОблШапка.Параметры.Спецификация = СокрЛП(Отчет.Спецификация.Наименование);
			ОблШапка.Параметры.НаДату = Формат(Отчет.НаДату,"ДФ=dd.MM.yyyy");
			ТабДок.Вывести(ОблШапка);
			РаскрытьНаТО(Отчет.Спецификация,1);
			ТЗ = ТаблицаМПЗ.Выгрузить();
			ТЗ.Свернуть("МПЗ,Цена,МашинноеВремя","Количество");
			ТЗ.Сортировать("МПЗ");
			СтоимостьВсего = 0;
				Для каждого ТЧ Из ТЗ Цикл	
				ОблТО.Параметры.Наименование = СокрЛП(ТЧ.МПЗ.Наименование);
				ОблТО.Параметры.ТО = ТЧ.МПЗ;
				ОблТО.Параметры.ВидРабот = ТЧ.МПЗ.ВидРабот;
				ОблТО.Параметры.Норма = ТЧ.Количество;
				ОблТО.Параметры.Количество = ТЧ.Количество*Отчет.Количество;
				ОблТО.Параметры.МашинноеВремя = ТЧ.МашинноеВремя;
				Стоимость = ТЧ.Количество*Отчет.Количество/60*ТЧ.Цена;
				ОблТО.Параметры.Стоимость = Стоимость;
				ТабДок.Вывести(ОблТО);	
				СтоимостьВсего = СтоимостьВсего + Стоимость;		
				КонецЦикла; 
			ОблКонец.Параметры.СтоимостьВсего = СтоимостьВсего;
			ТабДок.Вывести(ОблКонец);
			КонецЕсли; 
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли;  
КонецПроцедуры
