
&НаСервере
Функция ЭтоКанбан()
Возврат(Не Изделие.Канбан.Пустая());
КонецФункции

&НаКлиенте
Процедура ОформитьБрак(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если ЭтоКанбан() Тогда
		П = Новый Структура("ПЗ,Изделие,Количество",Объект.ПроизводственноеЗадание,Изделие,Количество);
		ОткрытьФорму("ОбщаяФорма.ОформлениеСобственногоБрака",П,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
		Сообщить("Выберите изделие канбан!");
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
   Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
      ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры

&НаСервере
Функция ПолучитьПЗ(Значение)
ПЗ = ЗначениеИзСтрокиВнутр(Значение);
Возврат(ПЗ);
КонецФункции

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ЭтаФорма.ВводДоступен() Тогда
	Массив = ОбщийМодульВызовСервера.РазложитьСтрокуВМассив(Данные,";");
		Если Массив[0] = "4" Тогда
		Объект.ПроизводственноеЗадание = ПолучитьПЗ(Массив[1]);
		ПроизводственноеЗаданиеПриИзмененииНаСервере();
		Иначе
		Сообщить("Неверный QRCode!");	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроизводственноеЗаданиеПриИзмененииНаСервере()
Элементы.Изделие.Доступность = Объект.ПроизводственноеЗадание.Пустая();
Элементы.Количество.Доступность = Объект.ПроизводственноеЗадание.Пустая();
Изделие = Объект.ПроизводственноеЗадание.Изделие;
Количество = Объект.ПроизводственноеЗадание.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ПроизводственноеЗаданиеПриИзменении(Элемент)
ПроизводственноеЗаданиеПриИзмененииНаСервере();
КонецПроцедуры
