
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ЭтотОбъект.ТолькоПросмотр = ОбщийМодульСозданиеДокументов.ЗапретРедактирования(Объект.Ссылка,Истина,Ложь);
	Если Не ОбщийМодульВызовСервера.ДоступностьРоли("Администратор") Тогда
	Элементы.ФормаПересчитатьТабличнуюЧасть.Видимость = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура КоличествоПриИзмененииНаСервере(СтароеКоличество)
	Для каждого ТЧ Из Объект.Спецификация Цикл	
	ТЧ.Количество = ТЧ.Количество/СтароеКоличество*Объект.Количество;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТабличнуюЧасть(Команда)
СтароеКоличество = 1;
		Если ВвестиЧисло(СтароеКоличество,"Введите кол-во, на которое рассчитана табличная часть.",14,3) Тогда
		КоличествоПриИзмененииНаСервере(СтароеКоличество);
		КонецЕсли; 
КонецПроцедуры
