
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
СортироватьПо = 2;
	Если Параметры.Свойство("Линейка") Тогда
	СписокЛинеек.Добавить(Параметры.Линейка);
	Отчет.ДатаНач = Параметры.ДатаНач;
	Отчет.ДатаКон = Параметры.ДатаКон;	
	СформироватьНаСервере();
	Иначе
	Отчет.ДатаНач = НачалоДня(ТекущаяДата());
	Отчет.ДатаКон = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
ТабДок.Очистить();

ТаблицаВыпуска = Новый ТаблицаЗначений;

ТаблицаВыпуска.Колонки.Добавить("СК",Новый ОписаниеТипов("СправочникСсылка.СтандартныеКомментарии"));
ТаблицаВыпуска.Колонки.Добавить("КолНО",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,2)));
ТаблицаВыпуска.Колонки.Добавить("КолНОУсл",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,2)));
ТаблицаВыпуска.Колонки.Добавить("КолПрих",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,2)));
ТаблицаВыпуска.Колонки.Добавить("КолПрихУсл",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,2)));
ТаблицаВыпуска.Колонки.Добавить("КолРасх",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,2)));
ТаблицаВыпуска.Колонки.Добавить("КолРасхУсл",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,2)));
ТаблицаВыпуска.Колонки.Добавить("КолКО",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,2)));
ТаблицаВыпуска.Колонки.Добавить("КолКОУсл",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,2)));

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблМТК = Макет.ПолучитьОбласть("МТК");
ОблКомментарий = Макет.ПолучитьОбласть("Комментарий");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Отчет.ДатаНач;
ОблШапка.Параметры.ДатаКон = Отчет.ДатаКон;
ОблШапка.Параметры.Линейки = СписокЛинеек;
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыВыпускаОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ПланыВыпускаОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ПланыВыпускаОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
	|	ПланыВыпускаОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта КАК МаршрутнаяКарта,
	|	ПланыВыпускаОстаткиИОбороты.Номенклатура,
	|	ПланыВыпускаОстаткиИОбороты.Номенклатура.УсловныеПриборы,
	|	ПланыВыпускаОстаткиИОбороты.КоличествоНачальныйОстаток * ПланыВыпускаОстаткиИОбороты.Номенклатура.УсловныеПриборы КАК НОУсл,
	|	ПланыВыпускаОстаткиИОбороты.КоличествоПриход * ПланыВыпускаОстаткиИОбороты.Номенклатура.УсловныеПриборы КАК ПрихУсл,
	|	ПланыВыпускаОстаткиИОбороты.КоличествоРасход * ПланыВыпускаОстаткиИОбороты.Номенклатура.УсловныеПриборы КАК РасхУсл,
	|	ПланыВыпускаОстаткиИОбороты.КоличествоКонечныйОстаток * ПланыВыпускаОстаткиИОбороты.Номенклатура.УсловныеПриборы КАК КОУсл,
	|	ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.СтандартныйКомментарий КАК СтандартныйКомментарий
	|ИЗ
	|	РегистрНакопления.ПланыВыпуска.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , ) КАК ПланыВыпускаОстаткиИОбороты
	|ГДЕ
	|	(ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Дата МЕЖДУ &ДатаНачМТК И &ДатаКонМТК
	|			ИЛИ ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Дата < &ДатаНачМТК)
	|	И ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Ремонт = ЛОЖЬ";  	
Запрос.УстановитьПараметр("ДатаНач",Отчет.ДатаНач);
Запрос.УстановитьПараметр("ДатаКон",Отчет.ДатаКон);
Запрос.УстановитьПараметр("ДатаНачМТК",НачалоДня(Отчет.ДатаНач));
Запрос.УстановитьПараметр("ДатаКонМТК",КонецДня(Отчет.ДатаКон));
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
	Если СортироватьПо = 1 Тогда
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Номер";
	ИначеЕсли СортироватьПо = 2 Тогда
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.НомерОчереди";
	ИначеЕсли СортироватьПо = 3 Тогда
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО ПланыВыпускаОстаткиИОбороты.Номенклатура";
	ИначеЕсли СортироватьПо = 4 Тогда
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.СтандартныйКомментарий";
	КонецЕсли; 
Запрос.Текст = Запрос.Текст + " ИТОГИ
								|	СУММА(КоличествоНачальныйОстаток),
								|	СУММА(КоличествоПриход),
								|	СУММА(КоличествоРасход),
								|	СУММА(КоличествоКонечныйОстаток),
								|	СУММА(НОУсл),
								|	СУММА(ПрихУсл),
								|	СУММА(РасхУсл),
								|	СУММА(КОУсл)
								|ПО
								|	ОБЩИЕ";
Результат = Запрос.Выполнить();
ВыборкаИтоги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтоги.Следующий() Цикл
	ОблКонец.Параметры.КолНачОстИтого = ВыборкаИтоги.КоличествоНачальныйОстаток;
	ОблКонец.Параметры.КолНачОстУслИтого = ВыборкаИтоги.НОУсл;
	ОблКонец.Параметры.КолВыпИтого = ВыборкаИтоги.КоличествоРасход;
	ОблКонец.Параметры.КолВыпУслИтого = ВыборкаИтоги.РасхУсл;
	ОблКонец.Параметры.КолСоздИтого = ВыборкаИтоги.КоличествоПриход;
	ОблКонец.Параметры.КолСоздУслИтого = ВыборкаИтоги.ПрихУсл;
	ОблКонец.Параметры.КолКонОстИтого = ВыборкаИтоги.КоличествоКонечныйОстаток;
	ОблКонец.Параметры.КолКонОстУслИтого = ВыборкаИтоги.КОУсл;
	Выборка = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока Выборка.Следующий() Цикл
		ОблМТК.Параметры.НомерМТК = Выборка.МаршрутнаяКарта.Номер;
		ОблМТК.Параметры.МТК = Выборка.МаршрутнаяКарта;
		ОблМТК.Параметры.ДатаСоздания = Выборка.МаршрутнаяКарта.Дата;
		ОблМТК.Параметры.Наименование = СокрЛП(Выборка.Номенклатура.Наименование);
		ОблМТК.Параметры.Продукция = Выборка.Номенклатура;
		ОблМТК.Параметры.КолНачОст = Выборка.КоличествоНачальныйОстаток;
		ОблМТК.Параметры.КолНачОстУсл = Выборка.НОУсл;
		ОблМТК.Параметры.КолВып = Выборка.КоличествоРасход;
		ОблМТК.Параметры.КолВыпУсл = Выборка.РасхУсл;
		ОблМТК.Параметры.КолСозд = Выборка.КоличествоПриход;
		ОблМТК.Параметры.КолСоздУсл = Выборка.ПрихУсл;
		ОблМТК.Параметры.КолКонОст = Выборка.КоличествоКонечныйОстаток;
		ОблМТК.Параметры.КолКонОстУсл = Выборка.КОУсл;
		ОблМТК.Параметры.СтандартныйКомментарий = СокрЛП(Выборка.МаршрутнаяКарта.СтандартныйКомментарий);
		ОблМТК.Параметры.Счёт = СокрЛП(Выборка.МаршрутнаяКарта.Счёт);
		ОблМТК.Параметры.ДатаОтгрузки = Формат(Выборка.МаршрутнаяКарта.ДатаОтгрузки,"ДФ=dd.MM.yyyy");;
		ЛО_Остановка = "";
			Если ЗначениеЗаполнено(Выборка.МаршрутнаяКарта.ДатаНачалаОстановки) Тогда
			ЛО_Остановка = "+";
			Иначе
			Запрос = Новый Запрос;

			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЛьготнаяОчередь.НормаРасходов
				|ИЗ
				|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
				|ГДЕ
				|	ЛьготнаяОчередь.ПЗ.ДокументОснование = &ДокументОснование";
			Запрос.УстановитьПараметр("ДокументОснование", Выборка.МаршрутнаяКарта);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
				ЛО_Остановка = "+";
				КонецЕсли;
			КонецЕсли; 
		ОблМТК.Параметры.ЛО_Остановка = ЛО_Остановка;
		ТабДок.Вывести(ОблМТК);
		ТЧ = ТаблицаВыпуска.Добавить();
		ТЧ.СК = Выборка.МаршрутнаяКарта.СтандартныйКомментарий;
		ТЧ.КолНО = Выборка.КоличествоНачальныйОстаток;
		ТЧ.КолНОУсл = Выборка.НОУсл;
		ТЧ.КолРасх = Выборка.КоличествоРасход;
		ТЧ.КолРасхУсл = Выборка.РасхУсл;
		ТЧ.КолПрих = Выборка.КоличествоПриход;
		ТЧ.КолПрихУсл = Выборка.ПрихУсл;
		ТЧ.КолКО = Выборка.КоличествоКонечныйОстаток;
		ТЧ.КолКОУсл = Выборка.КОУсл;
		КонецЦикла;	
	КонецЦикла;
ТаблицаВыпуска.Свернуть("СК","КолНО,КолНОУсл,КолПрих,КолПрихУсл,КолРасх,КолРасхУсл,КолКО,КолКОУсл");
ТаблицаВыпуска.Сортировать("СК");	
	Для каждого ТЧ Из ТаблицаВыпуска Цикл
	ОблКомментарий.Параметры.СтандартныйКомментарий = ТЧ.СК;
	ОблКомментарий.Параметры.КолНачОстИтого = ТЧ.КолНО;
	ОблКомментарий.Параметры.КолНачОстУслИтого = ТЧ.КолНОУсл;
	ОблКомментарий.Параметры.КолВыпИтого = ТЧ.КолРасх;
	ОблКомментарий.Параметры.КолВыпУслИтого = ТЧ.КолРасхУсл;
	ОблКомментарий.Параметры.КолСоздИтого = ТЧ.КолПрих;
	ОблКомментарий.Параметры.КолСоздУслИтого = ТЧ.КолПрихУсл;
	ОблКомментарий.Параметры.КолКонОстИтого = ТЧ.КолКО;
	ОблКомментарий.Параметры.КолКонОстУслИтого = ТЧ.КолКОУсл;
	ТабДок.Вывести(ОблКомментарий);	
	КонецЦикла; 
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 4;
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере(); 
КонецПроцедуры
