
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
	УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение,Дата));
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
ДокументОснование = ДанныеЗаполнения.Ссылка;
Подразделение = ДанныеЗаполнения.Подразделение;
Контрагент = ДанныеЗаполнения.Контрагент;
Договор = ДанныеЗаполнения.Договор;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПередачиВПереработкуОстатки.ВидМПЗ,
	|	ПередачиВПереработкуОстатки.МПЗ,
	|	ПередачиВПереработкуОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ПередачиВПереработку.Остатки КАК ПередачиВПереработкуОстатки
	|ГДЕ
	|	ПередачиВПереработкуОстатки.Контрагент = &Контрагент
	|	И ПередачиВПереработкуОстатки.Договор = &Договор
	|	И ПередачиВПереработкуОстатки.ПередачаВПереработку = &ПередачаВПереработку";
Запрос.УстановитьПараметр("Контрагент", Контрагент);
Запрос.УстановитьПараметр("Договор", Договор);
Запрос.УстановитьПараметр("ПередачаВПереработку", ДокументОснование);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = ТабличнаяЧасть.Добавить();
	ТЧ.ВидМПЗ = ВыборкаДетальныеЗаписи.ВидМПЗ;
	ТЧ.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
	ТЧ.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
// регистр ПередачиВПереработку Расход
Движения.ПередачиВПереработку.Записывать = Истина;
ВиртуальнаяТабличнаяЧасть = ТабличнаяЧасть.Выгрузить();
ВиртуальнаяТабличнаяЧасть.Свернуть("ВидМПЗ,МПЗ","Количество");
	Для Каждого ТЧ Из ВиртуальнаяТабличнаяЧасть Цикл
	Фильтр   = Новый Структура;
	Фильтр.Вставить("МПЗ", ТЧ.МПЗ);
	Фильтр.Вставить("Контрагент",Контрагент);
	Фильтр.Вставить("Договор", Договор);
	Фильтр.Вставить("ПередачаВПереработку", ДокументОснование);
	Остаток = РегистрыНакопления.ПередачиВПереработку.Остатки(Дата,Фильтр,"МПЗ,Контрагент,Договор,ПередачаВПереработку", "Количество");
		Если Остаток.Количество() > 0 Тогда
		КолОстаток = Остаток[0].Количество;
		Иначе
		КолОстаток = 0;
		КонецЕсли; 
			Если КолОстаток >= ТЧ.Количество Тогда
			Движение = Движения.ПередачиВПереработку.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Договор = Договор;
			Движение.Номенклатура = ДокументОснование.Номенклатура;
			Движение.ВидМПЗ = ТЧ.ВидМПЗ;
			Движение.МПЗ = ТЧ.МПЗ;
			Движение.ПередачаВПереработку = ДокументОснование;
			Движение.Количество = ТЧ.Количество;
			Иначе
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.УстановитьДанные(ЭтотОбъект);	
			Сообщение.Текст = "МПЗ "+ТЧ.МПЗ+" требуется списать: "+ТЧ.Количество+" остаток: "+КолОстаток;
			Сообщение.Сообщить();
			КонецЕсли; 		
	КонецЦикла;
КонецПроцедуры
