
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Объект.Период.Вариант = ВариантСтандартногоПериода.Сегодня;
КонецПроцедуры

&НаСервере
Функция ПолучитьТовар(Артикул)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Ссылка
	|ИЗ
	|	Справочник.Товары КАК Товары
	|ГДЕ
	|	Товары.Код = &Код";
Запрос.УстановитьПараметр("Код",Число(Артикул));
РезультатЗапроса = Запрос.Выполнить();
Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	Возврат(Выборка.Ссылка);
	КонецЦикла;
Возврат(Справочники.Товары.ПустаяСсылка());
КонецФункции

&НаСервере
Функция ПолучитьСпецификации(Товар)
СписокСпецификаций = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	СтатусыМПЗСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО СтатусыМПЗСрезПоследних.МПЗ = Номенклатура.Ссылка
	|ГДЕ
	|	Номенклатура.Товар = &Товар
	|	И СтатусыМПЗСрезПоследних.Статус <> &Статус";
Запрос.УстановитьПараметр("Товар",Товар);
Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыСпецификаций.Запрещённая);
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Статус = Перечисления.СтатусыСпецификаций.ДоИсчерпанияЗапасов Тогда
		СписокСпецификаций.Вставить(0,Выборка.Ссылка);
		Иначе
		СписокСпецификаций.Добавить(Выборка.Ссылка);
		КонецЕсли;	
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Материалы КАК Материалы
	|		ПО СтатусыМПЗСрезПоследних.МПЗ = Материалы.Ссылка
	|ГДЕ
	|	Материалы.Товар = &Товар
	|	И СтатусыМПЗСрезПоследних.Статус <> &Статус";
Запрос.УстановитьПараметр("Товар",Товар);
Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыМПЗ.Запрещённая);
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	СписокСпецификаций.Добавить(Выборка.Ссылка);
	КонецЦикла;
Возврат(СписокСпецификаций);
КонецФункции 

&НаСервере
Процедура ЗагрузитьНаСервере()
ТаблицаРеализаций.Очистить();
Запрос = Новый Запрос;
ЗапросТЧ = Новый Запрос;
ЗапросНоменклатура = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реализация._Number,
	|	Реализация._IDRRef,
	|	ДОБАВИТЬКДАТЕ(Реализация._Date_Time, МЕСЯЦ, -24000) КАК _Date_Time
	|ИЗ
	|	ВнешнийИсточникДанных.БазаСбыта.Таблица.Реализация КАК Реализация
	|ГДЕ
	|	ДОБАВИТЬКДАТЕ(Реализация._Date_Time, МЕСЯЦ, -24000) МЕЖДУ &ДатаНач И &ДатаКон
	|
	|УПОРЯДОЧИТЬ ПО
	|	_Date_Time";
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Объект.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Объект.Период.ДатаОкончания));
РезультатЗапроса = Запрос.Выполнить();
ВыборкаРеализаций = РезультатЗапроса.Выбрать();
	Пока ВыборкаРеализаций.Следующий() Цикл
	Док = Документы.СписаниеМПЗПрочее.НайтиПоНомеру(ВыборкаРеализаций._Number,ВыборкаРеализаций._Date_Time);
		Если Не Док.Пустая() Тогда		
		Продолжить; 
		КонецЕсли; 
	ТЧ = ТаблицаРеализаций.Добавить();
	ТЧ.Номер = ВыборкаРеализаций._Number;
	ТЧ.Дата = ВыборкаРеализаций._Date_Time;
	ЗапросТЧ.Текст = 
		"ВЫБРАТЬ
		|	Реализация_ТЧ.Номенклатура,
		|	Реализация_ТЧ.Количество
		|ИЗ
		|	ВнешнийИсточникДанных.БазаСбыта.Таблица.Реализация_ТЧ КАК Реализация_ТЧ
		|ГДЕ
		|	Реализация_ТЧ._Document404_IDRRef = &_Document404_IDRRef";
	ЗапросТЧ.УстановитьПараметр("_Document404_IDRRef",ВыборкаРеализаций._IDRRef);
	РезультатЗапроса = ЗапросТЧ.Выполнить();
	ВыборкаТЧ = РезультатЗапроса.Выбрать();
		Пока ВыборкаТЧ.Следующий() Цикл
		ЗапросНоменклатура.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура._Description,
			|	Номенклатура.Артикул,
			|	Номенклатура.ПолноеНаименование
			|ИЗ
			|	ВнешнийИсточникДанных.БазаСбыта.Таблица.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура._IDRRef = &_IDRRef";
		ЗапросНоменклатура.УстановитьПараметр("_IDRRef",ВыборкаТЧ.Номенклатура);
		РезультатЗапроса = ЗапросНоменклатура.Выполнить();
		ВыборкаНоменклатура = РезультатЗапроса.Выбрать();
			Пока ВыборкаНоменклатура.Следующий() Цикл	
			ТЧ_ТЧ = ТЧ.Номенклатура.Добавить();
			ТЧ_ТЧ.Наименование = ВыборкаНоменклатура._Description;
				Если Найти(ВыборкаНоменклатура._Description,"[") > 0 Тогда
				СтрокаПоиска = СокрЛП(Лев(ВыборкаНоменклатура._Description,Найти(ВыборкаНоменклатура._Description,"[")-1));
				Иначе	
				СтрокаПоиска = СокрЛП(ВыборкаНоменклатура._Description);
				КонецЕсли;			
			ТЧ_ТЧ.ПолноеНаименование = СокрЛП(Лев(ВыборкаНоменклатура.ПолноеНаименование,Найти(ВыборкаНоменклатура.ПолноеНаименование,СтрокаПоиска)-1));
			ТЧ_ТЧ.Артикул = ВыборкаНоменклатура.Артикул;
			ТЧ_ТЧ.Товар = ПолучитьТовар(ВыборкаНоменклатура.Артикул);
				Если Не ТЧ_ТЧ.Товар.Пустая() Тогда
				ТЧ_ТЧ.Спецификации = ПолучитьСпецификации(ТЧ_ТЧ.Товар);
				КонецЕсли;
			ТЧ_ТЧ.Количество = ВыборкаТЧ.Количество;
			КонецЦикла;
		КонецЦикла;
	ТЧ.Номенклатура.Сортировать("Наименование"); 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
ЗагрузитьНаСервере();
КонецПроцедуры
