
&НаСервере
Процедура СформироватьНаСервере()
БазаУТ = ОбщийМодульСинхронизации.УстановитьCOMСоединение(Справочники.ОбменДанными.НайтиПоНаименованию(Константы.БазаДанных1ССбыт.Получить(),Истина));
	Если БазаУТ = Неопределено Тогда
	Сообщить("Не установлена связь с базой УТ");
	Возврат;
	КонецЕсли;
ТабДок.Очистить();
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблТовар = Макет.ПолучитьОбласть("Товар");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.НаДату = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy; ДЛФ=DD");
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииПоступление.Номенклатура.Товар КАК Товар,
	|	ВыпускПродукцииПоступление.Ссылка.ДокументОснование.БарКод КАК БарКод,
	|	ВыпускПродукцииПоступление.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ВыпускПродукции.Поступление КАК ВыпускПродукцииПоступление
	|ГДЕ
	|	ВыпускПродукцииПоступление.Ссылка.ДокументОснование.СторонняяПоверка = ИСТИНА
	|	И ВыпускПродукцииПоступление.Ссылка.НаСклад = ИСТИНА
	|	И ВыпускПродукцииПоступление.Ссылка.Проведен = ИСТИНА
	|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыпускПродукцииПоступление.Номенклатура.Товар.Наименование
	|ИТОГИ ПО
	|	Товар";
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек); 
Результат = Запрос.Выполнить();
ВыборкаТовары = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
НомСтр = 1;
	Пока ВыборкаТовары.Следующий() Цикл
	бсНомен = БазаУТ.Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",ОбщийМодульВызовСервера.ПолучитьАртикулПоКодуТовара(ВыборкаТовары.Товар.Код));
		Если Не бсНомен.Пустая() Тогда
		НомерРеестра = СокрЛП(бсНомен.ИМРегистрационныйНомер);				
		Иначе
		НомерРеестра = "";
		КонецЕсли;
	ВыборкаДетальныхЗаписей = ВыборкаТовары.Выбрать();
		Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
		ОблТовар.Параметры.НомСтр = НомСтр;
		ОблТовар.Параметры.ПолноеНаименование = СокрЛП(ВыборкаТовары.Товар.ПолнНаименование);
		ОблТовар.Параметры.Наименование = СокрЛП(ВыборкаТовары.Товар.Наименование);
		ОблТовар.Параметры.БарКод = ВыборкаДетальныхЗаписей.БарКод;
		ОблТовар.Параметры.НомерРеестра = НомерРеестра;
		ОблТовар.Параметры.ДатаВыпуска = ВыборкаДетальныхЗаписей.Дата;
		ТабДок.Вывести(ОблТовар);
		НомСтр = НомСтр + 1;
		КонецЦикла;
	КонецЦикла; 
ТабДок.Вывести(ОблКонец);	
ТабДок.ФиксацияСверху = 2;	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли; 
КонецПроцедуры
