
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого ТЧ Из Параметры.Документ.ТабличнаяЧасть Цикл
		Если (СокрЛП(ТЧ.ЕдиницаИзмерения.Наименование) = "шт") или
			 (СокрЛП(ТЧ.ЕдиницаИзмерения.Наименование) = "упак") Тогда
			Для к = 1 По ТЧ.Количество Цикл
			ТЧ_Т = ТаблицаИзделий.Добавить();
			ТЧ_Т.Изделие = ТЧ.МПЗ;
			ТЧ_Т.Количество = 1;
			ТЧ_Т.ЕдиницаИзмерения = ТЧ.ЕдиницаИзмерения;
			КонецЦикла;
		Иначе 
		ТЧ_Т = ТаблицаИзделий.Добавить();
		ТЧ_Т.Изделие = ТЧ.МПЗ;
		ТЧ_Т.Количество = ТЧ.Количество;
		ТЧ_Т.ЕдиницаИзмерения = ТЧ.ЕдиницаИзмерения;		
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
   Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
      ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры

&НаСервере
Функция КнопкаСоздатьНаСервере()
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	НомСтр = 0;	
		Для каждого ТЧ Из ТаблицаИзделий Цикл
			Если ТипЗнч(ТЧ.Изделие) = Тип("СправочникСсылка.Номенклатура") Тогда
			Подразделение = ТЧ.Изделие.Линейка.Подразделение;
			Иначе	
			Подразделение = Константы.МестоХраненияГПТНП.Получить().Подразделение;
			КонецЕсли; 
		Н = Справочники.НумераторБарКодов.НайтиПоРеквизиту("Подразделение",Подразделение);
			Если Не Н.Пустая() Тогда
				Если КонецДня(Н.ДатаСброса) < КонецДня(ТекущаяДата()) Тогда
				Нумератор = Н.ПолучитьОбъект();
				Нумератор.СледующийНомер = 1;
				Нумератор.ДатаСброса = КонецГода(ТекущаяДата());
				Нумератор.Записать();					
				КонецЕсли;
			Иначе
			Сообщить(СокрЛП(Подразделение.Наименование)+" - не создан нумератор бар-кодов для подразделения!");
			ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
			Возврат(Ложь);
			КонецЕсли;
		НомСтр = НомСтр + 1;	
		Перепрогон = Документы.Перепрогон.СоздатьДокумент();
		Перепрогон.Автор = ПараметрыСеанса.Пользователь;
		Перепрогон.ДокументОснование = Параметры.Документ;
		Перепрогон.Дата = ТекущаяДата();
		Перепрогон.Номер = Параметры.Документ.Номер+"-"+Формат(НомСтр,"ЧЦ=2; ЧВН=");
		Перепрогон.Подразделение = Подразделение;
		Перепрогон.Статус = 2;
		Перепрогон.Изделие = ТЧ.Изделие;
		Перепрогон.Количество = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения);
		Перепрогон.Записать(РежимЗаписиДокумента.Запись);
		БарКод = РегистрыСведений.БарКоды.СоздатьМенеджерЗаписи();
		БарКод.Период = ТекущаяДата();
		БарКод.ПЗ = Перепрогон.Ссылка;
		БарКод.Изделие = ТЧ.Изделие;
		БарКод.Товар = ТЧ.Изделие.Товар;
			Если ТЧ.НовыйБарКод Тогда			
			БарКод.БарКод = ОбщийМодульВызовСервера.ПолучитьАртикулПоКодуТовара(ТЧ.Изделие.Товар.Код)+Сред(Год(ТекущаяДата()),4)+Формат(Месяц(ТекущаяДата()),"ЧЦ=2; ЧВН=")+Подразделение.Код+Формат(Н.СледующийНомер,"ЧЦ=6; ЧВН=; ЧГ=");	
			Нумератор = Н.ПолучитьОбъект();
			Нумератор.СледующийНомер = Нумератор.СледующийНомер+1;
			Нумератор.Записать();				
			Иначе
			БарКод.БарКод = ТЧ.СтарыйБарКод;
			КонецЕсли;
		БарКод.СтарыйБарКод = ТЧ.СтарыйБарКод;
		БарКод.Записать();
		КонецЦикла;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат(Ложь);
	КонецПопытки;
Возврат(Истина);
КонецФункции

&НаСервере
Функция ЭтоТовар(Изделие)
Возврат(ЗначениеЗаполнено(Изделие.Товар));
КонецФункции 

&НаКлиенте
Процедура КнопкаСоздать(Команда)
	Для каждого ТЧ Из ТаблицаИзделий Цикл	
		Если Не ЗначениеЗаполнено(ТЧ.СтарыйБарКод) Тогда	
		Сообщить("Не все старые бар-коды введены!");
		Возврат;
		КонецЕсли; 
			Если Не ЭтоТовар(ТЧ.Изделие) Тогда
			Сообщить(""+СокрЛП(ТЧ.Изделие)+" - не привязано к товару!");
			Возврат;
			КонецЕсли;
				Если СтрДлина(СокрЛП(ТЧ.СтарыйБарКод)) = 17 Тогда
					Если Не ПроверитьКодТовара(ТЧ.Изделие,Лев(ТЧ.СтарыйБарКод,5)) Тогда
					Сообщить(""+СокрЛП(ТЧ.Изделие)+" - код товара не совпадает с кодом товара в бар-коде!");
					Возврат;
					КонецЕсли;					
				Иначе	
					Если Не ПроверитьКодТовара(ТЧ.Изделие,Лев(ТЧ.СтарыйБарКод,6)) Тогда
					Сообщить(""+СокрЛП(ТЧ.Изделие)+" - код товара не совпадает с кодом товара в бар-коде!");
					Возврат;
					КонецЕсли;					
				КонецЕсли;  
	КонецЦикла; 
		Если КнопкаСоздатьНаСервере() Тогда
		ЭтаФорма.Закрыть();
		КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтмена(Команда)
ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ПроверитьКодТовара(Изделие,Код)
	Если ОбщийМодульВызовСервера.ПолучитьАртикулПоКодуТовара(Изделие.Товар.Код) = Код Тогда
	Возврат(Истина);	
	Иначе	
	Возврат(Ложь);
	КонецЕсли; 
КонецФункции 

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если СтрДлина(СокрЛП(Данные)) = 17 Тогда
		Если ПроверитьКодТовара(Элементы.ТаблицаИзделий.ТекущиеДанные.Изделие,Лев(Данные,5)) Тогда
		Элементы.ТаблицаИзделий.ТекущиеДанные.СтарыйБарКод = Данные;
		Иначе	
		Сообщить("Код товара не совпадает с кодом товара в бар-коде!");
		КонецЕсли;
	Иначе
		Если ПроверитьКодТовара(Элементы.ТаблицаИзделий.ТекущиеДанные.Изделие,Лев(Данные,6)) Тогда
		Элементы.ТаблицаИзделий.ТекущиеДанные.СтарыйБарКод = Данные;
		Иначе	
		Сообщить("Код товара не совпадает с кодом товара в бар-коде!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИзделийСтарыйБарКодПриИзменении(Элемент)
	Если СтрДлина(СокрЛП(Элементы.ТаблицаИзделий.ТекущиеДанные.СтарыйБарКод)) = 17 Тогда
		Если Не ПроверитьКодТовара(Элементы.ТаблицаИзделий.ТекущиеДанные.Изделие,Лев(Элементы.ТаблицаИзделий.ТекущиеДанные.СтарыйБарКод,5)) Тогда	
		Сообщить("Код товара не совпадает с кодом товара в бар-коде!");
		КонецЕсли;
	Иначе
		Если Не ПроверитьКодТовара(Элементы.ТаблицаИзделий.ТекущиеДанные.Изделие,Лев(Элементы.ТаблицаИзделий.ТекущиеДанные.СтарыйБарКод,6)) Тогда	
		Сообщить("Код товара не совпадает с кодом товара в бар-коде!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого ТЧ Из ТаблицаИзделий Цикл
	ТЧ.НовыйБарКод = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из ТаблицаИзделий Цикл
	ТЧ.НовыйБарКод = Ложь;
	КонецЦикла;
КонецПроцедуры
