
&НаСервере
Функция ПолучитьОсновнуюЕИ(МПЗ)
Возврат(МПЗ.ОсновнаяЕдиницаИзмерения);	
КонецФункции

&НаКлиенте
Процедура ДобавитьСписываемыеЭлементы(Команда)
Объект.ТабличнаяЧасть.Очистить();
ОткрытьФорму("Документ.Перепрогон.Форма.ФормаСписание",Новый Структура("Спецификация",Объект.Изделие),,,,, Новый ОписаниеОповещения("ДобавитьСписываемыеЭлементыЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСписываемыеЭлементыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Для каждого МПЗ Из Результат.СписокСписания Цикл
		ТЧ = Объект.ТабличнаяЧасть.Добавить();
		ТЧ.МПЗ = МПЗ.Значение;
		ТЧ.Количество = Число(МПЗ.Представление)*Объект.Количество;
		ТЧ.ЕдиницаИзмерения = ПолучитьОсновнуюЕИ(МПЗ.Значение);
		КонецЦикла;
	УдалитьДокументСписания();
	ЭтаФорма.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьДокументСписанияНаСервере()
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;	
		Если ЗначениеЗаполнено(Объект.ДокументСписания) Тогда
		Док = Объект.ДокументСписания.ПолучитьОбъект();
		Док.Удалить();
		КонецЕсли; 
	Списание = Документы.СписаниеМПЗПрочее.СоздатьДокумент();
	Списание.Дата = ТекущаяДата();
	Списание.УстановитьНовыйНомер(ПрисвоитьПрефикс(Объект.Подразделение));
	Списание.Автор = ПараметрыСеанса.Пользователь;
	Списание.ДокументОснование = Объект.Ссылка;
	Списание.Подразделение = Константы.МестоХраненияПерепрогон.Получить().Подразделение;
	Списание.МестоХранения = Константы.МестоХраненияПерепрогон.Получить();
	Списание.Статья = Объект.СтатьяСписания;
	Списание.Утвердил = Константы.МестоХраненияПерепрогон.Получить().МОЛ;
	Списание.Комментарий = "Списание элементов для перепрогона"; 
		Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
		ТЧ_С = Списание.ТабличнаяЧасть.Добавить();
			Если ТипЗнч(ТЧ.МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
			ТЧ_С.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
			Иначе				
			ТЧ_С.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
			КонецЕсли; 
		ТЧ_С.МПЗ = ТЧ.МПЗ;
		ТЧ_С.Количество = ТЧ.Количество;
		ТЧ_С.ЕдиницаИзмерения = ТЧ.ЕдиницаИзмерения;
		КонецЦикла;
	Списание.Записать(РежимЗаписиДокумента.Проведение);
	Объект.ДокументСписания = Списание.Ссылка;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат(Ложь);
	КонецПопытки;
Возврат(Истина);
КонецФункции

&НаКлиенте
Процедура СоздатьДокументСписания(Команда)
	Если Объект.ТабличнаяЧасть.Количество() > 0 Тогда
		Если Не Объект.СтатьяСписания.Пустая() Тогда
			Если Не ЗначениеЗаполнено(Объект.ДокументСписания) Тогда
				Если СоздатьДокументСписанияНаСервере() Тогда
				ЭтаФорма.Записать();
				КонецЕсли;
			КонецЕсли;
		Иначе
		Сообщить("Выберите статью списания!");
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьМестоХранения()
	Если Объект.Статус = 0 Тогда
		Если Константы.КодБазы.Получить() = "БГР" Тогда
		Объект.МестоХранения = Справочники.МестаХранения.НайтиПоНаименованию("Богородицк ГП СД (старые)",Истина);
		Иначе
		Объект.МестоХранения = Справочники.МестаХранения.НайтиПоНаименованию("Харьков ГП (старые)",Истина);
		КонецЕсли;
	ИначеЕсли Объект.Статус = 1 Тогда
		Если ТипЗнч(Объект.Изделие) = Тип("СправочникСсылка.Номенклатура") Тогда
		Объект.МестоХранения = Объект.Изделие.Линейка.МестоХраненияГП;
		Иначе	
		Объект.МестоХранения = Константы.МестоХраненияТНП.Получить();
		КонецЕсли; 	
	Иначе
	Объект.МестоХранения = Справочники.МестаХранения.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПройденПриИзменении(Элемент)
Элементы.МестоХранения.Доступность = ?(Объект.Статус <> 2,Истина,Ложь);
ПолучитьМестоХранения();
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументСписания()
	Если ЗначениеЗаполнено(Объект.ДокументСписания) Тогда
	Док = Объект.ДокументСписания.ПолучитьОбъект();
	Док.Удалить();
	Объект.ДокументСписания = Документы.СписаниеМПЗПрочее.ПустаяСсылка();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПослеУдаления(Элемент)
УдалитьДокументСписания();
ЭтаФорма.Модифицированность = Ложь;
ЭтаФорма.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДокументов(Команда)
ОткрытьФорму("Обработка.СозданныеБарКоды.Форма.Форма",Новый Структура("Перепрогон",Объект.Ссылка)); 
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСпецификации(Команда)
ОткрытьФорму("Отчет.ПечатьСпецификации.Форма.ФормаОтчета",Новый Структура("Спецификация,ВсяСпецификация",Объект.Изделие,Ложь));
КонецПроцедуры

&НаСервере
Процедура ПечатьТорг13НаСервере(ТабДок)
Макет = ПолучитьОбщийМакет("ТОРГ13_132");

ОблШапка = Макет.ПолучитьОбласть("Шапка");	
ОблЗаголовок = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблИтогиПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
ОблВсего = Макет.ПолучитьОбласть("Всего");
ОблПодвал = Макет.ПолучитьОбласть("Подвал");

ВсегоСтрок = Объект.ТабличнаяЧасть.Количество();
ВыведеноНаСтраницу = 0; ВыведеноВсего = 0;
НомерСтраницы = 1;
// установка размеров секций
ВысотаШапки = 14;
ВысотаПодвала = 7;
СтрокНаСТранице = 32;
// инициализация
ВсегоКоличество	= 0; ВсегоСумма = 0;
ИтогоКоличество = 0; ИтогоСумма = 0;

ОблШапка.Параметры.ПредставлениеОрганизации = ПолучитьПредставлениеОрганизации();
ОблШапка.Параметры.НомерДокумента = Объект.Номер;
ОблШапка.Параметры.ДатаДокумента = Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ОтправительПодразделение = Константы.МестоХраненияПерепрогон.Получить();
ОблШапка.Параметры.ПолучательПодразделение = Объект.МестоХранения;
ОблШапка.Параметры.ОрганизацияПоОКПО = Константы.КодОКПО.Получить();
ОблШапка.Параметры.ВидДеятельностиПоОКДП = Константы.КодОКДП.Получить();
ТабДок.Вывести(ОблШапка);
ТабДок.Вывести(ОблЗаголовок);
ОблСтрока.Параметры.ТоварНаименование = ?(ЗначениеЗаполнено(Объект.Изделие.ПолнНаименование) = 0 ,СокрЛП(Объект.Изделие.ПолнНаименование),СокрЛП(Объект.Изделие.Наименование));
	Если ТипЗнч(Объект.Изделие) = Тип("СправочникСсылка.Материалы") Тогда
	ОблСтрока.Параметры.ТоварКод = Объект.Изделие.Код;
	Иначе
	ОблСтрока.Параметры.ТоварКод = "";		
	КонецЕсли; 
ОблСтрока.Параметры.КоличествоМест = Объект.Количество;
ОблСтрока.Параметры.ЕдиницаИзмеренияНаименование = СокрЛП(Объект.Изделие.ЕдиницаИзмерения.Наименование);
ОблСтрока.Параметры.ЕдиницаИзмеренияКодПоОКЕИ = Объект.Изделие.ЕдиницаИзмерения.Код;
ОблСтрока.Параметры.КоличествоВОдномМесте = 1;
СуммаПеч = 0;
ТабДок.Вывести(ОблСтрока);
ВыведеноНаСтраницу = ВыведеноНаСтраницу + 1;
ВыведеноВсего      = ВыведеноВсего      + 1;
// вычисляем итоги
ВсегоСумма      = ВсегоСумма      + СуммаПеч;
ИтогоКоличество = ИтогоКоличество + Объект.Количество;
ИтогоСумма      = ИтогоСумма      + СуммаПеч;
ОблВсего.Параметры.ИтогоКоличествоМест = ИтогоКоличество;
ОблВсего.Параметры.ИтогоСумма = ВсегоСумма;
ТабДок.Вывести(ОблВсего);
ОблПодвал.Параметры.ИтогоСуммаПрописью = ВсегоСумма;
ОблПодвал.Параметры.ИтогоСуммаКоп = Цел((ВсегоСумма-Цел(ВсегоСумма))*100);
ОблПодвал.Параметры.ФИООтправителя = Объект.Автор.Наименование;
ОблПодвал.Параметры.ФИОПолучателя = Объект.МестоХранения.МОЛ.Наименование;
ТабДок.Вывести(ОблПодвал);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТорг13(Команда)
	Если ЭтаФорма.Модифицированность Тогда	
	Сообщить("Для печати документ необходимо перепровести.");
	Возврат;		
	КонецЕсли;
ТабДок = Новый ТабличныйДокумент;

ПечатьТорг13НаСервере(ТабДок);
ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
ТабДок.Показать("Форма ТОРГ-13");
КонецПроцедуры