
&НаКлиенте
Функция СоздатьПоследовательностьГрупп(V7,ТекРодитель)

ГруппаЭлемента = V7.CreateObject("Справочник."+ТекРодитель.Вид());

СписокГрупп.СортироватьПоПредставлению(НаправлениеСортировки.Убыв);
	Для каждого Стр Из СписокГрупп Цикл
	ГруппаЭлемента.ИспользоватьРодителя(ТекРодитель.ТекущийЭлемент());		
		Если ГруппаЭлемента.НайтиПоНаименованию(Стр.Значение,1,1) = 0 Тогда 
	    ГруппаЭлемента.НоваяГруппа();
	 	ГруппаЭлемента.Родитель = ТекРодитель.ТекущийЭлемент();
		ГруппаЭлемента.Наименование = Стр.Значение; 
		ГруппаЭлемента.Субсчет = V7.EvalExpr("СчетПоКоду("""+"10.1"+""")");		
		ГруппаЭлемента.Записать();
		КонецЕсли;
	ТекРодитель = ГруппаЭлемента.ТекущийЭлемент();	
	КонецЦикла;	
Возврат(ТекРодитель.ТекущийЭлемент());	
КонецФункции

&НаСервере
Функция ПолучитьПараметры()
Возврат(Новый Структура("Наименование,ПолнНаименование,Комментарий,ЕдиницаИзмерения,ОснЕИ",МПЗ.Наименование,МПЗ.ПолнНаименование,МПЗ.Комментарий,МПЗ.ЕдиницаИзмерения.Наименование,МПЗ.ОсновнаяЕдиницаИзмерения.Наименование));
КонецФункции

&НаСервере
Функция ПолучитьПараметрыОснЕИ(ОснЕИ)
Возврат(Новый Структура("Наименование,ЕИ,Коэффициент",ОснЕИ.Наименование,ОснЕИ.ЕдиницаИзмерения.Наименование,ОснЕИ.Коэффициент));
КонецФункции

&НаСервере
Процедура ПолучитьСписокРодителей()
ТекГруппа = МПЗ.Родитель;
k = 1;
	Пока ЗначениеЗаполнено(ТекГруппа) Цикл
	СписокГрупп.Добавить(ТекГруппа.Наименование,k);
	ТекГруппа = ТекГруппа.Родитель;
	k = k + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокОснЕИ()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновныеЕдиницыИзмерений.Ссылка
	|ИЗ
	|	Справочник.ОсновныеЕдиницыИзмерений КАК ОсновныеЕдиницыИзмерений
	|ГДЕ
	|	ОсновныеЕдиницыИзмерений.ПометкаУдаления = ЛОЖЬ
	|	И ОсновныеЕдиницыИзмерений.Владелец = &Владелец";
Запрос.УстановитьПараметр("Владелец", МПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокОснЕИ.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Соединиться(Команда)
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
	Возврат;
	КонецЕсли; 
НастройкиОбменаДанными = ОбщийМодульСинхронизации.ПолучитьНастройкиОбменаДанными(Объект.ОбменДанными);
V7 = ОбщийМодульКлиент.ПодключитьсяК1С77(НастройкиОбменаДанными.ПутьКБазеДанных,Объект.ИмяПользователя,Объект.Пароль);
	Если V7 = Неопределено Тогда
	Возврат;	
	КонецЕсли;
Состояние("Обработка...",,"Перенос...");
Парам = ПолучитьПараметры();
ЭлементБазы = V7.CreateObject("Справочник.Материалы");
СпрЕд = V7.CreateObject("Справочник.ЕдиницыИзмерений"); 
СпрОснЕдНов = V7.CreateObject("Справочник.ЕдиницыМатериалов");

	Если ЭлементБазы.НайтиПоНаименованию(Парам.Наименование,0,1) = 1 Тогда
	Сообщить(Парам.Наименование+" - уже внесён в базу");
	Возврат;	
	КонецЕсли;

СписокГрупп.Очистить();
СписокОснЕИ.Очистить();
ПолучитьСписокРодителей(); 
ПолучитьСписокОснЕИ();  
ТекРод = СоздатьПоследовательностьГрупп(V7,V7.ПолучитьПустоеЗначение("Справочник.Материалы"));
ЭлементБазы.ИспользоватьРодителя(ТекРод.ТекущийЭлемент());
ЭлементБазы.ПорядокКодов();
ЭлементБазы.ОбратныйПорядок(1);
ЭлементБазы.ВыбратьЭлементы();
	Если ЭлементБазы.ПолучитьЭлемент() = 1 Тогда
	ТекКод = Число(ЭлементБазы.Код) + 1;
	Иначе	
	ТекКод = 1;
	КонецЕсли; 
ЭлементБазы.Новый();
ЭлементБазы.Код = ТекКод;
ЭлементБазы.Родитель = ТекРод.ТекущийЭлемент();
ЭлементБазы.Субсчет = V7.EvalExpr("СчетПоКоду("""+"10.1"+""")");
ЭлементБазы.Наименование = Парам.Наименование;
ЭлементБазы.ПолнНаименование = Парам.ПолнНаименование;
//ЭлементБазы.Статус = Парам.Статус;
ЭлементБазы.ДатаПрисвоения = ТекущаяДата();
ЭлементБазы.Комментарий = Парам.Комментарий;
СпрЕд.НайтиПоНаименованию(Парам.ЕдиницаИзмерения,0,1);
ЭлементБазы.ЕдиницаИзмерения = СпрЕд.ТекущийЭлемент();
//ЭлементБазы.ИмяФайла = ФайлЭлемента.ТекущийЭлемент();
ЭлементБазы.флИзменение = 1;
ЭлементБазы.Записать();
ЭлементБазы.СтавкаНДС.Установить(ТекущаяДата(),V7.Константа.ОсновнаяСтавкаНДС);
ЭлементБазы.СтавкаНП.Установить(ТекущаяДата(),V7.Константа.ОсновнаяСтавкаНП);
//ЭлементБазы.Стоимость.Установить(ТекущаяДата(),ТекЭлемент.Стоимость.Получить(РабочаяДата()));
//ЭлементБазы.Цена.Установить(ТекущаяДата(),ТекЭлемент.Цена.Получить(РабочаяДата()));   
	//Если ТекЭлемент.Статус > 0 Тогда
	//ЭлементБазы.Литера.Установить(РабочаяДата(),V7.Перечисление.СтатусыСпецификаций.ЗначениеПоНомеру(ТекЭлемент.Литера.Получить(РабочаяДата()).ПорядковыйНомер()));		
	//КонецЕсли;
	Для каждого ОснЕИ Из СписокОснЕИ Цикл
	ПарамОснЕИ = ПолучитьПараметрыОснЕИ(ОснЕИ.Значение);
	СпрОснЕдНов.Новый();
	СпрОснЕдНов.Владелец = ЭлементБазы.ТекущийЭлемент();
	СпрОснЕдНов.Наименование = ПарамОснЕИ.Наименование;
	СпрЕд.НайтиПоНаименованию(ПарамОснЕИ.ЕИ);
	СпрОснЕдНов.ЕдиницаИзмерения = СпрЕд.ТекущийЭлемент();
	СпрОснЕдНов.Коэффициент = ПарамОснЕИ.Коэффициент;
	СпрОснЕдНов.Записать();                                   
		Если СокрЛП(ПарамОснЕИ.Наименование) = СокрЛП(Парам.ОснЕИ) Тогда
		ЭлементБазы.ОсновнаяЕдиницаИзмерения = СпрОснЕдНов.ТекущийЭлемент();
		ЭлементБазы.Записать();	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

