
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Количество = 1;
КонецПроцедуры

&НаСервере
Функция СоздатьБарКодыНаСервере()
	Если Подразделение.Пустая() Тогда
	Сообщить("Подразделение не выбрано!");
	Возврат(Ложь);
	КонецЕсли; 
		Если Изделие = Неопределено Тогда
		Сообщить("Изделие не выбрано!");
		Возврат(Ложь);
		КонецЕсли;  
			Если Изделие.Товар.Пустая() Тогда
			Сообщить("Изделию не присвоен Товар!");
			Возврат(Ложь);
			КонецЕсли; 
Н = Справочники.НумераторБарКодов.НайтиПоРеквизиту("Подразделение",Подразделение);
	Если Н.Пустая() Тогда
	Сообщить("Не создан нумератор бар-кодов для подразделения!");
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат(Ложь);
	КонецЕсли;
		Если КонецДня(Н.ДатаСброса) < КонецДня(ТекущаяДата()) Тогда
		Нумератор = Н.ПолучитьОбъект();
		Нумератор.СледующийНомер = 1;
		Нумератор.ДатаСброса = КонецГода(ТекущаяДата());
		Нумератор.Записать();					
		КонецЕсли;
Период = ТекущаяДата();
	Для к = 1 По Количество Цикл
	БарКод = РегистрыСведений.БарКоды.СоздатьМенеджерЗаписи();
	БарКод.Период = Период;
	БарКод.Товар = Изделие.Товар;
	БарКод.Изделие = Изделие;
	БарКод.БарКод = ОбщийМодульВызовСервера.ПолучитьАртикулПоКодуТовара(Изделие.Товар.Код)+Сред(Год(Период),4)+Формат(Месяц(Период),"ЧЦ=2; ЧВН=")+Подразделение.Код+Формат(Н.СледующийНомер,"ЧЦ=6; ЧВН=; ЧГ=");;		
	БарКод.Записать(Ложь);
	Нумератор = Н.ПолучитьОбъект();
	Нумератор.СледующийНомер = Нумератор.СледующийНомер+1;
	Нумератор.Записать();
	Период = Период + 1;
	КонецЦикла;
Возврат(Истина);
КонецФункции

&НаКлиенте
Процедура СоздатьБарКоды(Команда)
	Если СоздатьБарКодыНаСервере() Тогда
	ЭтаФорма.Закрыть(Изделие);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры
