
&НаСервере
Функция ПолучитьСписокВхождений(Проект,ПрименениеВ)
спВхождения = Новый СписокЗначений;
                        
	Если ПрименениеВ = 1 Тогда
	Выборка = Справочники.Номенклатура.Выбрать(,,Новый Структура("Проект",Проект));
		Пока Выборка.Следующий() Цикл
			Если спВхождения.НайтиПоЗначению(Выборка.Ссылка) = Неопределено Тогда
			спВхождения.Добавить(Выборка.Ссылка,"["+ПолучитьСтатус(Выборка.Ссылка)+"] "+Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;	
	ИначеЕсли ПрименениеВ = 2 Тогда	
	Выборка = Справочники.Материалы.Выбрать(,,Новый Структура("Проект",Проект));
		Пока Выборка.Следующий() Цикл
			Если спВхождения.НайтиПоЗначению(Выборка.Ссылка) = Неопределено Тогда
			спВхождения.Добавить(Выборка.Ссылка,"["+ПолучитьСтатус(Выборка.Ссылка)+"] "+Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;	
	ИначеЕсли ПрименениеВ = 3 Тогда
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаПроизводство.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
		|ГДЕ
		|	ЗаказНаПроизводство.Проект = &Проект";
	Запрос.УстановитьПараметр("Проект", Проект);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		спВхождения.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
	КонецЕсли;     
Возврат(спВхождения);
КонецФункции 
       
&НаКлиенте
Процедура Применение(ПрименениеВ)
спВхождения = ПолучитьСписокВхождений(Элементы.Список.ТекущаяСтрока,ПрименениеВ);
	Если спВхождения.Количество() = 1 Тогда
	ВыбЭлемент = спВхождения[0].Значение;
	ИначеЕсли спВхождения.Количество() > 0 Тогда
	спВхождения.СортироватьПоЗначению();
	Выборка = спВхождения.ВыбратьЭлемент();
		Если Выборка <> Неопределено Тогда
		ВыбЭлемент = Выборка.Значение;
		Иначе
        Возврат;
		КонецЕсли;
	Иначе
	Предупреждение("Не применяется!",10);
    Возврат;
	КонецЕсли;      
		Если ТипЗнч(ВыбЭлемент) = Тип("СправочникСсылка.Номенклатура") Тогда
		ТекФорма = ПолучитьФорму("Справочник.Номенклатура.ФормаСписка");
		ТекФорма.Открыть();
		ТекФорма.Элементы.Список.ТекущаяСтрока = ВыбЭлемент;
		ИначеЕсли ТипЗнч(ВыбЭлемент) = Тип("СправочникСсылка.Материалы") Тогда
		ТекФорма = ПолучитьФорму("Справочник.Материалы.ФормаСписка");
		ТекФорма.Открыть();
		ТекФорма.Элементы.Список.ТекущаяСтрока = ВыбЭлемент;
		Иначе
		ТекФорма = ПолучитьФорму("Документ.ЗаказНаПроизводство.ФормаСписка");
		ТекФорма.Открыть();
		ТекФорма.Элементы.Список.ТекущаяСтрока = ВыбЭлемент;
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрименениеВНоменклатуре(Команда)
Применение(1);
КонецПроцедуры

&НаКлиенте
Процедура ПрименениеВМатериалах(Команда)
Применение(2);
КонецПроцедуры

&НаКлиенте
Процедура ПрименениеВЗНП(Команда)
Применение(3);
КонецПроцедуры
