
&НаСервере
Функция СформироватьНаСервере() 
Отчет.ТабличнаяЧасть.Очистить();
ТабДок.Очистить();

Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблГруппа = Макет.ПолучитьОбласть("Группа");
ОблПФ = Макет.ПолучитьОбласть("ПФ");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.Линейки = СписокЛинеек;
ТабДок.Вывести(ОблШапка);
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПередачиВПроизводствоОбороты.МПЗ КАК МПЗ,
	|	ПередачиВПроизводствоОбороты.КоличествоПриход КАК КоличествоПриход
	|ИЗ
	|	РегистрНакопления.ПередачиВПроизводство.Обороты(&ДатаНач, &ДатаКон, Регистратор, Документ.Линейка В ИЕРАРХИИ (&СписокЛинеек)) КАК ПередачиВПроизводствоОбороты
	|ГДЕ
	|	ПередачиВПроизводствоОбороты.ВидМПЗ = &ВидМПЗ
	|	И ПередачиВПроизводствоОбороты.МПЗ.Канбан = &Канбан";
	Если ОтборПо = 1 Тогда
	Запрос.Текст = Запрос.Текст + " И ПередачиВПроизводствоОбороты.Регистратор.ДокументОснование.ДокументОснование.Ремонт = ЛОЖЬ";
	Иначе
	Запрос.Текст = Запрос.Текст + " И ПередачиВПроизводствоОбороты.Регистратор.ДокументОснование.ДокументОснование.Ремонт = ИСТИНА";
	КонецЕсли; 
Запрос.Текст = Запрос.Текст + " ИТОГИ СУММА(КоличествоПриход)
								|ПО МПЗ";	  	
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ВидМПЗ",Перечисления.ВидыМПЗ.Полуфабрикаты);
Запрос.УстановитьПараметр("Канбан",Справочники.ВидыКанбанов.ПустаяСсылка());
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
	ТЧ = Отчет.ТабличнаяЧасть.Добавить();
	ТЧ.ГруппаСпецификаций = ПолучитьГруппуЭтапаПроизводства(Выборка.МПЗ.Родитель);
	ТЧ.ПФ = Выборка.МПЗ;
	ТЧ.Количество = Выборка.КоличествоПриход;
	КонецЦикла;	

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОбороты.МПЗ,
	|	МестаХраненияОбороты.КоличествоПриход
	|ИЗ
	|	РегистрНакопления.МестаХранения.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК МестаХраненияОбороты
	|ГДЕ
	|	МестаХраненияОбороты.Регистратор.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И МестаХраненияОбороты.ВидМПЗ = &ВидМПЗ
	|	И (ТИПЗНАЧЕНИЯ(МестаХраненияОбороты.Регистратор.Ссылка) = ТИП(Документ.ВыпускПродукции)
	|		ИЛИ ТИПЗНАЧЕНИЯ(МестаХраненияОбороты.Регистратор.Ссылка) = ТИП(Документ.ВыпускПродукцииКанбан))";
	Если ОтборПо = 1 Тогда
	Запрос.Текст = Запрос.Текст + " И МестаХраненияОбороты.Регистратор.ДокументОснование.ДокументОснование.Ремонт = ЛОЖЬ";
	Иначе
	Запрос.Текст = Запрос.Текст + " И МестаХраненияОбороты.Регистратор.ДокументОснование.ДокументОснование.Ремонт = ИСТИНА";
	КонецЕсли; 
Запрос.Текст = Запрос.Текст + " ИТОГИ СУММА(КоличествоПриход)
								|ПО МПЗ";	  	
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ВидМПЗ",Перечисления.ВидыМПЗ.Полуфабрикаты);
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
	ТЧ = Отчет.ТабличнаяЧасть.Добавить();
	ТЧ.ГруппаСпецификаций = ПолучитьГруппуЭтапаПроизводства(Выборка.МПЗ.Родитель);
	ТЧ.ПФ = Выборка.МПЗ;
	ТЧ.Количество = Выборка.КоличествоПриход;
	КонецЦикла;	
Отчет.ТабличнаяЧасть.Сортировать("ГруппаСпецификаций,ПФ");
ТекГруппа = Справочники.Номенклатура.ПустаяСсылка();
	Для каждого ТЧ Из Отчет.ТабличнаяЧасть Цикл
		Если ТекГруппа <> ТЧ.ГруппаСпецификаций Тогда
		ОблГруппа.Параметры.ГруппаСпецификаций = ТЧ.ГруппаСпецификаций;
		ТабДок.Вывести(ОблГруппа);
		ТекГруппа = ТЧ.ГруппаСпецификаций;
		КонецЕсли; 
	ОблПФ.Параметры.ПФ = ТЧ.ПФ;
	ОблПФ.Параметры.Наименование = СокрЛП(ТЧ.ПФ.Наименование);
	ОблПФ.Параметры.Количество = ТЧ.Количество;
	ТабДок.Вывести(ОблПФ);
	КонецЦикла; 
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Состояние("Обработка...",,"Формирование отчёта...");	
	СформироватьНаСервере();		
	КонецЕсли;  
КонецПроцедуры
