
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьФискальногоОтчетаЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтотОбъект.Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru='Печать фискального отчета завершена.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтчетаБезГашенияВыполнить()
	
	ОчиститьСообщения();
		
	ЭтотОбъект.Доступность = Ложь;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПечатьФискальногоОтчетаЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьПечатьФискальногоОтчета(ОповещениеПриЗавершении, УникальныйИдентификатор, Неопределено, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтчетаСГашениемВыполнить()
	
	ОчиститьСообщения();
	
	ЭтотОбъект.Доступность = Ложь;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПечатьФискальногоОтчетаЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьПечатьФискальногоОтчета(ОповещениеПриЗавершении, УникальныйИдентификатор, Неопределено, Истина);
	
КонецПроцедуры

#КонецОбласти