
&НаСервере
Процедура РаскрытьНаМПЗ(ЭтапСпецификации,КолУзла,Канбан)
ВыборкаНР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_М(ЭтапСпецификации,ТекущаяДата());
	Пока ВыборкаНР.Следующий() Цикл
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
			Если ТипКанбана = 1 Тогда
				Если Не ВидКанбана.Пустая() Тогда
					Если Канбан = ВидКанбана Тогда
					ТЧ = ТаблицаКанбанов.Добавить();
					ТЧ.Канбан = ВыборкаНР.Элемент;
					ТЧ.Количество = ПолучитьБазовоеКоличествоБезОкругления(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
					КонецЕсли;
				Иначе
				ТЧ = ТаблицаКанбанов.Добавить();
				ТЧ.Канбан = ВыборкаНР.Элемент;
				ТЧ.Количество = ПолучитьБазовоеКоличествоБезОкругления(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;								
				КонецЕсли;
			КонецЕсли; 					
		Иначе
		БазовоеКоличество = ПолучитьБазовоеКоличествоБезОкругления(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения);
			Если ТипКанбана = 2 Тогда
				Если Не ВидКанбана.Пустая() Тогда
					Если ВыборкаНР.Элемент.Канбан = ВидКанбана Тогда
					ТЧ = ТаблицаКанбанов.Добавить();
					ТЧ.Канбан = ВыборкаНР.Элемент;	
					ТЧ.Количество = ПолучитьБазовоеКоличествоБезОкругления(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;					
					КонецЕсли;
				Иначе
					Если Не ВыборкаНР.Элемент.Канбан.Пустая() Тогда
					ТЧ = ТаблицаКанбанов.Добавить();
					ТЧ.Канбан = ВыборкаНР.Элемент;	
					ТЧ.Количество = ПолучитьБазовоеКоличествоБезОкругления(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
				Если ВыборкаНР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Набор Тогда
				РаскрытьНаМПЗ(ВыборкаНР.Элемент,БазовоеКоличество*КолУзла,Канбан);
				ИначеЕсли ВыборкаНР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Основа Тогда
					Если ВыборкаНР.Элемент.Канбан.Пустая() Тогда
					РаскрытьНаМПЗ(ВыборкаНР.Элемент,БазовоеКоличество*КолУзла,Канбан);
					Иначе	
					РаскрытьНаМПЗ(ВыборкаНР.Элемент,БазовоеКоличество*КолУзла,ВыборкаНР.Элемент.Канбан);
					КонецЕсли;
				Иначе 	
				РаскрытьНаМПЗ(ВыборкаНР.Элемент,БазовоеКоличество*КолУзла,ВыборкаНР.Элемент.Канбан);
				КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Процедура ПолучитьКанбаныПоПерспективномуПлануНаСервере()
СписокДат = Новый СписокЗначений;
ТЗ = Новый ТаблицаЗначений;
Запрос = Новый Запрос;

ТЗ.Колонки.Добавить("Пометка",Новый ОписаниеТипов("Булево"),"П.");
	Если ТипКанбана = 1 Тогда
	ТЗ.Колонки.Добавить("Статус",Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыМПЗ"),"Ст.");
	ТЗ.Колонки.Добавить("ГруппаПоЗакупкам",Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыПоЗакупкам"),"Гр.");
	ТЗ.Колонки.Добавить("Канбан",Новый ОписаниеТипов("СправочникСсылка.Материалы"),"Канбан");
	Иначе
	ТЗ.Колонки.Добавить("Статус",Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыСпецификаций"),"Ст.");
	ТЗ.Колонки.Добавить("Канбан",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),"Канбан");
	КонецЕсли;
ТЗ.Колонки.Добавить("ТочкаЗаказа",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(3,0)),"ТЗ");
ТЗ.Колонки.Добавить("КолЯчеек",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(2,0)),"Кол. ячеек");
ТЗ.Колонки.Добавить("КолВЯчейке",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(4,0)),"Кол. в ячейке");
ТекДата = Объект.Период.ДатаНачала;
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		Если День(ТекДата) = 1 Тогда
		СписокДат.Добавить(ТекДата);	
		ТЗ.Колонки.Добавить("Д"+СписокДат.Количество(),Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(14,3)),Формат(ТекДата,"ДФ=MM.yy"));	
		КонецЕсли;			
	ТекДата = ТекДата + 86400;
	КонецЦикла;
ТЗ.Колонки.Добавить("КолОборотов",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(2,0)),"Кол. оборотов в мес.");
ТЗ.Колонки.Добавить("ТочкаЗаказаРасч",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(3,0)),"ТЗ");
ТЗ.Колонки.Добавить("КолЯчеекРасч",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(2,0)),"Кол. ячеек");
ТЗ.Колонки.Добавить("КолВЯчейкеРасч",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(4,0)),"Кол. в ячейке");
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПерспективныеПланы.Период КАК Период,
	|	ПерспективныеПланы.МПЗ КАК МПЗ,
	|	ПерспективныеПланы.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.ПерспективныеПланы КАК ПерспективныеПланы
	|ГДЕ
	|	ПерспективныеПланы.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПерспективныеПланы.МПЗ.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И ПерспективныеПланы.Количество > 0
	|ИТОГИ ПО
	|	МПЗ";
Запрос.УстановитьПараметр("ДатаНач", Объект.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Объект.Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыборкаМПЗ.Следующий() Цикл
	ВыборкаПП = ВыборкаМПЗ.Выбрать();
		Пока ВыборкаПП.Следующий() Цикл
		НомСтр = СписокДат.НайтиПоЗначению(ВыборкаПП.Период).ПолучитьИдентификатор()+1;
		ТаблицаКанбанов.Очистить();
		РаскрытьНаМПЗ(ВыборкаМПЗ.МПЗ,ВыборкаПП.Количество,ВыборкаМПЗ.МПЗ.Канбан);
			Для каждого ТЧ Из ТаблицаКанбанов Цикл
			ТЧ_ТЗ = ТЗ.НайтиСтроки(Новый Структура("Канбан",ТЧ.Канбан));
				Если ТЧ_ТЗ.Количество() = 0 Тогда
				ТЧ_ТЗ = ТЗ.Добавить();
				ТЧ_ТЗ.Пометка = Истина;
				ТЧ_ТЗ.Статус = ПолучитьСтатус(ТЧ.Канбан,ТекущаяДата());
					Если ТипКанбана = 1 Тогда
					ТЧ_ТЗ.ГруппаПоЗакупкам = ТЧ.Канбан.ГруппаПоЗакупкам;
					КонецЕсли; 		
				ТЧ_ТЗ.Канбан = ТЧ.Канбан;
				ЯК = ОбщийМодульРаботаСРегистрами.ПолучитьЯчейкуКомплектацииПоМестуХранения(СписокЛинеек[0].Значение.МестоХраненияКанбанов,ТЧ.Канбан);
				ТЧ_ТЗ.КолЯчеек = ЯК.КоличествоЯчеек;
				ТЧ_ТЗ.КолВЯчейке = ЯК.КоличествоВЯчейке;
				ТЧ_ТЗ.ТочкаЗаказа = ЯК.ТочкаЗаказа;
				ТЧ_ТЗ["Д"+НомСтр] = ТЧ.Количество;				
				Иначе	
				ТЧ_ТЗ[0]["Д"+НомСтр] = ТЧ_ТЗ[0]["Д"+НомСтр] + ТЧ.Количество;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
ТЗ.Сортировать("Канбан");
МассивРеквизитов = Новый Массив;
МассивУдаляемыхРеквизитов = Новый Массив;

МассивРеквизитов.Добавить(Новый РеквизитФормы("Номенклатура", Новый ОписаниеТипов("ТаблицаЗначений"), "", "Номенклатура"));
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Если Колонка.Имя = "Наименование" Тогда
		Продолжить;
		КонецЕсли; 
    МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "Номенклатура", Колонка.Заголовок)); 
	КонецЦикла;
МассивУдаляемыхРеквизитов.Добавить("Номенклатура");
	Если Элементы.Найти("Номенклатура") <> Неопределено Тогда
	Элементы.Удалить(Элементы["Номенклатура"]);
	ИзменитьРеквизиты(,МассивУдаляемыхРеквизитов);
	КонецЕсли;
ИзменитьРеквизиты(МассивРеквизитов);
//Помещаем Элементы на форму 
Таблица = Элементы.Добавить("Номенклатура", Тип("ТаблицаФормы")); 
Таблица.ПутьКДанным = "Номенклатура"; 
Таблица.Отображение = ОтображениеТаблицы.Список;
Таблица.ЧередованиеЦветовСтрок = Истина;
Таблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
Таблица.КонтекстноеМеню.Доступность = Ложь;
	Для Каждого Колонка Из ТЗ.Колонки Цикл
    НовыйЭлемент = Элементы.Добавить("Номенклатура_" + Колонка.Имя, Тип("ПолеФормы"), Таблица);
		Если Колонка.Имя = "Пометка" Тогда
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		ИначеЕсли Колонка.Имя = "Статус" Тогда
		НовыйЭлемент.ТолькоПросмотр = Истина;
		ИначеЕсли Колонка.Имя = "Номенклатура" Тогда
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.КнопкаВыпадающегоСписка = Ложь;
		НовыйЭлемент.КнопкаВыбора = Ложь;
		НовыйЭлемент.КнопкаОчистки = Ложь;
		НовыйЭлемент.КнопкаРегулирования = Ложь;
		НовыйЭлемент.КнопкаОткрытия = Истина;
		НовыйЭлемент.КнопкаСоздания = Ложь;	
		НовыйЭлемент.БыстрыйВыбор = Ложь;
		НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;	
		Иначе	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;   
    НовыйЭлемент.ПутьКДанным = "Номенклатура." + Колонка.Имя;
	КонецЦикла;
//переносим таблицу значений на форму 
ЗначениеВРеквизитФормы(ТЗ,"Номенклатура");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКанбаныПоПерспективномуПлану(Команда)
ПолучитьКанбаныПоПерспективномуПлануНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВнестиКоличествоЯчеекНаСервере()
ТЗ = РеквизитФормыВЗначение("Номенклатура");
	Для каждого ТЧ Из ТЗ Цикл
		Если ТЧ.Пометка Тогда
		ТЧ.КолЯчеекРасч = КоличествоЯчеек;
		КонецЕсли;	
	КонецЦикла;
ЗначениеВРеквизитФормы(ТЗ,"Номенклатура");
КонецПроцедуры 

&НаКлиенте
Процедура ВнестиКоличествоЯчеек(Команда)
ВнестиКоличествоЯчеекНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ВнестиКоличествоОборотовНаСервере()
ТЗ = РеквизитФормыВЗначение("Номенклатура");
	Для каждого ТЧ Из ТЗ Цикл
		Если ТЧ.Пометка Тогда
		ТЧ.КолОборотов = КоличествоОборотов;
		КонецЕсли;	
	КонецЦикла;
ЗначениеВРеквизитФормы(ТЗ,"Номенклатура");
КонецПроцедуры

&НаКлиенте
Процедура ВнестиКоличествоОборотов(Команда)
ВнестиКоличествоОборотовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьПроцентНаСервере()
ТЗ = РеквизитФормыВЗначение("Номенклатура");
	Для каждого ТЧ Из ТЗ Цикл
		Если ТЧ.Пометка Тогда
		ТЧ.КолВЯчейкеРасч = ТЧ.КолВЯчейкеРасч + ТЧ.КолВЯчейкеРасч*ПроцентКоличества/100;
		КонецЕсли;	
	КонецЦикла;
ЗначениеВРеквизитФормы(ТЗ,"Номенклатура");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПроцент(Команда)
ДобавитьПроцентНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВычестьПроцентНаСервере()
ТЗ = РеквизитФормыВЗначение("Номенклатура");
	Для каждого ТЧ Из ТЗ Цикл
		Если ТЧ.Пометка Тогда
		ТЧ.КолВЯчейкеРасч = ТЧ.КолВЯчейкеРасч - ТЧ.КолВЯчейкеРасч*ПроцентКоличества/100;
		КонецЕсли;	
	КонецЦикла;
ЗначениеВРеквизитФормы(ТЗ,"Номенклатура");
КонецПроцедуры

&НаКлиенте
Процедура ВычестьПроцент(Команда)
ВычестьПроцентНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьТочкуЗаказаНаСервере()
СписокДат = Новый СписокЗначений;

ТекДата = Объект.Период.ДатаНачала;
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		Если День(ТекДата) = 1 Тогда
		СписокДат.Добавить(ТекДата);	
		КонецЕсли;			
	ТекДата = ТекДата + 86400;
	КонецЦикла;
КолДнейСреднее = КалендарныеГрафики.ПолучитьРазностьДатПоКалендарю(Константы.ОсновнойПроизводственныйКалендарь.Получить(),Объект.Период.ДатаНачала,Объект.Период.ДатаОкончания)/СписокДат.Количество();
ТЗ = РеквизитФормыВЗначение("Номенклатура");
	Для каждого ТЧ Из ТЗ Цикл
		Если ТЧ.Пометка Тогда
		КоличествоКанбана = 0;
			Для к = 1 По СписокДат.Количество() Цикл
			КоличествоКанбана = КоличествоКанбана + ТЧ["Д"+к];		
			КонецЦикла;
		КолВКанбанеРасч = КоличествоКанбана/СписокДат.Количество();
		ТЧ.ТочкаЗаказаРасч = Окр(КолВКанбанеРасч/КолДнейСреднее*ЧислоДней,0,РежимОкругления.Окр15как20); 
		КонецЕсли;	
	КонецЦикла;
ЗначениеВРеквизитФормы(ТЗ,"Номенклатура");
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьТочкуЗаказа(Команда)
РассчитатьТочкуЗаказаНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьКоличествоПФВЯчейкеНаСервере()
СписокДат = Новый СписокЗначений;

ТекДата = Объект.Период.ДатаНачала;
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		Если День(ТекДата) = 1 Тогда
		СписокДат.Добавить(ТекДата);	
		КонецЕсли;			
	ТекДата = ТекДата + 86400;
	КонецЦикла;
ТЗ = РеквизитФормыВЗначение("Номенклатура");
	Для каждого ТЧ Из ТЗ Цикл
		Если ТЧ.Пометка Тогда
			Если (ТЧ.КолОборотов*ТЧ.КолЯчеекРасч) = 0 Тогда
			ТЧ.КолВЯчейкеРасч = 0;
			Продолжить;	
			КонецЕсли;
		КолПФ = 0;
			Для к = 1 по СписокДат.Количество() Цикл 
			КолПФ = КолПФ + ТЧ["Д"+к];
			КонецЦикла;	 
		ТЧ.КолВЯчейкеРасч = Окр(КолПФ/СписокДат.Количество()/(ТЧ.КолОборотов*ТЧ.КолЯчеекРасч),0,РежимОкругления.Окр15как20);
		КонецЕсли;	
	КонецЦикла;
ЗначениеВРеквизитФормы(ТЗ,"Номенклатура");
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличествоПФВЯчейке(Команда)
РассчитатьКоличествоПФВЯчейкеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьПараметрыЯчеекКанбановНаСервере()
МестоХранения = СписокЛинеек[0].Значение.МестоХраненияКанбанов;
ТЗ = РеквизитФормыВЗначение("Номенклатура");
	Для каждого ТЧ Из ТЗ Цикл
		Если ТЧ.Пометка Тогда
		ЯК = ОбщийМодульРаботаСРегистрами.ПолучитьЯчейкуКомплектацииПоМестуХранения(МестоХранения,ТЧ.Канбан);
			Если (ЯК.КоличествоЯчеек <> ТЧ.КолЯчеекРасч)или(ЯК.КоличествоВЯчейке <> ТЧ.КолВЯчейкеРасч)или(ЯК.ТочкаЗаказа <> ТЧ.ТочкаЗаказаРасч) Тогда
			ЯК = РегистрыСведений.ЯчейкиКомплектации.СоздатьМенеджерЗаписи();
			ЯК.Период = ТекущаяДата();
			ЯК.МестоХранения = МестоХранения; 
			ЯК.МПЗ = ТЧ.Канбан;
			ЯК.КоличествоЯчеек = ТЧ.КолЯчеекРасч;
			ЯК.КоличествоВЯчейке = ТЧ.КолВЯчейкеРасч;
			ЯК.ТочкаЗаказа = ТЧ.ТочкаЗаказаРасч;
			ЯК.Записать(Истина);
			КонецЕсли;		
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметрыЯчеекКанбанов(Команда)
ИзменитьПараметрыЯчеекКанбановНаСервере();
КонецПроцедуры

&НаСервере
Функция ПечатьРасчётаКанбановНаСервере()
ТабДок = Новый ТабличныйДокумент;
СписокДат = Новый СписокЗначений;

ТекДата = Объект.Период.ДатаНачала;
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		Если День(ТекДата) = 1 Тогда
		СписокДат.Добавить(ТекДата);	
		КонецЕсли;			
	ТекДата = ТекДата + 86400;
	КонецЦикла;

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапкаОбщая = Макет.ПолучитьОбласть("Шапка|Общая");
ОблКанбанОбщая = Макет.ПолучитьОбласть("Канбан|Общая");
ОблКонецОбщая = Макет.ПолучитьОбласть("Конец|Общая");
ОблШапкаМесяц = Макет.ПолучитьОбласть("Шапка|Месяц");
ОблКанбанМесяц = Макет.ПолучитьОбласть("Канбан|Месяц");
ОблКонецМесяц = Макет.ПолучитьОбласть("Конец|Месяц");
ОблШапкаРасчёт = Макет.ПолучитьОбласть("Шапка|Расчёт");
ОблКанбанРасчёт = Макет.ПолучитьОбласть("Канбан|Расчёт");
ОблКонецРасчёт = Макет.ПолучитьОбласть("Конец|Расчёт");

ОблШапкаОбщая.Параметры.ДатаНач = Формат(Объект.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапкаОбщая.Параметры.ДатаКон = Формат(Объект.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапкаОбщая.Параметры.СписокЛинеек = СписокЛинеек; 
ТабДок.Вывести(ОблШапкаОбщая);
	Для каждого Стр Из СписокДат Цикл	
	ОблШапкаМесяц.Параметры.Месяц = Формат(Стр.Значение,"ДФ=MM.yy");
	ТабДок.Присоединить(ОблШапкаМесяц);
	КонецЦикла; 
ТабДок.Присоединить(ОблШапкаРасчёт);
ТЗ = РеквизитФормыВЗначение("Номенклатура");
НомСтр = 1;
	Для каждого ТЧ Из ТЗ Цикл
		Если ТЧ.Пометка Тогда
		ОблКанбанОбщая.Параметры.НомСтр = НомСтр;
		ОблКанбанОбщая.Параметры.Статус = ПолучитьСтатус(ТЧ.Канбан);
		ОблКанбанОбщая.Параметры.Наименование = СокрЛП(ТЧ.Канбан.Наименование);
		ОблКанбанОбщая.Параметры.Канбан = ТЧ.Канбан;
		ОблКанбанОбщая.Параметры.ТочкаЗаказа = ТЧ.ТочкаЗаказа;
		ОблКанбанОбщая.Параметры.КолЯчеек = ТЧ.КолЯчеек;
		ОблКанбанОбщая.Параметры.КолВЯчейке = ТЧ.КолВЯчейке;
		ТабДок.Вывести(ОблКанбанОбщая);
        	Для к = 1 По СписокДат.Количество() Цикл			
			ОблКанбанМесяц.Параметры.Кол = ТЧ["Д"+к];
			ТабДок.Присоединить(ОблКанбанМесяц);
			КонецЦикла;
		ОблКанбанРасчёт.Параметры.КолОборотов = ТЧ.КолОборотов; 
		ОблКанбанРасчёт.Параметры.ТочкаЗаказаРасч = ТЧ.ТочкаЗаказаРасч;
		ОблКанбанРасчёт.Параметры.КолЯчеекРасч = ТЧ.КолЯчеекРасч;
		ОблКанбанРасчёт.Параметры.КолВЯчейкеРасч = ТЧ.КолВЯчейкеРасч;
		ТабДок.Присоединить(ОблКанбанРасчёт);
		КонецЕсли;
	НомСтр = НомСтр + 1;	
	КонецЦикла;
ТабДок.Вывести(ОблКонецОбщая);
	Для каждого Стр Из СписокДат Цикл	
	ТабДок.Присоединить(ОблКонецМесяц);
	КонецЦикла; 
ТабДок.Присоединить(ОблКонецРасчёт);
ТабДок.ФиксацияСверху = 3;
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура ПечатьРасчётаКанбанов(Команда)
ТД = ПечатьРасчётаКанбановНаСервере();
ТД.Показать("Расчёт ячеек канбанов.");
КонецПроцедуры

&НаСервере
Функция ПечатьQRКодовНаСервере(ВыбСклад,НомерШаблона)
ТабДок = Новый ТабличныйДокумент;

флЧетный = Ложь;
barcode = ПолучитьCOMОбъект("","STROKESCRIBE.StrokeScribeClass.1");
barcode.Alphabet=25; //QRCODE
	Если НомерШаблона = 1 Тогда
	Макет = ПолучитьОбщийМакет("QRКодКанбан");
	ИначеЕсли НомерШаблона = 2 Тогда	
	Макет = ПолучитьОбщийМакет("QRКодКанбан6");
	КонецЕсли;
ОблQRКод = Макет.ПолучитьОбласть("QRКод|Секция");
ТЗ = РеквизитФормыВЗначение("Номенклатура");
	Для каждого ТЧ Из ТЗ Цикл
		Если ТЧ.Пометка Тогда
			Для к = 1 По ТЧ.КолЯчеек Цикл
			QRCode = "3;"+ЗначениеВСтрокуВнутр(СписокЛинеек[0].Значение.МестоХраненияКанбанов)+";"+СокрЛП(ВыбСклад.Код)+";"+ЗначениеВСтрокуВнутр(ТЧ.Канбан)+";"+СтрЗаменить(Строка(ТЧ.КолВЯчейке),Символы.НПП,"")+";"+к;
			ИмяФайла=ПолучитьИмяВременногоФайла("wmf");
			barcode.Text=QRCode;
			barcode.UTF8=1;
			barcode.QrECL=2;
			код=barcode.SavePicture(ИмяФайла,7,100,100);          
				Если код <> 0 Тогда //Проверка результата генерации штрихкода
				Сообщить(строка(код) + " - " + barcode.ErrorDescription);
				Возврат(ТабДок);
				КонецЕсли;
			рис=ОблQRКод.Рисунки.QRCode;
			рис.РазмерКартинки=РазмерКартинки.Пропорционально;
			рис.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
			рис.Картинка = Новый Картинка(ИмяФайла);
			ОблQRКод.Параметры.СкладПолучатель = СокрЛП(СписокЛинеек[0].Значение.МестоХраненияКанбанов.Наименование);
			ОблQRКод.Параметры.Наименование = СокрЛП(ТЧ.Канбан.Наименование);
			ОблQRКод.Параметры.Количество = ТЧ.КолВЯчейке;
			ОблQRКод.Параметры.ЕдИзм = ТЧ.Канбан.ЕдиницаИзмерения;
			ОблQRКод.Параметры.СкладОтправитель = СокрЛП(ВыбСклад.Наименование);
				Если НомерШаблона = 1 Тогда
				ОблQRКод.Параметры.НомерЯчейки = к;
				Стеллаж = "";
				Полка = "";
				ЯХ = РегистрыСведений.ЯчейкиХранения.Выбрать(Новый Структура("МПЗ",ТЧ.Канбан));
					Пока ЯХ.Следующий() Цикл
						Если ЯХ.МестоХранения = ВыбСклад Тогда
						Стеллаж = ЯХ.Стеллаж;
						Полка = ЯХ.Полка;
						КонецЕсли; 	
					КонецЦикла;
				ОблQRКод.Параметры.Стеллаж = Стеллаж;
				ОблQRКод.Параметры.Полка = Полка;
				Иначе
				ОблQRКод.Параметры.ТочкаЗаказа = ТЧ.ТочкаЗаказа;
				КонецЕсли;
			ТабДок.Вывести(ОблQRКод);
		    ТабДок.Присоединить(ОблQRКод);
			УдалитьФайлы(ИмяФайла);
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла; 
ТабДок.РазмерСтраницы = "A4";
ТабДок.ПолеСлева = 0;
ТабДок.ПолеСверху = 7;
ТабДок.ПолеСнизу = 0;
ТабДок.ПолеСправа = 0;
ТабДок.РазмерКолонтитулаСверху = 0;
ТабДок.РазмерКолонтитулаСнизу = 0;
ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура ПечатьQRКодов(Команда)
ВыбСклад = Неопределено;
	Если ВвестиЗначение(ВыбСклад,"Выберите склад-отправитель",Новый ОписаниеТипов("СправочникСсылка.МестаХранения")) Тогда
	ТабДок = ПечатьQRКодовНаСервере(ВыбСклад,1);
	ТабДок.Показать("QR-коды канбанов");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКарточкиЗаказов(Команда)
ВыбСклад = Неопределено;
	Если ВвестиЗначение(ВыбСклад,"Выберите склад-отправитель",Новый ОписаниеТипов("СправочникСсылка.МестаХранения")) Тогда
	ТабДок = ПечатьQRКодовНаСервере(ВыбСклад,2);
	ТабДок.Показать("Карточки заказов");
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ВыбратьВсеНаСервере()
ТЗ = РеквизитФормыВЗначение("Номенклатура");
	Для каждого ТЧ Из ТЗ Цикл
	ТЧ.Пометка = Истина;	
	КонецЦикла;
ЗначениеВРеквизитФормы(ТЗ,"Номенклатура");
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
ВыбратьВсеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтменитьВсеНаСервере()
ТЗ = РеквизитФормыВЗначение("Номенклатура");
	Для каждого ТЧ Из ТЗ Цикл
	ТЧ.Пометка = Ложь;	
	КонецЦикла;
ЗначениеВРеквизитФормы(ТЗ,"Номенклатура");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
ОтменитьВсеНаСервере();
КонецПроцедуры
