
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Объект.ПоступлениеМПЗ = ЭтаФорма.Параметры.ПоступлениеМПЗ; 
КонецПроцедуры

&НаСервере
Процедура ПолучитьНоменклатуруНаСервере()
Запрос = Новый Запрос;

ТаблицаНоменклатуры.Очистить();
	Для каждого ТЧ Из Объект.ПоступлениеМПЗ.ТабличнаяЧасть Цикл
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НормыРасходов.Владелец КАК Владелец
		|ИЗ
		|	РегистрСведений.НормыРасходов.СрезПоследних(&НаДату, ) КАК НормыРасходовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыРасходов КАК НормыРасходов
		|		ПО НормыРасходовСрезПоследних.НормаРасходов = НормыРасходов.Ссылка
		|ГДЕ
		|	НормыРасходов.ПометкаУдаления = ЛОЖЬ
		|	И НормыРасходов.Владелец.Родитель = &ВладелецРодитель
		|	И НормыРасходов.Элемент = &Элемент
		|	И НормыРасходовСрезПоследних.Норма > 0";
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("ВладелецРодитель", Объект.ГруппаНоменклатуры);
	Запрос.УстановитьПараметр("Элемент", ТЧ.МПЗ);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаНР = РезультатЗапроса.Выбрать();
		Пока ВыборкаНР.Следующий() Цикл
		Выборка = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("Номенклатура",ВыборкаНР.Владелец));
			Если Выборка.Количество() = 0 Тогда
			ТЧ = ТаблицаНоменклатуры.Добавить();
			ТЧ.Пометка = Истина;
			ТЧ.Номенклатура = ВыборкаНР.Владелец;
			ТЧ.Количество = 1;
			КонецЕсли; 
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНоменклатуру(Команда)
	Если Не Объект.ГруппаНоменклатуры.Пустая() Тогда
	ПолучитьНоменклатуруНаСервере();
	Иначе
	Сообщить("Выберите группу номенклатуры для поиска!");
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция БарКодСоздан(Изделие,НомерИзделия)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	БарКоды.ПЗ КАК ПЗ
	|ИЗ
	|	РегистрСведений.БарКоды КАК БарКоды
	|ГДЕ
	|	БарКоды.ПЗ = &Документ
	|	И БарКоды.Изделие = &Изделие
	|	И БарКоды.НомерИзделия = &НомерИзделия";
Запрос.УстановитьПараметр("Документ", Объект.ПоступлениеМПЗ);
Запрос.УстановитьПараметр("Изделие", Изделие);
Запрос.УстановитьПараметр("НомерИзделия", НомерИзделия);
РезультатЗапроса = Запрос.Выполнить();
Возврат(Не РезультатЗапроса.Пустой());
КонецФункции 

&НаСервере
Процедура СоздатьБарКодыНаСервере()
	Если Не Объект.Подразделение.Пустая() Тогда
	Н = Справочники.НумераторБарКодов.НайтиПоРеквизиту("Подразделение",Объект.Подразделение);
		Если Не Н.Пустая() Тогда
		Период = ТекущаяДата();
			Если КонецДня(Н.ДатаСброса) < КонецДня(ТекущаяДата()) Тогда
			Нумератор = Н.ПолучитьОбъект();
			Нумератор.СледующийНомер = 1;
			Нумератор.ДатаСброса = КонецГода(ТекущаяДата());
			Нумератор.Записать();					
			КонецЕсли;
				Для каждого ТЧ Из ТаблицаНоменклатуры Цикл	
					Если ТЧ.Пометка Тогда 
					Изделие = ТЧ.Номенклатура;
						Для к = 1 По ТЧ.Количество Цикл
							Если Не Изделие.Товар.Пустая() Тогда
								Если Не БарКодСоздан(Изделие,к) Тогда
								БарКод = РегистрыСведений.БарКоды.СоздатьМенеджерЗаписи();
								БарКод.Период = Период;
								БарКод.ПЗ = Объект.ПоступлениеМПЗ;
								БарКод.Товар = Изделие.Товар;
								БарКод.Изделие = Изделие;
								БарКод.НомерИзделия = к;
								БарКод.БарКод = ОбщийМодульВызовСервера.ПолучитьАртикулПоКодуТовара(Изделие.Товар.Код)+Сред(Год(Период),4)+Формат(Месяц(Период),"ЧЦ=2; ЧВН=")+Объект.Подразделение.Код+Формат(Н.СледующийНомер,"ЧЦ=6; ЧВН=; ЧГ=");
								БарКод.Записать(Ложь);
								Нумератор = Н.ПолучитьОбъект();
								Нумератор.СледующийНомер = Нумератор.СледующийНомер+1;
								Нумератор.Записать();
								Иначе
								Сообщить(СокрЛП(Изделие.Наименование)+" - бар-код уже создан!");
								КонецЕсли;
							Иначе
							Сообщить(СокрЛП(Изделие.Наименование)+" - изделию не присвоен Товар!");
							КонецЕсли;												
						КонецЦикла;
					КонецЕсли; 
				КонецЦикла;
		Иначе
		Сообщить("Не создан нумератор бар-кодов для подразделения!");
		КонецЕсли;
	Иначе
	Сообщить("Выберите подразделение!");
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБарКоды(Команда)
СоздатьБарКодыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
ОткрытьФорму("Обработка.СозданныеБарКоды.Форма.Форма",Новый Структура("ПоступлениеМПЗ,КоличествоКопий",Объект.ПоступлениеМПЗ,2));
КонецПроцедуры
