
&НаСервере
Функция ПолучитьСписокМПЗ()
СписокМПЗ = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Номенклатура.Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&Ссылка)
	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
Запрос.УстановитьПараметр("Ссылка", Номенклатура);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокМПЗ.Добавить(ВыборкаДетальныеЗаписи.Ссылка,СокрЛП(ВыборкаДетальныеЗаписи.Наименование));
	КонецЦикла; 
Возврат СписокМПЗ;
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыИзделийУЛИШИ(Номен,ВидТарыН,ПрессформаН,ЦветН,БазоваяОтливка)
ПараметрыИзделийУЛИШИ = РегистрыСведений.ПараметрыИзделийУЛИШИ.СоздатьМенеджерЗаписи();
ПараметрыИзделийУЛИШИ.Номенклатура = Номен;
	Если ЗначениеЗаполнено(ВидТарыН) Тогда
	ВидТары = Справочники.ВидыТары.НайтиПоНаименованию(ВидТарыН,Истина);
		Если ВидТары.Пустая() Тогда
		ВидТары = Справочники.ВидыТары.СоздатьЭлемент();
		ВидТары.Наименование = ВидТарыН;
	    ВидТары.Записать();
		КонецЕсли;	
	ПараметрыИзделийУЛИШИ.ВидТары = ВидТары.Ссылка;
	КонецЕсли;
		Если ЗначениеЗаполнено(ПрессформаН) Тогда
		ГруппаТО = Справочники.ТехОснастка.НайтиПоНаименованию("Прессформы З.Л.О.",Истина);
		Прессформа = Справочники.ТехОснастка.НайтиПоНаименованию(ПрессформаН,Истина,ГруппаТО);
			Если Прессформа.Пустая() Тогда
			Прессформа = Справочники.ТехОснастка.СоздатьЭлемент();
			Прессформа.Родитель = ГруппаТО;
			Прессформа.Наименование = ПрессформаН;
		    Прессформа.Записать();
			КонецЕсли;	
		ПараметрыИзделийУЛИШИ.Прессформа = Прессформа.Ссылка;
		КонецЕсли;
			Если ЗначениеЗаполнено(ЦветН) Тогда
			Цвет = Справочники.ЦветаИзделий.НайтиПоНаименованию(ЦветН,Истина);
				Если Цвет.Пустая() Тогда
				Цвет = Справочники.ЦветаИзделий.СоздатьЭлемент();
				Цвет.Наименование = ЦветН;
			    Цвет.Записать();
				КонецЕсли;	
			ПараметрыИзделийУЛИШИ.Цвет = Цвет.Ссылка;
			КонецЕсли;
				Если ЗначениеЗаполнено(БазоваяОтливка) Тогда	
				ПараметрыИзделийУЛИШИ.БазоваяОтливка = БазоваяОтливка;
				КонецЕсли;
ПараметрыИзделийУЛИШИ.Записать(Истина); 
КонецПроцедуры

&НаКлиенте
Процедура Соединиться(Команда)
НастройкиОбменаДанными = ОбщийМодульСинхронизации.ПолучитьНастройкиОбменаДанными("Производство");
V7 = ОбщийМодульКлиент.ПодключитьсяК1С77(НастройкиОбменаДанными.ПутьКБазеДанных,Объект.ИмяПользователя,Объект.Пароль);
	Если V7 = Неопределено Тогда
	Возврат;	
	КонецЕсли;
Номен_v7 = V7.CreateObject("Справочник.Номенклатура");
Парам_v7 = V7.CreateObject("Справочник.ПараметрыУЛИШИ");

СписокМПЗ = ПолучитьСписокМПЗ();
к = 0;
	Для каждого Стр Из СписокМПЗ Цикл
	Состояние("Обработка...",к*100/СписокМПЗ.Количество(),"Перенос параметров "+Стр.Представление);
		Если Номен_v7.НайтиПоНаименованию(Стр.Представление,0,1) = 1 Тогда
		Парам_v7.ИспользоватьВладельца(Номен_v7.ТекущийЭлемент());
		Парам_v7.ВыбратьЭлементы(1);
			Пока Парам_v7.ПолучитьЭлемент() = 1 Цикл
				Если V7.ПустоеЗначение(Парам_v7.ВидТары) = 0 Тогда
				ВидТары = СокрЛП(Парам_v7.ВидТары.Наименование);
				Иначе	
				ВидТары = "";
				КонецЕсли;
					Если V7.ПустоеЗначение(Парам_v7.Прессформа) = 0 Тогда
					Прессформа = СокрЛП(Парам_v7.Прессформа.Наименование);
					Иначе	
					Прессформа = "";
					КонецЕсли; 
						Если V7.ПустоеЗначение(Парам_v7.Цвет) = 0 Тогда
						Цвет = СокрЛП(Парам_v7.Цвет.Наименование);
						Иначе	
						Цвет = "";
						КонецЕсли;
			ЗаполнитьПараметрыИзделийУЛИШИ(Стр.Значение,ВидТары,Прессформа,Цвет,СокрЛП(Парам_v7.БазоваяОтливка));
			КонецЦикла; 
		Иначе
		Сообщить(Стр.Представление + " - не найдена в базе 1С7!");	
		КонецЕсли;
	к = к + 1;		
	КонецЦикла; 
КонецПроцедуры
