
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаВыпуска = ТекущаяДата(); 
	Если Параметры.ИзменитьПоМаске Тогда
	Наименование = СокрЛП(Параметры.ПЗ.Изделие.Наименование);
		Если Найти(Наименование,"ТРМ138В") > 0 Тогда
		ДатаВыпуска = Дата(2022,5,16,0,0,0);
	//	Если Найти(Наименование,"ИНС-Ф1") > 0 Тогда
	//	ДатаВыпуска = Дата(2021,8,27,0,0,0);
	//	ИначеЕсли Найти(Наименование,"ИМС-Ф1") > 0 Тогда
	//	ДатаВыпуска = Дата(2021,8,27,0,0,0);
	//	ИначеЕсли Найти(Наименование,"ИТС-Ф1") > 0 Тогда
	//	ДатаВыпуска = Дата(2021,8,27,0,0,0);
	//	ИначеЕсли Найти(Наименование,"КМС-Ф1") > 0 Тогда
	//	ДатаВыпуска = Дата(2021,8,27,0,0,0);	
		КонецЕсли;	
	КонецЕсли;
ДатаПоверки = ДатаВыпуска;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОК(Команда)
ЭтаФорма.Закрыть(Новый Структура("ДатаВыпуска,ДатаПоверки",ДатаВыпуска,ДатаПоверки));
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтмена(Команда)
ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры
