
&НаСервере
Функция ПолучитьМТК(Изделие)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутнаяКарта.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ГДЕ
	|	МаршрутнаяКарта.ДокументОснование = &ДокументОснование
	|	И МаршрутнаяКарта.Номенклатура = &Номенклатура";
Запрос.УстановитьПараметр("ДокументОснование", Параметры.Документ);
Запрос.УстановитьПараметр("Номенклатура", Изделие);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
Возврат(Документы.МаршрутнаяКарта.ПустаяСсылка());
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого ТЧ Из Параметры.Документ.ТабличнаяЧасть Цикл	
		Если ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты Тогда	
		ТЧ_ТИ = ТаблицаИзделий.Добавить();
		ТЧ_ТИ.Изделие = ТЧ.МПЗ;
		ТЧ_ТИ.МТК = ПолучитьМТК(ТЧ.МПЗ);
		ТЧ_ТИ.Количество = ТЧ.Количество;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Функция СоздатьМТКНаСервере()
СтдКомм = Справочники.СтандартныеКомментарии.НайтиПоНаименованию("Полуфабрикаты для СЦ",Истина);
	Попытка
		Для каждого ТЧ Из ТаблицаИзделий Цикл	
			Если Не ЗначениеЗаполнено(ТЧ.МТК) Тогда	
				Если ЗначениеЗаполнено(ТЧ.Линейка) Тогда
					Если ТЧ.Линейка.ВидЛинейки = Перечисления.ВидыЛинеек.Канбан Тогда
					ТЧ.МТК = ОбщийМодульСозданиеДокументов.СоздатьМТККанбан(ТЧ.Линейка,Константы.МестоХраненияДляСервисЦентров.Получить(),0,ТЧ.Изделие,ТЧ.Количество,Ложь,Параметры.Документ,,,,Истина,СтдКомм);
					Иначе	
					ТЧ.МТК = ОбщийМодульСозданиеДокументов.СоздатьМТК(ТЧ.Линейка,ТЧ.Изделие,ТЧ.Количество,СтдКомм,Справочники.Проекты.ПустаяСсылка(),Истина,Ложь,,,,Параметры.Документ);
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;
	Исключение
	Сообщить(ОписаниеОшибки());
	Возврат(Ложь);
	КонецПопытки;
Возврат(Истина); 
КонецФункции

&НаКлиенте
Процедура СоздатьМТК(Команда)
	Если СоздатьМТКНаСервере() Тогда
	ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
ЭтаФорма.Закрыть();
КонецПроцедуры
