
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ДатаВыпуска = ТекущаяДата(); 
	Если Параметры.ИзменитьПоМаске Тогда
	Наименование = СокрЛП(Параметры.ПЗ.Изделие.Наименование);
		Если Найти(Наименование,"НПТ-3.00.1.2.ЕХ") > 0 Тогда
		ДатаВыпуска = Дата(2021,11,9,0,0,0);	
		КонецЕсли;	
	КонецЕсли;
ДатаПоверки = ДатаВыпуска;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОК(Команда)
ЭтаФорма.Закрыть(Новый Структура("ДатаВыпуска,ДатаПоверки",ДатаВыпуска,ДатаПоверки));
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтмена(Команда)
ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры
