
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КлючНазначенияИспользования = "СохранениеЭлементаСправочника";
ИмяНастройки = "["+ТипЗнч(Параметры.ЭлементСправочника)+"]"+Символы.Таб+СокрЛП(Параметры.ЭлементСправочника.Наименование);
СписокНастроек = ХранилищеОбщихНастроек.ПолучитьСписок(КлючНазначенияИспользования, ИмяПользователя());
КонецПроцедуры

&НаСервере
Процедура ДобавитьНаСервере()
Стр = СписокНастроек.НайтиПоЗначению(ИмяНастройки);
	Если Стр = Неопределено Тогда
	ХранилищеОбщихНастроек.Сохранить(КлючНазначенияИспользования, ИмяНастройки, Параметры.ЭлементСправочника, ИмяПользователя());
	СписокНастроек.Добавить(ИмяНастройки);
	Иначе
	Сообщить("Элемент уже сохранён!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ДобавитьНаСервере();	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ОКНаСервере(ВыбИмяНастройки)
Возврат(ХранилищеОбщихНастроек.Загрузить(КлючНазначенияИспользования, ВыбИмяНастройки ,ИмяПользователя()));
КонецФункции

&НаСервере
Функция ПолучитьИмяСправочника(ЭлементСправочника)
ВыбСиноним = Строка(ТипЗнч(ЭлементСправочника));
	Для каждого Эл Из Метаданные.Справочники Цикл
		Если Эл.синоним = ВыбСиноним Тогда 
		Возврат(Эл.Имя);	
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
ЭлементСправочника = ОКНаСервере(Элементы.СписокНастроек.ТекущиеДанные.Значение);
ЭтаФорма.ВладелецФормы.Элементы.Список.ТекущаяСтрока = ЭлементСправочника;
ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере(ВыбИмяНастройки)
ХранилищеОбщихНастроек.Удалить(КлючНазначенияИспользования, ВыбИмяНастройки, ИмяПользователя());
СписокНастроек = ХранилищеОбщихНастроек.ПолучитьСписок(КлючНазначенияИспользования, ИмяПользователя());
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	Если Элементы.СписокНастроек.ТекущаяСтрока <> Неопределено Тогда
	УдалитьНаСервере(Элементы.СписокНастроек.ТекущиеДанные.Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ОК(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ОчиститьСписокНаСервере()
	Для каждого Стр Из СписокНастроек Цикл	
	ХранилищеОбщихНастроек.Удалить(КлючНазначенияИспользования, Стр.Значение, ИмяПользователя());	
	КонецЦикла;
СписокНастроек.Очистить(); 
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписок(Команда)
ОчиститьСписокНаСервере();
КонецПроцедуры
