
Процедура ОбработкаПроведения(Отказ, Режим)
// регистр ЗаказыПоставщикам Приход
Движения.ЗаказыПоставщикам.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
	Движение = Движения.ЗаказыПоставщикам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = ТекСтрокаТабличнаяЧасть.ЗаказПоставщику.Договор;
	Движение.ДатаИсполнения = ТекСтрокаТабличнаяЧасть.ЗаказПоставщику.ДатаИсполнения;
	Движение.МПЗ = ТекСтрокаТабличнаяЧасть.МПЗ;
	Движение.Количество = ТекСтрокаТабличнаяЧасть.Количество;
	Движение.ЗаказПоставщику = ТекСтрокаТабличнаяЧасть.ЗаказПоставщику;
	КонецЦикла;
КонецПроцедуры
