
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Запись.АналогНормыРасходов.Пустая() Тогда
	Элементы.ЕдиницаИзмерения.Заголовок = Запись.АналогНормыРасходов.Элемент.ОсновнаяЕдиницаИзмерения; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормаРасходовПриИзменении(Элемент)
НормаРасходовПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НормаРасходовПриИзмененииНаСервере()
Элементы.ЕдиницаИзмерения.Заголовок = Запись.АналогНормыРасходов.Элемент.ОсновнаяЕдиницаИзмерения;	 
КонецПроцедуры