
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

Макет = Отчеты.ОтчетПоПроизводственнымЗаданиямРемонтника.ПолучитьМакет("Макет"); 
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблПЗ = Макет.ПолучитьОбласть("ПЗ");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	РемонтнаяКарта.Ссылка,
	|	РемонтнаяКарта.ДокументОснование,
	|	РемонтнаяКарта.Линейка,
	|	РемонтнаяКарта.БарКод,
	|	РемонтнаяКарта.РабочееМесто,
	|	РемонтнаяКарта.ДатаНачала,
	|	РемонтнаяКарта.ДатаОтложен,
	|	РемонтнаяКарта.ДатаОкончания,
	|	РемонтнаяКарта.Автор,
	|	РемонтнаяКарта.ВозвратнаяТара,
	|	РемонтнаяКарта.Проведен
	|ИЗ
	|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
	|ГДЕ
	|	РемонтнаяКарта.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И РемонтнаяКарта.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	Если СтатусыРемонта = 2 Тогда
	Запрос.Текст = Запрос.Текст + " И РемонтнаяКарта.ДатаОкончания = ДАТАВРЕМЯ(1,1,1,0,0,0)";
	ИначеЕсли СтатусыРемонта = 3 Тогда
	Запрос.Текст = Запрос.Текст + " И РемонтнаяКарта.ДатаОкончания <> ДАТАВРЕМЯ(1,1,1,0,0,0)";
	КонецЕсли;
		Если СписокРМ.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И РемонтнаяКарта.РабочееМесто В ИЕРАРХИИ(&СписокРМ)";
		Запрос.УстановитьПараметр("СписокРМ",СписокРМ);
		КонецЕсли;
			Если СписокВидовРемонта.Количество() > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И РемонтнаяКарта.ВидРемонта В(&СписокВидовРемонта)";
			Запрос.УстановитьПараметр("СписокВидовРемонта",СписокВидовРемонта);
			КонецЕсли; 
				Если Не Исполнитель.Пустая() Тогда
				Запрос.Текст = Запрос.Текст + " И РемонтнаяКарта.Автор = &Исполнитель";
				Запрос.УстановитьПараметр("Исполнитель",Исполнитель);
				КонецЕсли; 
					Если СортироватьПо = 1 Тогда
					Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО РемонтнаяКарта.ДокументОснование.НомерОчереди";
					Иначе
					Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО РемонтнаяКарта.Дата";
					КонецЕсли;  	
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
НомСтр = 0;
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	НомСтр = НомСтр + 1;
	ОблПЗ.Параметры.НомСтр = НомСтр;
	ОблПЗ.Параметры.Линейка = Выборка.Линейка;
	ОблПЗ.Параметры.НомерПЗ = Выборка.ДокументОснование.Номер;
	ОблПЗ.Параметры.ПЗ = Выборка.ДокументОснование;
	ОблПЗ.Параметры.НомерОчереди = ?(ТипЗнч(Выборка.ДокументОснование) = Тип("ДокументСсылка.ПроизводственноеЗадание"),Выборка.ДокументОснование.НомерОчереди,"");
	ОблПЗ.Параметры.ВозвратнаяТара = Выборка.ВозвратнаяТара;
	ОблПЗ.Параметры.БарКод = Выборка.БарКод;
	ОблПЗ.Параметры.РабочееМесто = Выборка.РабочееМесто;
	ОблПЗ.Параметры.ДатаНачала = Выборка.ДатаНачала;
	ОблПЗ.Параметры.ДатаОкончания = Выборка.ДатаОкончания;
		Если ЗначениеЗаполнено(Выборка.ДатаОтложен) Тогда
		ОблПЗ.Параметры.ДатаНачалаОстановки = Выборка.ДатаОтложен;
		ОблПЗ.Параметры.ДатаОкончанияОстановки = Выборка.ДатаОкончания;		
		Иначе
		ОблПЗ.Параметры.ДатаНачалаОстановки = Дата(1,1,1);
		ОблПЗ.Параметры.ДатаОкончанияОстановки = Дата(1,1,1);			
		КонецЕсли; 
	ОблПЗ.Параметры.Исполнитель = Выборка.Автор;
	ОблПЗ.Параметры.СтатусРемонта = Выборка.Проведен;
	ОблПЗ.Параметры.Ремонт = Выборка.Ссылка;
	ТабДок.Вывести(ОблПЗ);
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
СортироватьПо = 1;
СтатусыРемонта = 1;
КонецПроцедуры
