
&НаСервере
Процедура СформироватьНаСервере()
ТабДок = Новый ТабличныйДокумент;
Запрос = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблРабочееМесто = Макет.ПолучитьОбласть("РабочееМесто");
ОблТО = Макет.ПолучитьОбласть("ТО");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.НаДату = Формат(Отчет.НаДату,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.Линейка = Отчет.Линейка;
ТабДок.Вывести(ОблШапка);

Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеекТехОперации.Ссылка КАК Ссылка,
	|	РабочиеМестаЛинеекТехОперации.ТехОперация
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек.ТехОперации КАК РабочиеМестаЛинеекТехОперации
	|ГДЕ
	|	РабочиеМестаЛинеекТехОперации.Ссылка.Линейка = &Линейка
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочиеМестаЛинеекТехОперации.Ссылка.Код,
	|	РабочиеМестаЛинеекТехОперации.ТехОперация.Наименование
	|ИТОГИ ПО
	|	Ссылка";
Запрос.УстановитьПараметр("Линейка", Отчет.Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаРМ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРМ.Следующий() Цикл
	ОблРабочееМесто.Параметры.РабочееМесто = ВыборкаРМ.Ссылка;
	ТабДок.Вывести(ОблРабочееМесто);
	ТабДок.НачатьГруппуСтрок("РабочееМесто",Истина);
	ВыборкаДетальныеЗаписи = ВыборкаРМ.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ТехОперация.ЭтоГруппа Тогда			
			Выборка = Справочники.ТехОперации.ВыбратьИерархически(ВыборкаДетальныеЗаписи.ТехОперация);
				Пока Выборка.Следующий() Цикл
				НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("ТехОперация",Выборка.Ссылка));
				ОблТО.Параметры.ТО = Выборка.Ссылка;
				ОблТО.Параметры.НормаВремени = НормыТО.Норма;
				ОблТО.Параметры.Тариф = НормыТО.Стоимость;
				ТабДок.Вывести(ОблТО);				
				КонецЦикла;			
			Иначе
			НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("ТехОперация",ВыборкаДетальныеЗаписи.ТехОперация));	
			ОблТО.Параметры.ТО = ВыборкаДетальныеЗаписи.ТехОперация;
			ОблТО.Параметры.НормаВремени = НормыТО.Норма;
			ОблТО.Параметры.Тариф = НормыТО.Стоимость;
			ТабДок.Вывести(ОблТО);			
			КонецЕсли;
		КонецЦикла;
	ТабДок.ЗакончитьГруппуСтрок();
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Отчет.НаДату = ТекущаяДата();
	Если Параметры.Свойство("Линейка") Тогда
	Отчет.Линейка = Параметры.Линейка;
	СформироватьНаСервере();	
	КонецЕсли; 
КонецПроцедуры
