
&НаСервере
Процедура РаскрытьНаМПЗ(ТаблицаМПЗ,ТаблицаАналогов,ЭтапСпецификации,КолУзла)
ВыборкаНР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_М(ЭтапСпецификации,НаДату);
	Пока ВыборкаНР.Следующий() Цикл
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
		Выборка = ТаблицаМПЗ.НайтиСтроки(Новый Структура("МПЗ",ВыборкаНР.Элемент));
			Если Выборка.Количество() = 0 Тогда
			ТЧ = ТаблицаМПЗ.Добавить();
			ТЧ.ГруппаМПЗ = ПолучитьВерхнегоРодителя(ВыборкаНР.Элемент);
			ТЧ.МПЗ = ВыборкаНР.Элемент;
			ТЧ.Количество = ПолучитьБазовоеКоличествоБезОкругления(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
			Иначе
			Выборка[0].Количество = Выборка[0].Количество + ПолучитьБазовоеКоличествоБезОкругления(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
			КонецЕсли;
		ТабАналогов = ОбщегоНазначенияПовтИсп.ПолучитьАналогиНормРасходов(ВыборкаНР.Ссылка,ТекущаяДата(),Истина);
			Для каждого ТЧ_ТА Из ТабАналогов Цикл
			Выборка = ТаблицаАналогов.НайтиСтроки(Новый Структура("МПЗ,Аналог",ВыборкаНР.Элемент,ТЧ_ТА.Элемент));
				Если Выборка.Количество() = 0 Тогда
				ТЧ = ТаблицаАналогов.Добавить();
				ТЧ.МПЗ = ВыборкаНР.Элемент;
				ТЧ.Аналог = ТЧ_ТА.Элемент;
				ТЧ.ГруппаМПЗ = ПолучитьВерхнегоРодителя(ТЧ_ТА.Элемент);
				ТЧ.Количество = ПолучитьБазовоеКоличествоБезОкругления(ТЧ_ТА.Норма,ТЧ_ТА.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
				Иначе
				Выборка[0].Количество = Выборка[0].Количество + ПолучитьБазовоеКоличествоБезОкругления(ТЧ_ТА.Норма,ТЧ_ТА.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
				КонецЕсли;
			КонецЦикла; 					
		Иначе
	 	РаскрытьНаМПЗ(ТаблицаМПЗ,ТаблицаАналогов,ВыборкаНР.Элемент,ПолучитьБазовоеКоличествоБезОкругления(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнееПоступление(МПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеМПЗТабличнаяЧасть.Ссылка.Договор КАК Договор,
	|	ПоступлениеМПЗТабличнаяЧасть.Цена КАК Цена,
	|	ПоступлениеМПЗТабличнаяЧасть.ГТД.Страна КАК ГТДСтрана,
	|	ПоступлениеМПЗТабличнаяЧасть.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	Документ.ПоступлениеМПЗ.ТабличнаяЧасть КАК ПоступлениеМПЗТабличнаяЧасть
	|ГДЕ
	|	ПоступлениеМПЗТабличнаяЧасть.Ссылка.Дата <= &ДатаКон
	|	И ПоступлениеМПЗТабличнаяЧасть.МПЗ = &МПЗ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеМПЗТабличнаяЧасть.Ссылка.Дата УБЫВ";
Запрос.УстановитьПараметр("ДатаКон", КонецДня(НаДату));	
Запрос.УстановитьПараметр("МПЗ", МПЗ);	
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи);
	КонецЦикла;
Возврат(Неопределено);
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

ТаблицаМПЗ = Новый ТаблицаЗначений;
ТаблицаАналогов = Новый ТаблицаЗначений;

ТаблицаМПЗ.Колонки.Добавить("МПЗ");
ТаблицаМПЗ.Индексы.Добавить("МПЗ");
ТаблицаМПЗ.Колонки.Добавить("ГруппаМПЗ");
ТаблицаМПЗ.Колонки.Добавить("Количество");

ТаблицаАналогов.Колонки.Добавить("МПЗ");
ТаблицаАналогов.Индексы.Добавить("МПЗ");
ТаблицаАналогов.Колонки.Добавить("Аналог");
ТаблицаАналогов.Колонки.Добавить("ГруппаМПЗ");
ТаблицаАналогов.Колонки.Добавить("Количество");

РаскрытьНаМПЗ(ТаблицаМПЗ,ТаблицаАналогов,Спецификация,1);
ТаблицаМПЗ.Сортировать("МПЗ");
ТаблицаАналогов.Сортировать("МПЗ,Аналог");

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблАналог = Макет.ПолучитьОбласть("Аналог");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.Спецификация = СокрЛП(Спецификация.Наименование);
ОблШапка.Параметры.НаДату = Формат(НаДату,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);
СуммаИтого = 0;
	Для каждого ТЧ Из ТаблицаМПЗ Цикл
	ОблМПЗ.Параметры.Наименование = СокрЛП(ТЧ.МПЗ.Наименование);	
	ОблМПЗ.Параметры.МПЗ = ТЧ.МПЗ;
	ОблМПЗ.Параметры.ГруппаМПЗ = ТЧ.ГруппаМПЗ;
	ОблМПЗ.Параметры.ЕдиницаИзмерения = ТЧ.МПЗ.ЕдиницаИзмерения;
	Результат = ПолучитьПоследнееПоступление(ТЧ.МПЗ);
		Если Результат <> Неопределено Тогда
		ОблМПЗ.Параметры.Контрагент = Результат.Договор.Владелец;
		ОблМПЗ.Параметры.Договор = Результат.Договор;
		ОблМПЗ.Параметры.Валюта = Результат.Договор.Валюта;
		//ОблМПЗ.Параметры.Цена = Результат.Цена * Результат.ЕдиницаИзмерения.Коэффициент;
		ОблМПЗ.Параметры.Страна = Результат.ГТДСтрана;
		Иначе
		ОблМПЗ.Параметры.Контрагент = "";
		ОблМПЗ.Параметры.Договор = "";
		ОблМПЗ.Параметры.Валюта = "";
		//ОблМПЗ.Параметры.Цена = 0;
		ОблМПЗ.Параметры.Страна = "";					
		КонецЕсли;
	ОблМПЗ.Параметры.Цена = ОбщийМодульВызовСервера.ПолучитьПоследнююЦену(ТЧ.МПЗ,КонецДня(НаДату)); 
	ОблМПЗ.Параметры.Количество = ТЧ.Количество;
	Сумма = ОблМПЗ.Параметры.Цена*ТЧ.Количество;
	ОблМПЗ.Параметры.Сумма = Сумма;
	ТабДок.Вывести(ОблМПЗ);		
	СуммаИтого = СуммаИтого + Сумма;
	Выборка = ТаблицаАналогов.НайтиСтроки(Новый Структура("МПЗ",ТЧ.МПЗ));
		Если Выборка.Количество() > 0 Тогда
			Для к = 0 По Выборка.ВГраница() Цикл
			ОблАналог.Параметры.Наименование = СокрЛП(Выборка[к].Аналог.Наименование);
			ОблАналог.Параметры.МПЗ = Выборка[к].Аналог;
			ОблАналог.Параметры.ГруппаМПЗ = Выборка[к].ГруппаМПЗ;
			ОблАналог.Параметры.ЕдиницаИзмерения = Выборка[к].Аналог.ЕдиницаИзмерения;
			Результат = ПолучитьПоследнееПоступление(Выборка[к].Аналог);
				Если Результат <> Неопределено Тогда
				ОблАналог.Параметры.Контрагент = Результат.Договор.Владелец;
				ОблАналог.Параметры.Договор = Результат.Договор;
				ОблАналог.Параметры.Валюта = Результат.Договор.Валюта;
				//ОблАналог.Параметры.Цена = Результат.Цена * Результат.ЕдиницаИзмерения.Коэффициент;
				ОблАналог.Параметры.Страна = Результат.ГТДСтрана;
				Иначе
				ОблАналог.Параметры.Контрагент = "";
				ОблАналог.Параметры.Договор = "";
				ОблАналог.Параметры.Валюта = "";
				//ОблАналог.Параметры.Цена = 0;
				ОблАналог.Параметры.Страна = "";			
				КонецЕсли;
			ОблАналог.Параметры.Цена = ОбщийМодульВызовСервера.ПолучитьПоследнююЦену(Выборка[к].Аналог,КонецДня(НаДату));
			ОблАналог.Параметры.Количество = Выборка[к].Количество;
			ОблАналог.Параметры.Сумма = ОблАналог.Параметры.Цена*Выборка[к].Количество;
			ТабДок.Вывести(ОблАналог);					
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;
ОблКонец.Параметры.Сумма = СуммаИтого;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2; 
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
