
&НаСервере
Процедура ПолучитьСписокРМ(Линейка) 
Запрос = Новый Запрос;

СписокРМ.Очистить();
Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаЛинеек.Ссылка,
	|	РабочиеМестаЛинеек.ПометкаУдаления,
	|	РабочиеМестаЛинеек.Код КАК Код,
	|	РабочиеМестаЛинеек.Линейка,
	|	РабочиеМестаЛинеек.Наименование
	|ИЗ
	|	Справочник.РабочиеМестаЛинеек КАК РабочиеМестаЛинеек
	|ГДЕ
	|	РабочиеМестаЛинеек.Линейка = &Линейка
	|	И РабочиеМестаЛинеек.ПометкаУдаления = ЛОЖЬ
	|	И РабочиеМестаЛинеек.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
Запрос.УстановитьПараметр("Линейка", Линейка);
Результат = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокРМ.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
 
ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");

ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");	
ОблШапкаРабочееМесто = Макет.ПолучитьОбласть("Шапка|РабочееМесто");
ОблШапкаСтенд = Макет.ПолучитьОбласть("Шапка|Стенд");
ОблШапкаРемонт = Макет.ПолучитьОбласть("Шапка|Ремонт");
	
ОблМТКОбщие = Макет.ПолучитьОбласть("МТК|Общие");	
ОблМТКРабочееМесто = Макет.ПолучитьОбласть("МТК|РабочееМесто");
ОблМТКСтенд = Макет.ПолучитьОбласть("МТК|Стенд");
ОблМТКРемонт = Макет.ПолучитьОбласть("МТК|Ремонт");

ОблПЗОбщие = Макет.ПолучитьОбласть("ПЗ|Общие");	
ОблПЗРабочееМесто = Макет.ПолучитьОбласть("ПЗ|РабочееМесто");
ОблПЗСтенд = Макет.ПолучитьОбласть("ПЗ|Стенд");
ОблПЗРемонт = Макет.ПолучитьОбласть("ПЗ|Ремонт");
	
ОблКонецОбщие = Макет.ПолучитьОбласть("Конец|Общие");	
ОблКонецРабочееМесто = Макет.ПолучитьОбласть("Конец|РабочееМесто");
ОблКонецСтенд = Макет.ПолучитьОбласть("Конец|Стенд");
ОблКонецРемонт = Макет.ПолучитьОбласть("Конец|Ремонт");

ОблЗаголовок.Параметры.НаДату = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
ОблЗаголовок.Параметры.Счёт = СокрЛП(Счёт);
ТабДок.Вывести(ОблЗаголовок);

ЗапросЛО = Новый Запрос;

ЗапросЛО.Текст = 
	"ВЫБРАТЬ
	|	ЛьготнаяОчередь.ПЗ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.ПЗ.ДатаЗапуска = ДАТАВРЕМЯ(1,1,1,0,0,0)";
РезультатЗапроса = ЗапросЛО.Выполнить();
ВыборкаЛО = РезультатЗапроса.Выбрать();

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Ссылка КАК Ссылка,
	|	ПроизводственноеЗадание.ДокументОснование КАК МТК,
	|	ПроизводственноеЗадание.Изделие.Товар КАК Товар,
	|	ПроизводственноеЗадание.ДокументОснование.Номер КАК НомерМТК,
	|	ПроизводственноеЗадание.Изделие.Товар.Наименование КАК Наименование,
	|	ПроизводственноеЗадание.ДокументОснование.Линейка КАК Линейка
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПроизводственноеЗадание.ДокументОснование.Счёт = &Счёт
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПроизводственноеЗадание.ДокументОснование.Линейка,
	|	НомерМТК,
	|	ПроизводственноеЗадание.Номер
	|ИТОГИ ПО
	|	Линейка";
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));	
Запрос.УстановитьПараметр("Счёт",Счёт); 
Результат = Запрос.Выполнить();
ВыборкаЛинейки = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЛинейки.Следующий() Цикл
	ПолучитьСписокРМ(ВыборкаЛинейки.Линейка);
	ОблШапкаОбщие.Параметры.Линейка = ВыборкаЛинейки.Линейка;
	ОблШапкаОбщие.Параметры.ЛинейкаКомм = ВыборкаЛинейки.Линейка.Комментарий;
	ТабДок.Вывести(ОблШапкаОбщие);
		Для каждого РМ Из СписокРМ Цикл
			Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
			ОблШапкаСтенд.Параметры.РабочееМесто = РМ.Значение;
			ТабДок.Присоединить(ОблШапкаСтенд);
			Иначе
			ОблШапкаРабочееМесто.Параметры.РабочееМесто = РМ.Значение;
			ТабДок.Присоединить(ОблШапкаРабочееМесто);
			КонецЕсли; 
		КонецЦикла;
	ТабДок.Присоединить(ОблШапкаРемонт);
	НомСтр = 0;
	ТекМТК = Документы.МаршрутнаяКарта.ПустаяСсылка();
	ВыборкаДетальныеЗаписи = ВыборкаЛинейки.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ТекМТК <> ВыборкаДетальныеЗаписи.МТК Тогда
			ТекМТК = ВыборкаДетальныеЗаписи.МТК;
			ОблМТКОбщие.Параметры.МТК = ВыборкаДетальныеЗаписи.МТК;
			ОблМТКОбщие.Параметры.НомерМТК = ВыборкаДетальныеЗаписи.МТК.Номер;
			ОблМТКОбщие.Параметры.ОсобаяОтметка = ВыборкаДетальныеЗаписи.МТК.СтандартныйКомментарий.ОсобаяОтметка;
				Если Не ВыборкаДетальныеЗаписи.Товар.Пустая() Тогда
				ОблМТКОбщие.Параметры.Спецификация = СокрЛП(ВыборкаДетальныеЗаписи.Товар.Наименование);
				Иначе
				ОблМТКОбщие.Параметры.Спецификация = СокрЛП(ВыборкаДетальныеЗаписи.МТК.Номенклатура.Наименование);
				КонецЕсли; 
					Если ВыборкаДетальныеЗаписи.МТК.Статус = 2 Тогда
					ОблМТКОбщие.Параметры.Остановка = "О";
					Иначе
					ОблМТКОбщие.Параметры.Остановка = "";
					КонецЕсли; 
			ТабДок.Вывести(ОблМТКОбщие);
				Для каждого РМ Из СписокРМ Цикл
					Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
					ТабДок.Присоединить(ОблМТКСтенд);
					Иначе
					ТабДок.Присоединить(ОблМТКРабочееМесто);
					КонецЕсли;
				КонецЦикла;
			ТабДок.Присоединить(ОблМТКРемонт);
			КонецЕсли; 
		НомСтр = НомСтр + 1;
		ОблПЗОбщие.Параметры.НомСтр = НомСтр;
		СтатусРемонта = Перечисления.СтатусыРемонта.ПустаяСсылка();
		ПЗ = ВыборкаДетальныеЗаписи.Ссылка;				
	    ОблПЗОбщие.Параметры.ПЗ = ПЗ;
		ОблПЗОбщие.Параметры.НомерПЗ = ПЗ.Номер;
		ОблПЗОбщие.Параметры.ВозвратнаяТара = СокрЛП(ПЗ.ВозвратнаяТара);
		ОблПЗОбщие.Параметры.БарКод = ПЗ.БарКод;
		ОблПЗОбщие.Параметры.ДатаОтгрузки = Формат(ПЗ.ДокументОснование.ДатаОтгрузки,"ДФ=dd.MM.yyyy");
		ВыборкаЛО.Сбросить();
		СтуктураПоиска = Новый Структура("ПЗ",ПЗ);
			Если ВыборкаЛО.НайтиСледующий(СтуктураПоиска) Тогда
			ЛО = "ЛО";
			Иначе
			ЛО = "";
			КонецЕсли; 
		ОблПЗОбщие.Параметры.ЛО = ЛО;
		ТабДок.Вывести(ОблПЗОбщие);
		Отбор = Новый Структура("ПЗ",ПЗ);
			Для каждого РМ Из СписокРМ Цикл	
			ДатаНачала = "";
			ДатаОкончания = "";
				Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
				ТекПЗ = РегистрыСведений.СтендовыйПрогон.ПолучитьПоследнее(,Отбор);			
				ОблПЗСтенд.Параметры.ДатаНачала = ТекПЗ.ДатаПостановки;
				ОблПЗСтенд.Параметры.ДатаОкончания = ТекПЗ.ДатаСнятия;
				ОблПЗСтенд.Параметры.Прогон = ТекПЗ.Прогон;
				ТабДок.Присоединить(ОблПЗСтенд);
				Иначе
				ТекПЗ = РегистрыСведений.ЭтапыПроизводственныхЗаданий.Выбрать(,,Отбор);
					Пока ТекПЗ.Следующий() Цикл
						Если ТекПЗ.РабочееМесто = РМ.Значение Тогда
						ДатаНачала = ТекПЗ.ДатаНачала;
						ДатаОкончания = ТекПЗ.ДатаОкончания;
						Прервать;
						КонецЕсли; 
					КонецЦикла;
				ОблПЗРабочееМесто.Параметры.ДатаНачала = ДатаНачала;
				ОблПЗРабочееМесто.Параметры.ДатаОкончания = ДатаОкончания;
				ТабДок.Присоединить(ОблПЗРабочееМесто);
				КонецЕсли;			
			КонецЦикла;
		ЗапросРемонт = Новый Запрос;

		ЗапросРемонт.Текст = 
			"ВЫБРАТЬ
			|	РемонтнаяКарта.Ссылка
			|ИЗ
			|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
			|ГДЕ
			|	РемонтнаяКарта.ДокументОснование = &ДокументОснование
			|	И РемонтнаяКарта.Проведен = ЛОЖЬ";			
		ЗапросРемонт.УстановитьПараметр("ДокументОснование", ПЗ);		
		РезультатЗапросаРемонт = ЗапросРемонт.Выполнить();			
		ВыборкаДетальныеЗаписиРемонт = РезультатЗапросаРемонт.Выбрать();			
			Пока ВыборкаДетальныеЗаписиРемонт.Следующий() Цикл
			СтатусРемонта = Перечисления.СтатусыРемонта.Ремонт;
			КонецЦикла;
		ОблПЗРемонт.Параметры.СтатусРемонта = СтатусРемонта;
		ОблПЗРемонт.Параметры.ПЗ = ПЗ;
		ТабДок.Присоединить(ОблПЗРемонт);			
		КонецЦикла;
	ТабДок.Вывести(ОблКонецОбщие);
		Для каждого РМ Из СписокРМ Цикл
			Если СокрЛП(РМ.Значение.ГруппаРабочихМест.Префикс) = "СТ" Тогда
			ТабДок.Присоединить(ОблКонецСтенд);
			Иначе
			ТабДок.Присоединить(ОблКонецРабочееМесто);
			КонецЕсли;
		КонецЦикла;
	ТабДок.Присоединить(ОблКонецРемонт);
	КонецЦикла;			
ТабДок.ФиксацияСверху = 1;
ТабДок.ФиксацияСлева = 6;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
//ИмяКолонки = СокрЛП(Сред(Элемент.ТекущаяОбласть.Имя,Найти(Элемент.ТекущаяОбласть.Имя,"C")));
//	Если ИмяКолонки <> "C2" Тогда
//	СтандартнаяОбработка = Ложь;
//	П = Новый Структура("ПЗ",Расшифровка);
//	ОткрытьФорму("Отчет.ОтчетПоРемонту.Форма.ФормаОтчета",П);
//	КонецЕсли; 
КонецПроцедуры
