
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
   Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
      ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры 
            
&НаСервере
Функция ПолучитьМестоХранения(Линейка)
Возврат(Линейка.МестоХраненияКанбанов);
КонецФункции

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ЭтаФорма.ВводДоступен() Тогда                
	Массив = ОбщийМодульВызовСервера.РазложитьСтрокуВМассив(Данные,";");                  
		Если Массив[0] = "3" Тогда 
		ЗначениеПараметра1 = ОбщийМодульВызовСервера.ПолучитьЗначениеИзСтрокиВнутр(Массив[1]);
			Если ЗначениеПараметра1 = Неопределено Тогда
			Сообщить("Линейка или место хранения не найдена!");
			Возврат;	
			КонецЕсли; 
		Канбан = ОбщийМодульВызовСервера.ПолучитьЗначениеИзСтрокиВнутр(Массив[3]);
			Если Канбан = Неопределено Тогда
			Сообщить(Массив[3]+" - канбан не найден!");
			Возврат;	
			КонецЕсли;
		МестоХраненияОтправитель = ОбщийМодульВызовСервера.ПолучитьМестоХраненияПоКоду(Массив[2]);
			Если ТипЗнч(ЗначениеПараметра1) = Тип("СправочникСсылка.Линейки") Тогда
			МестоХраненияКанбанов = ПолучитьМестоХранения(ЗначениеПараметра1);
			Иначе
			МестоХраненияКанбанов = ЗначениеПараметра1;			
			КонецЕсли;
		НомерЯчейки = Число(Массив[5]); 
		ИначеЕсли Массив[0] = "7" Тогда
		Линейка = ОбщийМодульВызовСервера.ПолучитьЗначениеИзСтрокиВнутр(Массив[1]);
		МестоХраненияОтправитель = ОбщийМодульВызовСервера.ПолучитьЗначениеРеквизита(Линейка,"МестоХраненияГП");
		МестоХраненияКанбанов = ОбщийМодульВызовСервера.ПолучитьЗначениеИзСтрокиВнутр(Массив[2]);
        Канбан = ОбщийМодульВызовСервера.ПолучитьЗначениеИзСтрокиВнутр(Массив[3]);
        НомерЯчейки = Число(Массив[5]);
		Иначе
		Сотрудник = ОбщийМодульВызовСервера.ПолучитьЗначениеИзСтрокиВнутр(Данные);
		Возврат;	
		КонецЕсли;
	Выборка = ТаблицаКанбанов.НайтиСтроки(Новый Структура("Канбан,МестоХранения,МестоХраненияОтправитель,НомерЯчейки",Канбан,МестоХраненияКанбанов,МестоХраненияОтправитель,НомерЯчейки));
		Если Выборка.Количество() = 0 Тогда
		ТЧ = ТаблицаКанбанов.Добавить();
		ТЧ.НомерСтроки = ТаблицаКанбанов.Количество();
		ТЧ.МестоХраненияОтправитель = МестоХраненияОтправитель;
		ТЧ.МестоХранения = МестоХраненияКанбанов;   
		ТЧ.Канбан = Канбан;
		ТЧ.НомерЯчейки = НомерЯчейки;
		Иначе
        Сообщить("Канбан уже отсканирован в таблицу!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПринятьКанбаныНаСервере()
СписокУдаления = Новый СписокЗначений;

	Для каждого ТЧ Из ТаблицаКанбанов Цикл
		Если ОбщийМодульРаботаСРегистрами.ОформитьПринятиеКанбана(ТЧ.МестоХраненияОтправитель,ТЧ.МестоХранения,ТЧ.Канбан,ТЧ.НомерЯчейки,Сотрудник,Истина) Тогда	
		СписокУдаления.Добавить(ТЧ);
		Иначе
		ТЧ.Комментарий = "Не оформлен!";
		КонецЕсли;		
	КонецЦикла;
		Для каждого Стр Из СписокУдаления Цикл
		ТаблицаКанбанов.Удалить(Стр.Значение);
		КонецЦикла;
			Если ТаблицаКанбанов.Количество() = 0 Тогда
			Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
			КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПринятьКанбаны(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ПринятьКанбаныНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицу(Команда)
ТаблицаКанбанов.Очистить();
КонецПроцедуры

&НаСервере
Процедура ОформитьИПринятьКанбаныНаСервере()
СписокУдаления = Новый СписокЗначений;

	Для каждого ТЧ Из ТаблицаКанбанов Цикл
		Если ЗначениеЗаполнено(ТЧ.Комментарий) Тогда
			Если ОбщийМодульРаботаСРегистрами.ОформитьПустойКанбан(ТЧ.МестоХраненияОтправитель,ТЧ.МестоХранения,ТЧ.Канбан,ТЧ.НомерЯчейки,Сотрудник) Тогда
				Если ОбщийМодульРаботаСРегистрами.ОформитьПринятиеКанбана(ТЧ.МестоХраненияОтправитель,ТЧ.МестоХранения,ТЧ.Канбан,ТЧ.НомерЯчейки,Сотрудник,Истина) Тогда	
				СписокУдаления.Добавить(ТЧ);
				Иначе
				ТЧ.Комментарий = "Не оформлен!";
				КонецЕсли;
			Иначе
			ТЧ.Комментарий = "Не удалось оформить!";
			КонецЕсли;			
		КонецЕсли;		
	КонецЦикла;
		Для каждого Стр Из СписокУдаления Цикл
		ТаблицаКанбанов.Удалить(Стр.Значение);
		КонецЦикла;
			Если ТаблицаКанбанов.Количество() = 0 Тогда
			Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
			КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОформитьИПринятьКанбаны(Команда)
ОформитьИПринятьКанбаныНаСервере();
КонецПроцедуры
