
&НаСервере
Процедура ПолучитьСписокТО()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходовСрезПоследних.НормаРасходов.Элемент КАК Элемент
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних КАК НормыРасходовСрезПоследних
	|ГДЕ
	|	НормыРасходовСрезПоследних.НормаРасходов.Владелец = &Владелец
	|	И НормыРасходовСрезПоследних.Норма > 0";
Запрос.УстановитьПараметр("Владелец", Объект.НаборТО);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокТО.Добавить(ВыборкаДетальныеЗаписи.Элемент);	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПодобратьСпецификации(ЭтапСпецификации)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходовСрезПоследних.НормаРасходов.Владелец КАК Владелец
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних КАК НормыРасходовСрезПоследних
	|ГДЕ
	|	НормыРасходовСрезПоследних.НормаРасходов = &НормаРасходов
	|	И НормыРасходовСрезПоследних.Норма > 0";
Запрос.УстановитьПараметр("НормаРасходов", ЭтапСпецификации);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ВыборкаДетальныеЗаписи.Владелец.Канбан.Пустая() Тогда
			Если ВыборкаДетальныеЗаписи.Владелец.Канбан.Служебный Тогда
			ПодобратьСпецификации(ВыборкаДетальныеЗаписи.Владелец);
			Иначе	
			СписокНоменклатуры.Добавить(ВыборкаДетальныеЗаписи.Владелец);
			КонецЕсли;
		Иначе
		ПодобратьСпецификации(ВыборкаДетальныеЗаписи.Владелец);	
		КонецЕсли; 	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииКанбан.Ссылка.ДокументОснование КАК ПЗ
	|ИЗ
	|	Документ.ВыпускПродукцииКанбан КАК ВыпускПродукцииКанбан
	|ГДЕ
	|	ВыпускПродукцииКанбан.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВыпускПродукцииКанбан.Изделие В(&СписокНоменклатуры)";
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	флИдентичны = Истина;
		Для каждого Оборудование Из ВыборкаДетальныеЗаписи.ПЗ.Оборудование Цикл	
			Если СписокТО.НайтиПоЗначению(Оборудование.ТехОперация) = Неопределено Тогда
			флИдентичны = Ложь;
			ТЧ = Объект.ТабличнаяЧасть.Добавить();
			ТЧ.ПЗ = ВыборкаДетальныеЗаписи.ПЗ;
			Прервать;
			КонецЕсли;	
		КонецЦикла;
			Если флИдентичны Тогда
				Для каждого ТО Из СписокТО Цикл
					Если ВыборкаДетальныеЗаписи.ПЗ.Оборудование.Найти(ТО.Значение,"ТехОперация") = Неопределено Тогда
					ТЧ = Объект.ТабличнаяЧасть.Добавить();
					ТЧ.ПЗ = ВыборкаДетальныеЗаписи.ПЗ;
					Прервать;
					КонецЕсли;
				КонецЦикла;			
			КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
СписокТО.Очистить();
СписокНоменклатуры.Очистить();
Объект.ТабличнаяЧасть.Очистить();
ПолучитьСписокТО();
Состояние("Обработка...",,"Подбор спецификаций...");
ПодобратьСпецификации(Объект.НаборТО);
Состояние("Обработка...",,"Проверка в производственных заданиях...");
ПроверитьНаСервере();
КонецПроцедуры
