 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Запрос = Новый Запрос;

	Если (ТипЗнч(Объект.Элемент) = Тип("СправочникСсылка.Материалы"))или
		 (ТипЗнч(Объект.Элемент) = Тип("СправочникСсылка.Номенклатура"))Тогда
	Элементы.ЕдИзмЭлемента.Заголовок = Объект.Элемент.ОсновнаяЕдиницаИзмерения.Наименование;
	КонецЕсли;
		Если Параметры.Свойство("Владелец") Тогда	
		Объект.Владелец = Параметры.Владелец;
		КонецЕсли;
НаДату = ТекущаяДата(); 
Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НормыРасходов.Период КАК Период,
	|	НормыРасходов.Норма КАК Норма,
	|	НормыРасходов.Элемент КАК Элемент
	|ИЗ
	|	РегистрСведений.НормыРасходов КАК НормыРасходов
	|ГДЕ
	|	НормыРасходов.НормаРасходов = &НормаРасходов
	|	И НормыРасходов.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	НормыРасходов.Период УБЫВ";
Запрос.УстановитьПараметр("НормаРасходов", Объект.Ссылка);
Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
	ЭлементСтарый = ВыборкаДетальныеЗаписи.Элемент;
	Норма = ВыборкаДетальныеЗаписи.Норма;
	КонецЦикла;
КонецПроцедуры
       
&НаКлиенте
Процедура ПриОткрытии(Отказ)
РегистрНормРасходов.Параметры.УстановитьЗначениеПараметра("НормаРасходов",Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если НаДату = НачалоДня(ТекущаяДата()) Тогда
	ДатаИзм = ТекущаяДата();
	Иначе
	ДатаИзм = НаДату;	
	КонецЕсли; 
		Если Объект.Элемент <> ЭлементСтарый Тогда
		РНР = РегистрыСведений.НормыРасходов.СоздатьНаборЗаписей();
		РНР.Отбор.НормаРасходов.Установить(Объект.Ссылка);
		РНР.Прочитать();
			Для Каждого Запись Из РНР Цикл
			Запись.Элемент = Объект.Элемент;
			КонецЦикла;	      
		РНР.Записать(Истина);
		КонецЕсли; 
Нормы = РегистрыСведений.НормыРасходов.ПолучитьПоследнее(ДатаИзм,Новый Структура("НормаРасходов",Объект.Ссылка));
	Если Норма <> Нормы.Норма Тогда
	РНР = РегистрыСведений.НормыРасходов.СоздатьМенеджерЗаписи();
	РНР.Период = ДатаИзм;
	РНР.Владелец = Объект.Владелец;
	РНР.Элемент = Объект.Элемент;
	РНР.НормаРасходов = Объект.Ссылка;
	РНР.Норма = Норма;
	РНР.Записать(); 
	КонецЕсли;     
Элементы.РегистрНормРасходов.Обновить();
	Если Норма = 0 Тогда
	ТаблицаАналогов = ОбщегоНазначенияПовтИсп.ПолучитьАналогиНормРасходов(Объект.Ссылка,ДатаИзм,Истина);
		Для каждого ТЧ Из ТаблицаАналогов Цикл
		РАНР = РегистрыСведений.АналогиНормРасходов.СоздатьМенеджерЗаписи();
		РАНР.Период = ДатаИзм;
		РАНР.Владелец = ТЧ.Ссылка.Владелец;
		РАНР.АналогНормыРасходов = ТЧ.Ссылка;
		РАНР.Норма = 0;
		РАНР.Записать();	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
             
&НаКлиенте
Процедура ПриЗакрытии()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	ОповеститьОВыборе("Выбор");
	Иначе
	ОповеститьОВыборе(Неопределено);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьВидДокумента(ВыбЭлемент)
Возврат(Строка(ВыбЭлемент.ВидДокумента));
КонецФункции

&НаСервере
Функция ПолучитьОсновнуюЕдиницуИзмерения(ВыбЭлемент)
Возврат(ВыбЭлемент.ОсновнаяЕдиницаИзмерения.Наименование);
КонецФункции

&НаКлиенте
Процедура ЭлементНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
П = Новый Структура("ТекущаяСтрока",Объект.Элемент);
	Если Элементы.ВидЭлемента.ТекстРедактирования = "Материал" Тогда
	Результат = ОткрытьФормуМодально("Справочник.Материалы.ФормаВыбора",П);
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;  
	Объект.Наименование = "Материал, "+Результат;
	Элементы.ЕдИзмЭлемента.Заголовок = ПолучитьОсновнуюЕдиницуИзмерения(Результат);
	ИначеЕсли Элементы.ВидЭлемента.ТекстРедактирования = "Материал вспомогательный" Тогда
	Результат = ОткрытьФормуМодально("Справочник.Материалы.ФормаВыбора",П);
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;  
	Объект.Наименование = "Материал вспомогательный, "+Результат;
	Элементы.ЕдИзмЭлемента.Заголовок = ПолучитьОсновнуюЕдиницуИзмерения(Результат);
	ИначеЕсли Элементы.ВидЭлемента.ТекстРедактирования = "Тех. операция" Тогда	
	Результат = ОткрытьФормуМодально("Справочник.ТехОперации.Форма.ФормаВыбораЭлемента",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	Объект.Наименование = "Тех. операция, "+Результат;
	ИначеЕсли Элементы.ВидЭлемента.ТекстРедактирования = "Тех. оснастка" Тогда	
	Результат = ОткрытьФормуМодально("Справочник.ТехОснастка.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	Объект.Наименование = "Тех. оснастка, "+Результат;	
	ИначеЕсли (Элементы.ВидЭлемента.ТекстРедактирования = "Документ")или
			  (Элементы.ВидЭлемента.ТекстРедактирования = "Программа")Тогда	
	Результат = ОткрытьФормуМодально("Справочник.Документация.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	Объект.Наименование = ПолучитьВидДокумента(Результат)+", "+Результат;	
	Иначе
	Результат = ОткрытьФормуМодально("Справочник.Номенклатура.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	Объект.Наименование = Строка(Объект.ВидЭлемента)+", "+Результат;
	Элементы.ЕдИзмЭлемента.Заголовок = ПолучитьОсновнуюЕдиницуИзмерения(Результат);			
	КонецЕсли;	
Объект.Элемент = Результат;	
КонецПроцедуры

&НаСервере
Процедура ВидЭлементаПриИзмененииНаСервере()
	Если Объект.Элемент <> Неопределено Тогда
		Если ТипЗнч(Объект.ВидЭлемента) = Тип("СправочникСсылка.Документация") Тогда
		Объект.Наименование = Строка(Объект.Элемент.ВидДокумента)+", "+Объект.Элемент.Наименование;
		Иначе
		Объект.Наименование = Строка(Объект.ВидЭлемента)+", "+Объект.Элемент.Наименование;
		КонецЕсли; 	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВидЭлементаПриИзменении(Элемент)
ВидЭлементаПриИзмененииНаСервере();
КонецПроцедуры


