
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
НормаРасходов = Параметры.НормаРасходов;
Запрос = Новый Запрос;
 
Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НормыРасходов.Период КАК Период,
	|	НормыРасходов.Норма КАК Норма
	|ИЗ
	|	РегистрСведений.НормыРасходов КАК НормыРасходов
	|ГДЕ
	|	НормыРасходов.НормаРасходов = &НормаРасходов
	|
	|УПОРЯДОЧИТЬ ПО
	|	НормыРасходов.Период УБЫВ";
Запрос.УстановитьПараметр("НормаРасходов", НормаРасходов);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Норма = ВыборкаДетальныеЗаписи.Норма;
	НаДату = ВыборкаДетальныеЗаписи.Период;
	КонецЦикла;
Позиция = Параметры.НормаРасходов.Позиция;
ВидЭлемента = Параметры.НормаРасходов.ВидЭлемента;
Элемент = Параметры.НормаРасходов.Элемент;
КонецПроцедуры

&НаСервере
Функция ИзменитьНаСервере()
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	НР = НормаРасходов.ПолучитьОбъект();
	НР.Позиция = Позиция;
	НР.ВидЭлемента = ВидЭлемента;
	НР.Элемент = Элемент;
		Если ТипЗнч(Элемент) = Тип("СправочникСсылка.Документация") Тогда
		НР.Наименование = Строка(Элемент.ВидДокумента)+", "+Элемент.Наименование;
		Иначе	
		НР.Наименование = Строка(ВидЭлемента)+", "+Элемент.Наименование;
		КонецЕсли;
	НР.Примечание = Примечание;
	НР.Записать();
	РНР = РегистрыСведений.НормыРасходов.СоздатьНаборЗаписей();
	РНР.Отбор.Период.Установить(НаДату);
	РНР.Отбор.Владелец.Установить(НормаРасходов.Владелец);
	РНР.Отбор.НормаРасходов.Установить(НормаРасходов);
	РНР.Прочитать();
		Для Каждого Запись Из РНР Цикл
		Запись.Элемент = НР.Элемент;
		Запись.Норма = Норма;
		КонецЦикла;	      
	РНР.Записать(Истина); 		
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат(Истина);
	Исключение
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Сообщить(ОписаниеОшибки());
	Возврат(Ложь);
	КонецПопытки; 	
КонецФункции

&НаКлиенте
Процедура Изменить(Команда)
	Если Вопрос("ВНИМАНИЕ! Вы изменяете норму расходов без истории! Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Если ИзменитьНаСервере() Тогда
		ЭтаФорма.Закрыть(Истина);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЭлементНачалоВыбора(Элем, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
П = Новый Структура("ТекущаяСтрока",Элемент);
	Если Элементы.ВидЭлемента.ТекстРедактирования = "Материал" Тогда
	Результат = ОткрытьФормуМодально("Справочник.Материалы.ФормаВыбора",П);
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	ИначеЕсли Элементы.ВидЭлемента.ТекстРедактирования = "Тех. операция" Тогда	
	Результат = ОткрытьФормуМодально("Справочник.ТехОперации.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	ИначеЕсли Элементы.ВидЭлемента.ТекстРедактирования = "Тех. оснастка" Тогда	
	Результат = ОткрытьФормуМодально("Справочник.ТехОснастка.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;	
	ИначеЕсли (Элементы.ВидЭлемента.ТекстРедактирования = "Документ")или
			  (Элементы.ВидЭлемента.ТекстРедактирования = "Программа")Тогда	
	Результат = ОткрытьФормуМодально("Справочник.Документация.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;	
	Иначе
	Результат = ОткрытьФормуМодально("Справочник.Номенклатура.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;		
	КонецЕсли;	
Элемент = Результат;
КонецПроцедуры

&НаСервере
Функция ПроверитьВидЭлемента()
	Если ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Деталь или
		 ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Набор или
		 ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Узел или
		 ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Основа Тогда
	Возврат(?(ТипЗнч(Элемент) = Тип("СправочникСсылка.Номенклатура"),Истина,Ложь));
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Документ или
			  ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Программа Тогда
    Возврат(?(ТипЗнч(Элемент) = Тип("СправочникСсылка.Документация"),Истина,Ложь));
	Иначе
	Возврат(Ложь);
	КонецЕсли; 	
КонецФункции

&НаКлиенте
Процедура ВидЭлементаПриИзменении(Элем)
	Если Не ПроверитьВидЭлемента() Тогда
	Элемент = Неопределено;	
	КонецЕсли;
КонецПроцедуры
