
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(Наименование)
Материал = Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина);
	Если Не Материал.Пустая() Тогда
	ТЧ = ТаблицаСтационарныхПитателей.Добавить();
	ТЧ.МПЗ = Материал;
	Иначе
	Сообщить(""+Наименование+" - материал не найден!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
ТаблицаСтационарныхПитателей.Очистить();
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл со списком МПЗ");
	Если Результат <> Неопределено Тогда
	СписокТоваров = Новый СписокЗначений;
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка списка МПЗ...");
		ЗагрузитьИзФайлаНаСервере(СокрЛП(ExcelЛист.Cells(к,1).Value));
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьМПЗНаСервере()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МатериалыСтационарныеПитатели.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Материалы.СтационарныеПитатели КАК МатериалыСтационарныеПитатели
	|ГДЕ
	|	МатериалыСтационарныеПитатели.Линейка = &Линейка
	|
	|УПОРЯДОЧИТЬ ПО
	|	МатериалыСтационарныеПитатели.Ссылка.Наименование";
Запрос.УстановитьПараметр("Линейка", Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = ТаблицаСтационарныхПитателей.Добавить();
	ТЧ.МПЗ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьМПЗ(Команда)
Элементы.ТаблицаСтационарныхПитателейПометкаДобавить.Доступность = Ложь;
ТаблицаСтационарныхПитателей.Очистить();
ПолучитьМПЗНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВсе(Команда)
	Для каждого ТЧ Из ТаблицаСтационарныхПитателей Цикл
	ТЧ.ПометкаДобавить = Истина;
	ТЧ.ПометкаУдалить = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьДобавлениеВсе(Команда)
	Для каждого ТЧ Из ТаблицаСтационарныхПитателей Цикл
	ТЧ.ПометкаДобавить = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	Для каждого ТЧ Из ТаблицаСтационарныхПитателей Цикл
	ТЧ.ПометкаДобавить = Ложь;
	ТЧ.ПометкаУдалить = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьУдалениеВсе(Команда)
	Для каждого ТЧ Из ТаблицаСтационарныхПитателей Цикл
	ТЧ.ПометкаУдалить = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбработатьНаСервере()
	Для каждого ТЧ Из ТаблицаСтационарныхПитателей Цикл
		Если ТЧ.ПометкаДобавить Тогда	
			Если ТЧ.МПЗ.СтационарныеПитатели.Найти(Линейка,"Линейка") = Неопределено Тогда
			Материал = ТЧ.МПЗ.ПолучитьОбъект();
			ТЧ_СП = Материал.СтационарныеПитатели.Добавить();
			ТЧ_СП.Линейка = Линейка;
			Материал.Записать();
			КонецЕсли; 
		КонецЕсли;
			Если ТЧ.ПометкаУдалить Тогда
			Материал = ТЧ.МПЗ.ПолучитьОбъект();
			Выборка = Материал.СтационарныеПитатели.Найти(Линейка,"Линейка");	
				Если Выборка <> Неопределено Тогда
				Материал.СтационарныеПитатели.Удалить(Выборка);
				Материал.Записать();
				КонецЕсли; 
			КонецЕсли;  
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура Обработать(Команда)
ОбработатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтационарныхПитателейПометкаДобавитьПриИзменении(Элемент)
Элементы.ТаблицаСтационарныхПитателей.ТекущиеДанные.ПометкаУдалить = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтационарныхПитателейПометкаУдалитьПриИзменении(Элемент)
Элементы.ТаблицаСтационарныхПитателей.ТекущиеДанные.ПометкаДобавить = Ложь;
КонецПроцедуры
