
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ЭтотОбъект.ТолькоПросмотр = ОбщийМодульСозданиеДокументов.ЗапретРедактирования(Объект.Ссылка,Истина,Ложь);
КонецПроцедуры

&НаСервере
Процедура ДобавитьНаСервере(NAME,CENA)
Выбор = Справочники.Материалы.НайтиПоНаименованию(СокрЛП(NAME),Истина);
	Если Не Выбор.Пустая() Тогда
	ТЧ = Объект.ТабличнаяЧасть.Добавить();
    ТЧ.МПЗ = Выбор;
	ТЧ.Цена = CENA;
	Иначе
    Сообщить(NAME+" - не найден в справочнике материалов!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	флНеНайден = Ложь;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка МПЗ из файла..."); 
		ДобавитьНаСервере(ExcelЛист.Cells(к,1).Value,Число(ExcelЛист.Cells(к,2).Value));
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли; 
КонецПроцедуры
