
&НаСервере
Процедура ИзменитьНаСервере(Запись)
Выбор = Справочники.Номенклатура.НайтиПоНаименованию(Запись.Наименование,Истина);
	Если Не Выбор.Пустая() Тогда
	Ном = Выбор.ПолучитьОбъект();
	флИзменен = Ложь;
    ЗначениеПараметра = Неопределено;			
    	Если Запись.Свойство("МинОстаток",ЗначениеПараметра) Тогда
			Если Ном.МинОстаток <> ЗначениеПараметра Тогда
			Ном.МинОстаток = ЗначениеПараметра;
			флИзменен = Истина;		
			КонецЕсли; 
		КонецЕсли;
	ЗначениеПараметра = Неопределено;
    	Если Запись.Свойство("ДатаПересмотра",ЗначениеПараметра) Тогда
			Если Ном.ДатаПересмотра <> ЗначениеПараметра Тогда
			Ном.ДатаПересмотра = ЗначениеПараметра;
			флИзменен = Истина;
			КонецЕсли; 
		КонецЕсли;
			Если флИзменен Тогда
			Ном.Записать();
			КонецЕсли;
	Иначе
    Сообщить(Запись.Наименование+" не найден!");
	КонецЕсли; 
КонецПроцедуры 

&НаСервере
Процедура ОчиститьНаСервере()
Выборка = Справочники.Номенклатура.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда
		Продолжить;		
		КонецЕсли;                        
			Если Выборка.Ссылка.МинОстаток > 0 Тогда
			Ном = Выборка.Ссылка.ПолучитьОбъект();
			Ном.МинОстаток = 0;
			Ном.Записать();
			КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	Для каждого ТЧ Из ТаблицаПараметров Цикл
		Если СокрЛП(ТЧ.Параметр) = "выберите соответствие" Тогда
		Сообщить("Не все колонки идентифицированы!");
		Возврат;
		КонецЕсли;	
	КонецЦикла;
		Если ОчиститьНеснижаемыеЗапасы Тогда
		Состояние("Обработка...",,"Очистка параметров...");
		ОчиститьНаСервере();
		КонецЕсли;
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c параметрами номенклатуры",ИмяФайла);
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	КолКолонок = Результат.КоличествоКолонок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка параметров из файла..."); 
		Запись = Новый Структура();

		Запись.Вставить("Наименование",СокрЛП(ExcelЛист.Cells(к,1).Value));
			Для л = 0 по КолКолонок - 2 Цикл
            Запись.Вставить(ТаблицаПараметров[л].Параметр,СокрЛП(ExcelЛист.Cells(к,л+2).Value));
			КонецЦикла;	
        ИзменитьНаСервере(Запись);
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
 КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;            
ТаблицаПараметров.Очистить();
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c параметрами номенклатуры");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	ИмяФайла = Результат.ПолноеИмяФайла;
		Для к = 2 По Результат.КоличествоКолонок Цикл
		ТЧ = ТаблицаПараметров.Добавить();
		ТЧ.НомерКолонки = к;
		ТЧ.НаименованиеВфайле = СокрЛП(ExcelЛист.Cells(1,к).Value);
		ВыбЗнач = Элементы.ТаблицаПараметровПараметр.СписокВыбора.НайтиПоЗначению(ТЧ.НаименованиеВфайле);
			Если ВыбЗнач <> Неопределено Тогда
			ТЧ.Параметр = ВыбЗнач.Значение;
			Иначе
			ТЧ.Параметр = "выберите соответствие";			
			КонецЕсли;
		КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры
