
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТЧ = ТаблицаМТК.Добавить();
ТЧ.МТК = Параметры.МТК;
ТЧ.Количество = Параметры.МТК.Количество;
ТЧ.МожноУдалить = ПроверитьМТК(ТЧ);
КолСтр = ТаблицаМТК.Количество()-1;
МожноУдалить = ТаблицаМТК[КолСтр].МожноУдалить;
	Для к = 0 По КолСтр - 1 Цикл
		Если Не МожноУдалить Тогда
		ТаблицаМТК[КолСтр-к].МожноУдалить = Ложь;
		КонецЕсли;	
	МожноУдалить = ТаблицаМТК[КолСтр-к].МожноУдалить;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМТКПриАктивизацииСтроки(Элемент)
Элементы.УдалитьМТК.Доступность = Элементы.ТаблицаМТК.ТекущиеДанные.МожноУдалить;
КонецПроцедуры

&НаСервере
Функция ПроверитьМТК(ТЧ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Ссылка
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование";
Запрос.УстановитьПараметр("ДокументОснование", ТЧ.МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныхЗаписей = РезультатЗапроса.Выбрать();
МожноУдалить = Истина;
	Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
	ТЧ_ПЗ = ТЧ.ТаблицаПЗ.Добавить();
	ТЧ_ПЗ.ПЗ = ВыборкаДетальныхЗаписей.Ссылка;
	ТЧ_ПЗ.ДатаЗапуска = ВыборкаДетальныхЗаписей.Ссылка.ДатаЗапуска;	
		Если ЗначениеЗаполнено(ВыборкаДетальныхЗаписей.Ссылка.ДатаЗапуска) Тогда
		ТЧ_ПЗ.МожноУдалить = Ложь;
		МожноУдалить = Ложь;
		Иначе
		ТЧ_ПЗ.МожноУдалить = Истина;
		КонецЕсли;	
	КонецЦикла;
ПолучитьПодчиненныеМТК(ТЧ);
Возврат(МожноУдалить);
КонецФункции

&НаСервере
Процедура ПолучитьПодчиненныеМТК(ТЧ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутнаяКарта.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ГДЕ
	|	МаршрутнаяКарта.ДокументОснование = &ДокументОснование";
Запрос.УстановитьПараметр("ДокументОснование", ТЧ.МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ_П = ТаблицаМТК.Добавить();
	ТЧ_П.МТК = ВыборкаДетальныеЗаписи.Ссылка;
	ТЧ_П.Количество = ВыборкаДетальныеЗаписи.Ссылка.Количество;
	ТЧ_П.МожноУдалить = ПроверитьМТК(ТЧ_П);
	ТЧ_П.Подчиненная = Истина;
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Функция УдалитьОсновнуюМТК(Стр)
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	ТЧ = ТаблицаМТК.НайтиПоИдентификатору(Стр);
		Если ТЧ.МожноУдалить Тогда
		Запрос = Новый Запрос;

			Для Каждого ТЧ Из ТаблицаМТК Цикл
				Если ТЧ.МожноУдалить Тогда
					Если ТЧ.МТК.Подразделение.ОформлятьПустыеКанбаны = 2 Тогда
					НаборЗаписей = РегистрыСведений.ОборотКанбанов.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.МестоХранения.Установить(ТЧ.МТК.МестоХраненияПотребитель); 
					НаборЗаписей.Отбор.МестоХраненияОтправитель.Установить(ТЧ.МТК.Линейка.МестоХраненияГП);
					НаборЗаписей.Отбор.Подразделение.Установить(ТЧ.МТК.Подразделение);
					НаборЗаписей.Отбор.МПЗ.Установить(ТЧ.МТК.Номенклатура);
					НаборЗаписей.Отбор.НомерЯчейки.Установить(ТЧ.МТК.НомерЯчейки);
					НаборЗаписей.Прочитать();
						Для Каждого Запись Из НаборЗаписей Цикл
						    Если Не ЗначениеЗаполнено(Запись.ДатаПередачи) Тогда
							НаборЗаписей.Удалить(Запись);
							Прервать;
						    КонецЕсли;
						КонецЦикла;
					НаборЗаписей.Записать();
					КонецЕсли; 
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПроизводственноеЗадание.Ссылка
					|ИЗ
					|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
					|ГДЕ
					|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование";
				Запрос.УстановитьПараметр("ДокументОснование", ТЧ.МТК);
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ПЗ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();		
					ПЗ.Удалить();
					КонецЦикла;
				МТК = ТЧ.МТК.ПолучитьОбъект();
				МТК.Удалить();	
				Иначе
				МТК = ТЧ.МТК.ПолучитьОбъект();
				МТК.ДокументОснование = Неопределено;
				МТК.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли; 
			КонецЦикла;			
		Иначе	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МаршрутнаяКарта.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
			|ГДЕ
			|	МаршрутнаяКарта.ДокументОснование = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", ТЧ.МТК);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МТК = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			МТК.ДокументОснование = Неопределено;
			МТК.Записать(РежимЗаписиДокумента.Проведение);
			КонецЦикла;
		МТК = ТЧ.МТК.ПолучитьОбъект();
		МТК.Удалить();		
		КонецЕсли;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат(Истина);
	Исключение
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Сообщить(ОписаниеОшибки());
	Возврат(Ложь);	
	КонецПопытки;
КонецФункции

&НаСервере
Функция УдалитьПодчиненнуюМТК(Стр)
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	ТЧ = ТаблицаМТК.НайтиПоИдентификатору(Стр);
		Если ТЧ.МожноУдалить Тогда
			Если ТЧ.МТК.Подразделение.ОформлятьПустыеКанбаны = 2 Тогда
			НаборЗаписей = РегистрыСведений.ОборотКанбанов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.МестоХранения.Установить(ТЧ.МТК.МестоХраненияПотребитель); 
			НаборЗаписей.Отбор.МестоХраненияОтправитель.Установить(ТЧ.МТК.Линейка.МестоХраненияГП);
			НаборЗаписей.Отбор.Подразделение.Установить(ТЧ.МТК.Подразделение);
			НаборЗаписей.Отбор.МПЗ.Установить(ТЧ.МТК.Номенклатура);
			НаборЗаписей.Отбор.НомерЯчейки.Установить(ТЧ.МТК.НомерЯчейки);
			НаборЗаписей.Прочитать();
				Для Каждого Запись Из НаборЗаписей Цикл
				    Если Не ЗначениеЗаполнено(Запись.ДатаПередачи) Тогда
					НаборЗаписей.Удалить(Запись);
					Прервать;
				    КонецЕсли;
				КонецЦикла;
			НаборЗаписей.Записать();
			КонецЕсли; 
		Запрос = Новый Запрос;

		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПроизводственноеЗадание.Ссылка
			|ИЗ
			|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
			|ГДЕ
			|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", ТЧ.МТК);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПЗ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();		
			ПЗ.Удалить();
			КонецЦикла;
		МТК = ТЧ.МТК.ПолучитьОбъект();
		МТК.Удалить();	
		КонецЕсли; 		
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат(Истина);
	Исключение
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Сообщить(ОписаниеОшибки());
	Возврат(Ложь);	
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура УдалитьМТК(Команда)
Стр = Элементы.ТаблицаМТК.ТекущаяСтрока;
	Если Стр = 0 Тогда
	Результат = УдалитьОсновнуюМТК(Стр);
	Иначе		 
	Результат = УдалитьПодчиненнуюМТК(Стр);
	КонецЕсли; 
		Если Результат Тогда
		ЭтаФорма.Закрыть(Истина);	
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьПЗНаСервере()
СписокСтр = Новый СписокЗначений;

	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
		Для Каждого ТЧ Из ТаблицаМТК Цикл
		КолУдаленных = 0;
			Для Каждого ТЧ_ПЗ Из ТЧ.ТаблицаПЗ Цикл
				Если ТЧ_ПЗ.Пометка Тогда
				ПЗ = ТЧ_ПЗ.ПЗ.ПолучитьОбъект();		
				КолУдаленных = КолУдаленных + ПЗ.Количество;
				ПЗ.Удалить();
				КонецЕсли;
			КонецЦикла;
		КолОстПВ = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ТекущаяДата(),ТЧ.МТК);
		МТК = ТЧ.МТК.ПолучитьОбъект();
		МТК.Количество = МТК.Количество - КолУдаленных;
			Если КолОстПВ = МТК.Количество Тогда
			МТК.Статус = 3;			
			КонецЕсли; 
		МТК.Записать(РежимЗаписиДокумента.Проведение);
		ТЧ.Количество = МТК.Количество;  
		КонецЦикла;	
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;	
		Для Каждого ТЧ Из ТаблицаМТК Цикл
		СписокСтр.Очистить();
		ТаблицаПЗ = ТЧ.ТаблицаПЗ;
			Для Каждого ТЧ_ПЗ Из ТаблицаПЗ Цикл
				Если ТЧ_ПЗ.Пометка Тогда
				СписокСтр.Добавить(ТЧ_ПЗ);
				КонецЕсли;
			КонецЦикла; 
				Для каждого Стр Из СписокСтр Цикл
				ТаблицаПЗ.Удалить(Стр.Значение);
				КонецЦикла;
		КонецЦикла;		
	Исключение
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Сообщить(ОписаниеОшибки());	
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПЗ(Команда)
УдалитьПЗНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры
