
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ЭтотОбъект.ТолькоПросмотр = ОбщийМодульСозданиеДокументов.ЗапретРедактирования(Объект.Ссылка,Истина,Ложь);
Элементы.Статус.Доступность = ОбщийМодульВызовСервера.ДоступностьРоли("Администратор");
КонецПроцедуры

&НаСервере
Функция ПолучитьПрефиксПодразделения()
Возврат(Объект.Подразделение.Префикс);	
КонецФункции

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
Объект.Номер = "";
КонецПроцедуры	

&НаСервере
Процедура СохранитьДокументНаСервере()
ЭтотДокумент = ДанныеФормыВзначение(Объект,Тип("ДокументОбъект.МаршрутнаяКарта"));
ЭтотДокумент.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры 

&НаСервере
Функция ПолучитьСписокЭтаповСпецификацийНаСервере()
ЭтапыСпец = Новый ТаблицаЗначений;
ЭтапыСпец = Объект.Этапы.Выгрузить(,"ЭтапСпецификации");
СписокЭтапов = ЭтапыСпец.ВыгрузитьКолонку("ЭтапСпецификации");
СписокЭтаповСпецификаций = Новый ФиксированныйМассив(СписокЭтапов);
Возврат(СписокЭтаповСпецификаций);
КонецФункции 

&НаСервере
Процедура СоздатьПЗНаСервере()
	Если Объект.Номенклатура.Товар.Пустая() Тогда
	Сообщить("Товар не присвоен для "+СокрЛП(Объект.Номенклатура.Наименование)+"!");
	Возврат;
	КонецЕсли; 
ОбщийМодульСозданиеДокументов.СоздатьПЗ(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПЗ(Команда)
СоздатьПЗНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	Если Объект.Статус = 0 Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроизводственноеЗадание.Ссылка
		|ИЗ
		|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
		|ГДЕ
		|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование
		|	И ПроизводственноеЗадание.ДатаЗапуска <> &ДатаЗапуска";	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаЗапуска", Дата(1,1,1));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Сообщить("МТК уже запущена в работу!");
		Объект.Статус = Объект.Ссылка.Статус;
		Возврат;
		КонецЕсли;		
			Если Объект.Ссылка.Статус = 2 Тогда
			Объект.ДатаОкончанияОстановки = ТекущаяДата();
			КонецЕсли; 
	ИначеЕсли (Объект.Статус = 1)или(Объект.Статус = 4) Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроизводственноеЗадание.Ссылка
		|ИЗ
		|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
		|ГДЕ
		|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование
		|	И ПроизводственноеЗадание.ДатаЗапуска <> &ДатаЗапуска";	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаЗапуска", Дата(1,1,1));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		Сообщить("МТК не запущена в работу!");
		Объект.Статус = Объект.Ссылка.Статус;
		Возврат;
		КонецЕсли;		
			Если Объект.Ссылка.Статус = 2 Тогда
			Объект.ДатаОкончанияОстановки = ТекущаяДата();
			КонецЕсли;
		Если Объект.ДатаНачалаОстановки <> Дата(1,1,1) Тогда
		Объект.ДатаОкончанияОстановки = ТекущаяДата();
		КонецЕсли;
	ИначеЕсли Объект.Статус = 2 Тогда
	КолОстПВ = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ТекущаяДата(),Объект.Ссылка);
		Если КолОстПВ = 0 Тогда
		Сообщить("МТК закрыта!");
		Объект.Статус = Объект.Ссылка.Статус;
		Возврат;						     
		КонецЕсли;
	Объект.ДатаНачалаОстановки = ТекущаяДата();
	Объект.ДатаОкончанияОстановки = Дата(1,1,1); 
	Объект.ИнициаторОстановки = ПараметрыСеанса.Пользователь;
	ИначеЕсли Объект.Статус = 3 Тогда
	КолОстПВ = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ТекущаяДата(),Объект.Ссылка);
		Если КолОстПВ > 0 Тогда
		Сообщить("Осталось выпустить: "+КолОстПВ);
		Объект.Статус = Объект.Ссылка.Статус;			     
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
	Отказ = Истина;	
	КонецЕсли; 
		Если Объект.Статус = 2 Тогда
			Если Объект.Остановки.Количество() = 0 Тогда
			Сообщить("Таблица Остановок не заполнена!");
			Отказ = Истина;
			Иначе
				Если ЗначениеЗаполнено(Объект.Остановки[ Объект.Остановки.Количество()-1].ДатаОкончания) Тогда
				Сообщить("В таблица Остановок нет действующих остановок!");
				Отказ = Истина;
				КонецЕсли; 
			КонецЕсли;		
		КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ИзменитьПервыйЭтапПЗНаСервере(ВыбРМ,флЛинейка)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Ссылка
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование
	|	И ПроизводственноеЗадание.ДатаЗапуска = ДАТАВРЕМЯ(1,1,1,0,0,0)";
Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НаборЗаписей = РегистрыСведений.ЭтапыПроизводственныхЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПЗ.Установить(ВыборкаДетальныеЗаписи.Ссылка);
	НаборЗаписей.Прочитать();
	    Для Каждого Запись Из НаборЗаписей Цикл
			Если флЛинейка Тогда
			Запись.Линейка = Объект.Линейка;
			КонецЕсли;  
	    Запись.РабочееМесто = ВыбРМ; 
	    КонецЦикла;
	НаборЗаписей.Записать();
		Если флЛинейка Тогда
		ПЗ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ПЗ.Линейка = Объект.Линейка;
		ПЗ.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьЛинейкуПоРМ(РМ)
Возврат(РМ.Линейка);
КонецФункции

&НаКлиенте
Процедура ИзменитьПервыйЭтапПЗ(Команда,флЛинейка = Ложь)  
Ф = ПолучитьФорму("Справочник.РабочиеМестаЛинеек.Форма.ФормаВыбораПоЛинейке");
ЭлементОтбора = Ф.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Линейка");
ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
ЭлементОтбора.Использование = Истина;
ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
ЭлементОтбора.ПравоеЗначение = Объект.Линейка;
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	ИзменитьПервыйЭтапПЗНаСервере(Результат,флЛинейка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛинейкаПриИзменении(Элемент)
ИзменитьПервыйЭтапПЗ(Неопределено,Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
//ОбщийМодульРаботаСРегистрами.СоздатьНомерОчереди(Объект.Ссылка,Объект.НомерОчереди);
КонецПроцедуры
