
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("Документ") Тогда	
	Документ = ЭтаФорма.Параметры.Документ;
	МестоХранения = Документ.МестоХранения;
	ДатаПоступления = Документ.Дата;
	ПолучитьИзДокумента(); 	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
   Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
      ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры

&НаСервере
Процедура ДобавитьМПЗ(НаименованиеSMD,Количество)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Материалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.НаименованиеSMD ПОДОБНО &НаименованиеSMD";
Запрос.УстановитьПараметр("НаименованиеSMD", НаименованиеSMD+"%");
РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
	Сообщить(НаименованиеSMD + " - материал не найден!");
	Возврат;
	КонецЕсли;
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ_МПЗ = ТаблицаМПЗ.Добавить();
	ТЧ_МПЗ.МПЗ = ВыборкаДетальныеЗаписи.Ссылка;
	ТЧ_МПЗ.Количество = Количество;
	ТЧ_МПЗ.Обработан = Истина;
	ТЧ_Т = ТЧ_МПЗ.Тары.Добавить();
	ТЧ_Т.КоличествоТар = 1;
	ТЧ_Т.КоличествоВТаре = Количество;
	ТЧ_Т.Итого = Количество;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ЭтаФорма.ВводДоступен() Тогда
		Если Найти(Данные,"*") > 0 Тогда
		Массив = ОбщийМодульВызовСервера.РазложитьСтрокуВМассив(Данные,"$");
		ДобавитьМПЗ(Сред(Массив[0],2),Число(СтрЗаменить(Массив[2],"*",""))); 
		Иначе
		Сообщить("Неверный QRCode!");
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПолучитьИзДокумента()
	Для каждого ТЧ Из Документ.ТабличнаяЧасть Цикл
	ТЧ_МПЗ = ТаблицаМПЗ.Добавить();
	ТЧ_МПЗ.МПЗ = ТЧ.МПЗ;
	ТЧ_МПЗ.Количество = ТЧ.Количество;
	ТЧ_МПЗ.Обработан = Истина;
	ТЧ_Т = ТЧ_МПЗ.Тары.Добавить();
	ТЧ_Т.КоличествоТар = 1;
	ТЧ_Т.КоличествоВТаре = ТЧ.Количество;
	ТЧ_Т.Итого = ТЧ.Количество;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ДокументПриИзмененииНаСервере()
ТаблицаМПЗ.Очистить();
МестоХранения = Справочники.МестаХранения.ПустаяСсылка();
ДатаПоступления = Дата(1,1,1);
	Если Документ <> Неопределено Тогда
		Если Не Документ.Пустая() Тогда
		МестоХранения = Документ.МестоХранения;
		ДатаПоступления = Документ.Дата;
		ПолучитьИзДокумента();
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
ДокументПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТаблицаМПЗТарыПриИзмененииНаСервере(Стр)
ТЧ = ТаблицаМПЗ.НайтиПоИдентификатору(Стр);
	Если ТЧ.Тары.Количество() > 0 Тогда
	ТЧ.Обработан = Истина;
	Иначе	
	ТЧ.Обработан = Ложь;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМПЗТарыПриИзменении(Элемент)
ТаблицаМПЗТарыПриИзмененииНаСервере(Элементы.ТаблицаМПЗ.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицу(Команда)
ТаблицаМПЗ.Очистить();
Документ = Неопределено;
МестоХранения = Неопределено;
ДатаПоступления = Дата(1,1,1);
КонецПроцедуры

&НаСервере
Функция ПолучитьСледующийНомер(Н)
Номер = Н.СледующийНомер;
Нумератор = Н.ПолучитьОбъект();
Нумератор.СледующийНомер = Нумератор.СледующийНомер+1;
Нумератор.Записать();
Возврат(Номер);
КонецФункции 

&НаСервере
Функция ПечатьНаСервере()
Н = Справочники.НумераторБарКодов.НайтиПоРеквизиту("Подразделение",Справочники.Подразделения.НайтиПоНаименованию("Богородицк линия SMD",Истина));
	Если Н.Пустая() Тогда
	Сообщить("Не создан нумератор бар-кодов для Богородицк линия SMD!");
	Возврат(Неопределено);
	КонецЕсли;
ТабДок = Новый ТабличныйДокумент;	

Макет = ПолучитьОбщийМакет("QRКодSMD");
ОблQRКод = Макет.ПолучитьОбласть("QRКод");
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1; 
		Для каждого ТЧ Из ТаблицаМПЗ Цикл
			Если ТЧ.Пометка Тогда
				Если Не ТЧ. Пропустить и ТЧ.Обработан Тогда
				Ст = "";
				C = "";
				П = "";
				Я = "";
				ЯХ = РегистрыСведений.ЯчейкиХранения.Выбрать(Новый Структура("МПЗ",ТЧ.МПЗ));
					Пока ЯХ.Следующий() Цикл
						Если ЯХ.МестоХранения = МестоХранения Тогда
						Ст = ЯХ.Стеллаж;
						C = ЯХ.Стойка;
						П = ЯХ.Полка;
						Я = ЯХ.Ячейка;
						КонецЕсли; 	
					КонецЦикла;
						Для каждого ТЧ_Т Из ТЧ.Тары Цикл
							Для к = 1 По ТЧ_Т.КоличествоТар Цикл
							Номер = ПолучитьСледующийНомер(Н);
							QRCode = "*"+СокрЛП(ТЧ.МПЗ.НаименованиеSMD)+"$"+Формат(Номер,"ЧГ=0")+"$"+Формат(ТЧ_Т.КоличествоВТаре,"ЧГ=0")+"*"; //СтрЗаменить(МояСтрокаИзЧисла,Символы.НПП,"")
							ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRCode, 0, 100);	
								Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
								КартинкаQRКода = Новый Картинка(ДанныеQRКода);
								ОблQRКод.Рисунки.QRCode.Картинка = КартинкаQRКода;
								Иначе
								Сообщить("Не удалось сформировать QR-код!");
								КонецЕсли;
							ОблQRКод.Параметры.Номер = Номер;
							ОблQRКод.Параметры.Наимен = СокрЛП(ТЧ.МПЗ.НаименованиеSMD);
							ОблQRКод.Параметры.Группа = СокрЛП(ПолучитьВерхнегоРодителя(ТЧ.МПЗ).Наименование);
							ОблQRКод.Параметры.Кол = ТЧ_Т.КоличествоВТаре; 
							ОблQRКод.Параметры.Дата = Формат(ДатаПоступления,"ДФ=dd.MM.yyyy");					
							ОблQRКод.Параметры.Ст = Ст;
							ОблQRКод.Параметры.C = C;
							ОблQRКод.Параметры.П = П;
							ОблQRКод.Параметры.Я = Я;
							ТабДок.Вывести(ОблQRКод);
							ТабДок.ВывестиГоризонтальныйРазделительСтраниц();							
							КонецЦикла;  
						КонецЦикла;
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	ТабДок.РазмерСтраницы = "Custom";
	ТабДок.ШиринаСтраницы = 58;
	ТабДок.ВысотаСтраницы = 30;
	ТабДок.ПолеСлева = 0;
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСнизу = 0;
	ТабДок.ПолеСправа = 0;
	ТабДок.РазмерКолонтитулаСверху = 0;
	ТабДок.РазмерКолонтитулаСнизу = 0;
	Возврат(ТабДок);
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат(Неопределено);
	КонецПопытки;  
КонецФункции

&НаСервере
Функция ПроверкаТаблицыМПЗ()
флПройдена = Истина;
	Для каждого ТЧ Из ТаблицаМПЗ Цикл
		Если Не ТЧ.Пропустить и Не ТЧ.Обработан Тогда
		Сообщить(СокрЛП(ТЧ.МПЗ.Наименование) + " - не обработан!");
		флПройдена = Ложь;
		КонецЕсли;
			Если ТЧ.Обработан Тогда			
			КоличествоВТареВсего = 0;
				Для каждого ТЧ_Т Из ТЧ.Тары Цикл
					Если ТЧ_Т.КоличествоТар  = 0 Тогда
					Сообщить(СокрЛП(ТЧ.МПЗ.Наименование) + " - не заполнено одно из количеств тар!");
					флПройдена = Ложь;
					КонецЕсли;
						Если ТЧ_Т.КоличествоВТаре  = 0 Тогда
						Сообщить(СокрЛП(ТЧ.МПЗ.Наименование) + " - не заполнено одно из количеств в таре!");
						флПройдена = Ложь;
						КонецЕсли;
				КоличествоВТареВсего = КоличествоВТареВсего + ТЧ_Т.КоличествоВТаре*ТЧ_Т.КоличествоТар;
				КонецЦикла;
					Если ТЧ.Количество <> КоличествоВТареВсего Тогда
					Сообщить(СокрЛП(ТЧ.МПЗ.Наименование) + " - не совпадает общее кол-во и кол-во в тарах!");
					флПройдена = Ложь;
					КонецЕсли;
						Если Не ЗначениеЗаполнено(ТЧ.МПЗ.НаименованиеSMD) Тогда
						Сообщить(СокрЛП(ТЧ.МПЗ.Наименование) + " - не заполнено наименование SMD!");
						флПройдена = Ложь;
						КонецЕсли;   
			КонецЕсли;  
	КонецЦикла; 
Возврат(флПройдена);
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если ПроверкаТаблицыМПЗ() Тогда
		ТабДок = ПечатьНаСервере();
			Если ТабДок <> неопределено Тогда	
			ТабДок.Показать("Этикетки маркировки SMD");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьНеобработанныйОстаток(Стр)
КоличествоОстаток = 0;
ТЧ = ТаблицаМПЗ.НайтиПоИдентификатору(Стр);
	Для каждого ТЧ_Т Из ТЧ.Тары Цикл
	КоличествоОстаток = КоличествоОстаток + ТЧ_Т.КоличествоТар*ТЧ_Т.КоличествоВТаре;
	КонецЦикла;
КоличествоОстаток = ТЧ.Количество - КоличествоОстаток; 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМПЗТарыКоличествоТарПриИзменении(Элемент)
Элементы.ТаблицаМПЗТары.ТекущиеДанные.Итого = Элементы.ТаблицаМПЗТары.ТекущиеДанные.КоличествоТар*Элементы.ТаблицаМПЗТары.ТекущиеДанные.КоличествоВТаре;
ПолучитьНеобработанныйОстаток(Элементы.ТаблицаМПЗ.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМПЗТарыКоличествоВТареПриИзменении(Элемент)
Элементы.ТаблицаМПЗТары.ТекущиеДанные.Итого = Элементы.ТаблицаМПЗТары.ТекущиеДанные.КоличествоТар*Элементы.ТаблицаМПЗТары.ТекущиеДанные.КоличествоВТаре; 
ПолучитьНеобработанныйОстаток(Элементы.ТаблицаМПЗ.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМПЗПриАктивизацииСтроки(Элемент)
	Если Элементы.ТаблицаМПЗ.ТекущаяСтрока <> Неопределено Тогда
	ПолучитьНеобработанныйОстаток(Элементы.ТаблицаМПЗ.ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗарузитьИзФайлаНаСервере(Наименование,Количество)
Материал = Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина);
	Если Не Материал.Пустая() Тогда
	ТЧ = ТаблицаМПЗ.Добавить();
	ТЧ.МПЗ = Материал;
	ТЧ.Количество = Количество;
	Иначе
	Сообщить(Наименование+" - материал не найден!");
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ЗарузитьИзФайла(Команда)
ТаблицаМПЗ.Очистить();
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл со списком материалов SMD");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка материалов SMD...");
		ЗарузитьИзФайлаНаСервере(СокрЛП(ExcelЛист.Cells(к,1).Value),Число(ExcelЛист.Cells(к,2).Value));
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого ТЧ Из ТаблицаМПЗ Цикл	
	ТЧ.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из ТаблицаМПЗ Цикл	
	ТЧ.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры
