
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("Спецификация") Тогда
	Объект.Спецификация = ЭтаФорма.Параметры.Спецификация;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура РаскрытьНаМПЗ(ЭтапСпецификации)
ВыборкаНР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_М(ЭтапСпецификации,ТекущаяДата());
	Пока ВыборкаНР.Следующий() Цикл
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
			Если СписокЭлементов.Количество() > 0 Тогда
				Если СписокЭлементов.НайтиПоЗначению(ВыборкаНР.Элемент) = Неопределено Тогда
				Продолжить;
				КонецЕсли;		
			КонецЕсли; 
		НР = ВыборкаНР.Ссылка.ПолучитьОбъект();
		НР.Корневой = Истина;
		НР.Записать();			
		Иначе
		РаскрытьНаМПЗ(ВыборкаНР.Элемент); 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьНаСервере()
	Если Объект.Спецификация.ЭтоГруппа Тогда
	Выборка = Справочники.Номенклатура.ВыбратьИерархически(Объект.Спецификация);
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ЭтоГруппа Тогда
			РаскрытьНаМПЗ(Выборка.Ссылка);
			КонецЕсли; 
		КонецЦикла; 
	Иначе
	РаскрытьНаМПЗ(Объект.Спецификация);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Зафиксировать(Команда)
Состояние("Обработка...","Фиксация корневых элементов...");
ЗафиксироватьНаСервере();
КонецПроцедуры
