
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Элементы.Проект.Видимость = ЭтаФорма.Параметры.Проектный;
Параметры.ТипСправочника = ЭтаФорма.Параметры.ТипСправочника;
Параметры.СписокПочтовойРассылки.ЗагрузитьЗначения(ЭтаФорма.Параметры.СписокРассылки);
НаДату = НачалоМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
НаДату = НачалоМесяца(НаДату);
КонецПроцедуры
          
&НаСервере
Процедура СоздатьТабличныйДокумент(ТабДок,ТабДокОшибок)
ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("ИзменениеПерспективногоПлана"); 
ОблШапка = Макет.ПолучитьОбласть("Шапка|Наименование");
ОблШапкаПериод = Макет.ПолучитьОбласть("Шапка|Период");	
 
ОблШапка.Параметры.ДатаНач = Формат(НаДату,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(ДобавитьМесяц(НаДату,КоличествоМесяцев-1),"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаВывода = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);                              

Макет = ОбъектЗн.ПолучитьМакет("ФайлОшибок");
ОблШапкаОшибок = Макет.ПолучитьОбласть("Шапка|Общая");
ОблПериодОшибок = Макет.ПолучитьОбласть("Шапка|Период");

ТабДокОшибок.Вывести(ОблШапкаОшибок);

ТекДата = НачалоМесяца(НаДату);
	Для к = 1 по КоличествоМесяцев Цикл
	ОблШапкаПериод.Параметры.ММГГ = Формат(ТекДата,"ДФ=MM.yy"); 
	ТабДок.Присоединить(ОблШапкаПериод);
	ОблПериодОшибок.Параметры.ПП = Формат(ТекДата,"ДФ=MM.yy");			
	ТабДокОшибок.Присоединить(ОблПериодОшибок);	
	ТекДата = ДобавитьМесяц(ТекДата,1);
	КонецЦикла;
КонецПроцедуры  

&НаСервере
Функция ПолучитьEmailСотрудника()
Возврат(ПараметрыСеанса.Пользователь.Email);
КонецФункции

&НаСервере
Функция ПолучитьEmailПолучателя(Сотрудник)
Возврат(Сотрудник.Email);
КонецФункции

&НаКлиенте
Процедура ПочтоваяРассылка(ТабДок,ТабДокОшибок,ЕстьОшибки)
	Если Параметры.СписокПочтовойРассылки.Количество() = 0 Тогда
	Сообщить("Нет списка почтовой рассылки!");
	Возврат;
	КонецЕсли;
EmailСотрудника = ПолучитьEmailСотрудника();
Сообщение = Новый ИнтернетПочтовоеСообщение;
ИПП = Новый ИнтернетПочтовыйПрофиль; 

НастройкиПочты = ОбщийМодульВызовСервера.ПолучитьНастройкиПочты();
ИПП.АдресСервераSMTP = НастройкиПочты.АдресСервераSMTP; 
ИПП.ПортSMTP = НастройкиПочты.ПортSMTP;
ИПП.ВремяОжидания = 60; 
ИПП.Пароль = НастройкиПочты.ПарольПочтовогоСервера; 
ИПП.Пользователь = EmailСотрудника; 
	Для каждого Стр Из Параметры.СписокПочтовойРассылки Цикл
    Сообщение.Получатели.Добавить(ПолучитьEmailПолучателя(Стр.Значение));
	КонецЦикла; 
Сообщение.Отправитель.Адрес = EmailСотрудника;
Сообщение.Тема = "Загружен перспективный план с "+Формат(НаДату,"ДФ=dd.MM.yyyy")+" по "+Формат(ДобавитьМесяц(НаДату,КоличествоМесяцев-1),"ДФ=dd.MM.yyyy"); 
Текст = "Здравствуйте!";
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "Загружен перспективный план с "+Формат(НаДату,"ДФ=dd.MM.yyyy")+" по "+Формат(ДобавитьМесяц(НаДату,КоличествоМесяцев-1),"ДФ=dd.MM.yyyy");	
ИмяФайла = ПолучитьИмяВременногоФайла("xls");
ТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
Сообщение.Вложения.Добавить(ИмяФайла,"Перспективный план за период");	
	Если ЕстьОшибки Тогда
	ИмяФайла = ПолучитьИмяВременногоФайла("xls");
	ТабДокОшибок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
	Сообщение.Вложения.Добавить(ИмяФайла,"Ошибки загрузки");
	Текст = Текст + Символы.ПС+ "";
	Текст = Текст + Символы.ПС+ "Есть ошибки загрузки (см. второй приложенный файл).";
	КонецЕсли;
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "С уважением, email: "+EmailСотрудника;
Сообщение.Тексты.Добавить(Текст);
// Подключиться и отправить. 
Почта = Новый ИнтернетПочта; 
Почта.Подключиться(ИПП);
Почта.Послать(Сообщение); 
Почта.Отключиться();
ПоказатьОповещениеПользователя("Сообщение отправлено!");	
КонецПроцедуры
            
&НаСервере
Функция ЗагрузитьНаСервере(ТабДок,ТабДокОшибок)
ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("ИзменениеПерспективногоПлана"); 
ОблСтрока = Макет.ПолучитьОбласть("Строка|Наименование");
ОблСтрокаПериод = Макет.ПолучитьОбласть("Строка|Период");

Макет = ОбъектЗн.ПолучитьМакет("ФайлОшибок");
ОблСтрокаОшибок = Макет.ПолучитьОбласть("Строка|Общая");
ОблПериодОшибок = Макет.ПолучитьОбласть("Строка|Период");
флОшибки = Ложь;                
	Для каждого ТЧ Из ТаблицаПП Цикл
		Если ЗначениеЗаполнено(ТЧ.Номенклатура) Тогда
		ТекДата = НаДату;
		ОблСтрока.Параметры.Статус = ТЧ.Статус;
		ОблСтрока.Параметры.Наименование = СокрЛП(ТЧ.Наименование);
		ТабДок.Вывести(ОблСтрока);
			Для каждого Стр Из ТЧ.СписокМесяцев Цикл
			РегПП = РегистрыСведений.ПерспективныеПланы.Получить(ТекДата,Новый Структура("МПЗ,Проект",ТЧ.Номенклатура,Проект));
			РегППНовый = РегистрыСведений.ПерспективныеПланы.СоздатьМенеджерЗаписи();
			РегППНовый.Период = ТекДата;
			РегППНовый.МПЗ = ТЧ.Номенклатура;
			РегППНовый.Проект = Проект; 
			РегППНовый.Количество = Стр.Значение;
			РегППНовый.Записать(Истина);
			ОблСтрокаПериод.Параметры.КолППСтарое = РегПП.Количество;
			ОблСтрокаПериод.Параметры.КолППНовое = Стр.Значение;
			ТабДок.Присоединить(ОблСтрокаПериод);
			ТекДата = ДобавитьМесяц(ТекДата,1);
			КонецЦикла;	
		Иначе
		ОблСтрокаОшибок.Параметры.Наименование = СокрЛП(ТЧ.Наименование);
		ТабДокОшибок.Вывести(ОблСтрокаОшибок);
			Для каждого Стр Из ТЧ.СписокМесяцев Цикл
			ОблПериодОшибок.Параметры.ПП = Стр.Значение;
			ТабДокОшибок.Присоединить(ОблПериодОшибок);
			ТекДата = ДобавитьМесяц(ТекДата,1);
			КонецЦикла; 
		флОшибки = Истина;
		КонецЕсли;	
	КонецЦикла; 
Возврат(флОшибки);
КонецФункции

&НаКлиенте
Процедура КнопкаОК(Команда)
	Если Элементы.Проект.Видимость Тогда
		Если Не ЗначениеЗаполнено(Проект) Тогда
		Сообщить("Выберите проект разработки!");
		Возврат;
		КонецЕсли;	
	КонецЕсли;
		Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ТабДок = Новый ТабличныйДокумент;
		ТабДокОшибок = Новый ТабличныйДокумент;

		СоздатьТабличныйДокумент(ТабДок,ТабДокОшибок);
		Результат = ЗагрузитьНаСервере(ТабДок,ТабДокОшибок);
		ТабДок.Показать("Изменение помесячных перспективных планов");
			Если Результат Тогда
			ТабДокОшибок.Показать("Ошибки загрузки");
			КонецЕсли;
		ПочтоваяРассылка(ТабДок,ТабДокОшибок,Результат);
		ЭтаФорма.Закрыть(Истина);
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры
                  
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(Наименование,СписокМесяцев)
ТЧ = ТаблицаПП.Добавить();
ТЧ.Наименование = Наименование;     
	Для каждого Кол Из СписокМесяцев Цикл
	ТЧ.СписокМесяцев.Добавить(Кол.Значение);
	КонецЦикла;
		Если Параметры.ТипСправочника = 1 Тогда
		Выборка = Справочники.Материалы.Выбрать(,,Новый Структура("Наименование",Наименование));
		Иначе
		Выборка = Справочники.Номенклатура.Выбрать(,,Новый Структура("Наименование",Наименование));
		КонецЕсли;
флВыбран = Ложь;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда
		Продолжить;
		КонецЕсли;                            
	Статус = ПолучитьСтатус(Выборка.Ссылка);
	ТЧ_ТН = ТЧ.ТаблицаНоменклатуры.Добавить();
	ТЧ_ТН.Номенклатура = Выборка.Ссылка;
	ТЧ_ТН.Статус = Статус;	
		Если Параметры.ТипСправочника = 1 Тогда
			Если Статус = Перечисления.СтатусыМПЗ.Запрещённая Тогда
			Продолжить;
			КонецЕсли;
		Иначе
			Если Статус = Перечисления.СтатусыСпецификаций.Запрещённая Тогда
			Продолжить;
			КонецЕсли;
		КонецЕсли; 
			Если Проект.Пустая() Тогда
				Если Параметры.ТипСправочника = 1 Тогда
					Если Статус = Перечисления.СтатусыМПЗ.ОНР Тогда
					Продолжить;
					КонецЕсли;
				Иначе
					Если (Статус <> Перечисления.СтатусыСпецификаций.Предсерийная)и
						 (Статус <> Перечисления.СтатусыСпецификаций.Серийная) Тогда
					Продолжить;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
	ТЧ.Номенклатура = Выборка.Ссылка;
	ТЧ.Статус = Статус;
	флВыбран = Истина;
	КонецЦикла; 
		Если Не флВыбран Тогда
			Если ТЧ.ТаблицаНоменклатуры.Количество() = 0 Тогда
			ТЧ.Комментарий = "не найдена";
			Иначе
			ТЧ.Комментарий = "не выбрана из имеющихся";						
			КонецЕсли;		
		КонецЕсли;
КонецПроцедуры
             
&НаКлиенте
Функция ПроверитьФайл(Результат,КоличествоМесяцев)
	Попытка
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	НомСтр = 0;
	    Для к = 2 по КолСтрок Цикл
		НомСтр = к; 
		Состояние("Обработка...",к*100/КолСтрок,"Проверка файла...");
			Для л = 2 По КоличествоМесяцев + 1 Цикл
			Кол = Число(ExcelЛист.Cells(к,л).Value);
			КонецЦикла;
		КонецЦикла;
	Исключение
	Сообщить("Ошибка в строке "+НомСтр);
	Сообщить(ОписаниеОшибки());
	Возврат(Ложь);	
	КонецПопытки;
Возврат(Истина);
КонецФункции 

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ТаблицаПП.Очистить();
	Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c перспективным планом");
		Если Результат <> Неопределено Тогда
		Состояние("Обработка...",,"Проверка файла...");
			Если Не ПроверитьФайл(Результат,КоличествоМесяцев) Тогда
			Возврат;
			КонецЕсли;
		ExcelЛист = Результат.ExcelЛист;
		КолСтрок = Результат.КоличествоСтрок;
		КолКолонок = Результат.КоличествоКолонок;
		КоличествоМесяцев = КолКолонок - 1;
		    Для к = 2 по КолСтрок Цикл 
			Состояние("Обработка...",к*100/КолСтрок,"Создание списка номенклатуры из файла...");
			СписокМесяцев = Новый СписокЗначений;

				Для л = 2 По КоличествоМесяцев + 1 Цикл
				СписокМесяцев.Добавить(Число(ExcelЛист.Cells(к,л).Value));
				КонецЦикла; 
			ЗагрузитьИзФайлаНаСервере(СокрЛП(ExcelЛист.Cells(к,1).Value),СписокМесяцев);
		    КонецЦикла;
		Результат.Excel.Quit();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
