
&НаСервере
Процедура ЗагрузитьИзмененияНаСервере(Наименование,Кратность)
МПЗ = Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина);
	Если Не МПЗ.Пустая() Тогда
	МПЗОбъект = МПЗ.ПолучитьОбъект();
	МПЗОбъект.КратностьЗаготовки = Кратность;
	МПЗОбъект.Записать();
	Иначе
	Сообщить(""+Наименование+" - материал не найден!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзменения(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл с кратностью заготовой 0-плат");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка кратности заготовок 0-плат...");
			Попытка
			ЗагрузитьИзмененияНаСервере(СокрЛП(ExcelЛист.Cells(к,1).Value),Число(ExcelЛист.Cells(к,2).Value));
			Исключение
			Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
