
&НаСервере
Процедура ПечатьННСНаСервере(ННС,ТабДок)
ТаблицаННС = Новый ТаблицаЗначений;

ТаблицаННС.Колонки.Добавить("Товар");
ТаблицаННС.Колонки.Добавить("Продукция");
ТаблицаННС.Колонки.Добавить("ГруппаЛинеек");
ТаблицаННС.Колонки.Добавить("Порядок");
ТаблицаННС.Колонки.Добавить("Количество");

Макет = Документы.НакладнаяНаСборку.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблТовар = Макет.ПолучитьОбласть("Товар");
ОблКонец = Макет.ПолучитьОбласть("Конец");

	Для каждого ТЧ Из ННС.ТабличнаяЧасть Цикл	
	ТЧ_ННС = ТаблицаННС.Добавить();
	ТЧ_ННС.Товар = ТЧ.Товар;
	ТЧ_ННС.Продукция = ТЧ.Продукция;	
	ТЧ_ННС.ГруппаЛинеек = ТЧ.Продукция.Линейка.Родитель;
	ТЧ_ННС.Порядок = ТЧ.Продукция.Линейка.Родитель.Порядок;
	ТЧ_ННС.Количество = ТЧ.Количество;
	КонецЦикла;
ТаблицаННС.Свернуть("Порядок,ГруппаЛинеек,Товар,Продукция","Количество");
ТаблицаННС.Сортировать("Порядок,ГруппаЛинеек,Товар,Продукция");
КоличествоВсего = 0;
ОблШапка.Параметры.Контрагент = ННС.Контрагент;
ОблШапка.Параметры.ТранспортнаяКомпания = ННС.КартаДоставки.ТрансКом;
ОблШапка.Параметры.Город = ННС.КартаДоставки.Город;
ОблШапка.Параметры.Номер = ННС.Номер;
ОблШапка.Параметры.ДатаОтгрузки = Формат(ННС.ДатаОтгрузки,"ДЛФ=DD")+" ("+Формат(ННС.ДатаОтгрузки,"ДФ=дддд")+")";
ОблШапка.Параметры.НомерЛинейкиУпаковки = ННС.ЛинейкаУпаковки;
СписокСчетов = Новый СписокЗначений;

	Для каждого ТЧ Из ННС.ТабличнаяЧасть Цикл
	Выборка = СписокСчетов.НайтиПоЗначению(СокрЛП(ТЧ.ЗаказНаПроизводство.Номер));
		Если Выборка = Неопределено Тогда
		СписокСчетов.Добавить(СокрЛП(ТЧ.ЗаказНаПроизводство.Номер));		
		КонецЕсли; 
	КонецЦикла;
ОблШапка.Параметры.НомераСчетов = СписокСчетов; 
ТабДок.Вывести(ОблШапка);
QRCode = СокрЛП(ННС.Номер)+";"+ЗначениеВСтрокуВнутр(ННС.Ссылка);
	Для каждого ТЧ Из ТаблицаННС Цикл 
	ОблТовар.Параметры.Линейка = ТЧ.ГруппаЛинеек;		
	ОблТовар.Параметры.Товар = ТЧ.Товар;
	ОблТовар.Параметры.Артикул = ТЧ.Товар.Код;
	ОблТовар.Параметры.Количество = ТЧ.Количество;
	ОблТовар.Параметры.ЕдиницаИзмерения = СокрЛП(ТЧ.Продукция.ЕдиницаИзмерения.Наименование);
	ОблТовар.Параметры.Стеллаж = "";
	ОблТовар.Параметры.Стойка = "";
	ОблТовар.Параметры.Полка = "";
	ОблТовар.Параметры.Ячейка = "";
	ЯчейкиХранения = РегистрыСведений.ЯчейкиХранения.Выбрать(Новый Структура("МПЗ",ТЧ.Продукция));
		Пока ЯчейкиХранения.Следующий() Цикл
		ОблТовар.Параметры.Стеллаж = ЯчейкиХранения.Стеллаж;
		ОблТовар.Параметры.Стойка = ЯчейкиХранения.Стойка;
		ОблТовар.Параметры.Полка = ЯчейкиХранения.Полка;
		ОблТовар.Параметры.Ячейка = ЯчейкиХранения.Ячейка;		
		КонецЦикла;	
	ТабДок.Вывести(ОблТовар);
	QRCode = QRCode+";"+Формат(ТЧ.Товар.Код,"ЧЦ=6; ЧГ=0")+";"+ТЧ.Количество;
	КоличествоВсего = КоличествоВсего + ТЧ.Количество;
	КонецЦикла;
ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRCode, 0, 500);	
	Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
	КартинкаQRКода = Новый Картинка(ДанныеQRКода);
	ОблКонец.Рисунки.QRCode.Картинка = КартинкаQRКода;
	Иначе
	Сообщить("Не удалось сформировать QR-код!");
	КонецЕсли;
ОблКонец.Параметры.Количество = КоличествоВсего;
ОблКонец.Параметры.Комментарий = ННС.Комментарий;
ТабДок.Вывести(ОблКонец);
ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьННС(Команда)
ТабДок = Новый ТабличныйДокумент;

	Для каждого ТЧ Из Элементы.Список.ВыделенныеСтроки Цикл
	ПечатьННСНаСервере(ТЧ,ТабДок);
	КонецЦикла;
ТабДок.ПолеСлева =0;
ТабДок.ПолеСверху = 0;
ТабДок.ПолеСнизу = 0;
ТабДок.ПолеСправа = 0;
ТабДок.РазмерКолонтитулаСверху = 0;
ТабДок.РазмерКолонтитулаСнизу = 0;
ТабДок.Показать("Накладные на сборку");
КонецПроцедуры
