Перем НовыйОбъект;

Процедура ПриЗаписи(Отказ)
	Если НовыйОбъект Тогда
		Если Не ЭтоГруппа Тогда
		Ставки = РегистрыСведений.Ставки.СоздатьМенеджерЗаписи();
		Ставки.Период = ТекущаяДата();
		Ставки.МПЗ = Ссылка;
		Ставки.СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
		Ставки.Записать();
		Статус = РегистрыСведений.СтатусыМПЗ.СоздатьМенеджерЗаписи();
		Статус.Период = ТекущаяДата();
		Статус.МПЗ = Ссылка;	
		Статус.Статус = Перечисления.СтатусыМПЗ.ОНР;			
		Статус.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
                       
Функция ПолучитьID()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Материалы.ID КАК ID
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ID УБЫВ";
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.ID + 1);
	КонецЦикла;
Возврат(0);
КонецФункции

Процедура ПередЗаписью(Отказ)
НовыйОбъект = ЭтоНовый();
	Если ЭтоНовый() Тогда
		Если Не ЭтоГруппа Тогда
		ID = ПолучитьID();
			Если Не Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина).Пустая() Тогда
			Сообщить(Наименование + " - наименование материала существует!");	
			Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
ID = "";
ГруппаПоЗакупкам = Перечисления.ГруппыПоЗакупкам.ПустаяСсылка();
Артикул = "";
МинОстаток = 0;
ИмяФайла = "";
ПричинаВнесения = "";
Комментарий = "";
СрокПоставки = 0;
Товар = Справочники.Товары.ПустаяСсылка();
Проект = Справочники.Проекты.ПустаяСсылка();
Производитель = Справочники.Производители.ПустаяСсылка();
ИнициаторВнесения = Справочники.Сотрудники.ПустаяСсылка();
PartNumber = "";
ОписаниеМодели = "";
МаксимальныйЗапас = 0;
СтраховойЗапас = 0;
КоличествоКЗаказу = 0;
ТочкаЗаказа = 0;
ПиковыеПродажи = 0;
ОсновнаяЕдиницаИзмерения = Справочники.ОсновныеЕдиницыИзмерений.ПустаяСсылка();
Аналоги.Очистить();
СтационарныеПитатели.Очистить();
НаименованиеSMD = "";
КратностьЗаготовки = 0;
КратностьУпаковки = 0;
КонецПроцедуры
