
&НаСервере
Процедура ПолучитьУдаленныеДокументыНаСервере()
СписокДокументов.Очистить();
Запрос = Новый Запрос;
                       
	Если Регистр = 0 Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МестаХранения.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.МестаХранения КАК МестаХранения
		|ГДЕ
		|	МестаХранения.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И МестаХранения.Регистратор.Ссылка ЕСТЬ NULL
		|	И НЕ МестаХранения.Регистратор = &ПустаяСсылкаДокумента";	
	Иначе	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПередачиВПроизводство.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ПередачиВПроизводство КАК ПередачиВПроизводство
		|ГДЕ
		|	ПередачиВПроизводство.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И ПередачиВПроизводство.Регистратор.Ссылка ЕСТЬ NULL
		|	И НЕ ПередачиВПроизводство.Регистратор = &ПустаяСсылкаДокумента";	
	КонецЕсли;
Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания);
Запрос.УстановитьПараметр("ПустаяСсылкаДокумента",Неопределено);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокДокументов.Добавить(ВыборкаДетальныеЗаписи.Регистратор,,Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьУдаленныеДокументы(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ПолучитьУдаленныеДокументыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписиРегистраНаСервере()
	Если Регистр = 0 Тогда
		Для каждого Док Из СписокДокументов Цикл
			Если Док.Пометка Тогда
		    Набор = РегистрыНакопления.МестаХранения.СоздатьНаборЗаписей();
		    Набор.Отбор.Регистратор.Установить(Док.Значение);
		    Набор.Записать();
			КонецЕсли;		
		КонецЦикла;
	Иначе
		Для каждого Док Из СписокДокументов Цикл
			Если Док.Пометка Тогда
		    Набор = РегистрыНакопления.ПередачиВПроизводство.СоздатьНаборЗаписей();
		    Набор.Отбор.Регистратор.Установить(Док.Значение);
		    Набор.Записать();
			КонецЕсли;		
		КонецЦикла;
   	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписиРегистра(Команда)
УдалитьЗаписиРегистраНаСервере();
КонецПроцедуры
