
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
	УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение,Дата));
	КонецЕсли;
КонецПроцедуры

Процедура РаскрытьНаМПЗ(ЭтапСпецификации,КолУзла)
ВыборкаНР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_М(ЭтапСпецификации,ДокументОснование.Дата);
	Пока ВыборкаНР.Следующий() Цикл
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
		ТЧ = ТабличнаяЧасть.Добавить();
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
		ТЧ.МПЗ = ВыборкаНР.Элемент;
		ТЧ.Количество = ВыборкаНР.Норма*КолУзла;
		ТЧ.ЕдиницаИзмерения = ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения;					
		Иначе
			Если Не ВыборкаНР.Элемент.Канбан.Пустая() Тогда
			ТЧ = ТабличнаяЧасть.Добавить();
			ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
			ТЧ.МПЗ = ВыборкаНР.Элемент;
			ТЧ.Количество = ВыборкаНР.Норма*КолУзла;
			ТЧ.ЕдиницаИзмерения = ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения;					
			Продолжить;						
			КонецЕсли; 				
		РаскрытьНаМПЗ(ВыборкаНР.Элемент,ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура РаскрытьНаНормыРасходов(ЭтапСпецификации,КолУзла)
ВыборкаНР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_М(ЭтапСпецификации,ДокументОснование.Дата);
	Пока ВыборкаНР.Следующий() Цикл
	ТЧ = ТабличнаяЧасть.Добавить();
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
		Иначе	
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
		КонецЕсли;
	ТЧ.МПЗ = ВыборкаНР.Элемент;
	ТЧ.Количество = ВыборкаНР.Норма*КолУзла;
	ТЧ.ЕдиницаИзмерения = ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьОставшеесяКоличество()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеИзПереработки.Количество
	|ИЗ
	|	Документ.ПоступлениеИзПереработки КАК ПоступлениеИзПереработки
	|ГДЕ
	|	ПоступлениеИзПереработки.ДокументОснование = &ДокументОснование
	|	И ПоступлениеИзПереработки.Проведен = ИСТИНА";
Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
КоличествоПоступило = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	КоличествоПоступило = КоличествоПоступило + ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
Возврат(ДокументОснование.Количество - КоличествоПоступило);
КонецФункции 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Неопределено") Тогда
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	ОставшеесяКоличество = ПолучитьОставшеесяКоличество();
		Если ОставшеесяКоличество > 0 Тогда
		Автор = ПараметрыСеанса.Пользователь;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор;
		МестоХранения = ДанныеЗаполнения.МестоХранения;
		Номенклатура = ДанныеЗаполнения.Номенклатура;	 
		Количество = ОставшеесяКоличество;
			Если ДанныеЗаполнения.БезСпецификации Тогда
			ТЧ = ТабличнаяЧасть.Добавить();
				Если ТипЗнч(ДанныеЗаполнения.Номенклатура) = Тип("СправочникСсылка.Материалы") Тогда
				ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;	
				Иначе	
				ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;	
				КонецЕсли; 
			ТЧ.МПЗ = ДанныеЗаполнения.Номенклатура;
			ТЧ.Количество = ОставшеесяКоличество;
			ТЧ.ЕдиницаИзмерения = ДанныеЗаполнения.Номенклатура.ОсновнаяЕдиницаИзмерения;			
			Иначе	
				Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				РаскрытьНаМПЗ(Номенклатура,Количество);
				Иначе
				РаскрытьНаНормыРасходов(Номенклатура,Количество);		
				КонецЕсли;			
			КонецЕсли; 
		Иначе
		СтандартнаяОбработка = Ложь;
		Сообщить("Изделие поступило из переработки полностью!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
// регистр ПередачиВПереработку Расход
Движения.ПередачиВПереработку.Записывать = Истина;
ВиртуальнаяТабличнаяЧасть = ТабличнаяЧасть.Выгрузить();
ВиртуальнаяТабличнаяЧасть.Свернуть("ВидМПЗ,МПЗ,ЕдиницаИзмерения","Количество");
	Для Каждого ТЧ Из ВиртуальнаяТабличнаяЧасть Цикл
	Фильтр   = Новый Структура;
	Фильтр.Вставить("МПЗ", ТЧ.МПЗ);
	Фильтр.Вставить("Контрагент",Контрагент);
	Фильтр.Вставить("Договор", Договор);
	Фильтр.Вставить("ПередачаВПереработку", ДокументОснование);
	Остаток = РегистрыНакопления.ПередачиВПереработку.Остатки(Дата,Фильтр,"МПЗ,Контрагент,Договор,ПередачаВПереработку", "Количество");
	БазовоеКоличество = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения);
		Если Остаток.Количество() > 0 Тогда
		КолОстаток = Остаток[0].Количество;
		Иначе
		КолОстаток = 0;
		КонецЕсли; 
			Если КолОстаток >= БазовоеКоличество Тогда
			Движение = Движения.ПередачиВПереработку.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Договор = Договор;
			Движение.Номенклатура = Номенклатура;
			Движение.ВидМПЗ = ТЧ.ВидМПЗ;
			Движение.МПЗ = ТЧ.МПЗ;
			Движение.ПередачаВПереработку = ДокументОснование;
			Движение.Количество = БазовоеКоличество;
			Иначе
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.УстановитьДанные(ЭтотОбъект);	
			Сообщение.Текст = "МПЗ "+ТЧ.МПЗ+" требуется списать: "+БазовоеКоличество+" остаток: "+КолОстаток;
			Сообщение.Сообщить();
			КонецЕсли; 		
	КонецЦикла;
		Если Отказ Тогда
		Возврат;
		КонецЕсли; 
// регистр ЗаказыПоставщикам Расход
	Если ЗначениеЗаполнено(ДокументОснование.ДокументОснование) Тогда
		Если ТипЗнч(ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ЗаказыПоставщикам = РегистрыНакопления.ЗаказыПоставщикам;
		Движения.ЗаказыПоставщикам.Записывать = Истина;
		Фильтр   = Новый Структура;
		Фильтр.Вставить("МПЗ", Номенклатура);
		Фильтр.Вставить("Контрагент",Контрагент);
		Фильтр.Вставить("Договор", Договор);
		Фильтр.Вставить("ДатаИсполнения", ДокументОснование.ДокументОснование.ДатаИсполнения);
		Фильтр.Вставить("ЗаказПоставщику", ДокументОснование.ДокументОснование);
		Остаток = ЗаказыПоставщикам.Остатки(Дата,Фильтр,"МПЗ,Контрагент,Договор,ДатаИсполнения,ЗаказПоставщику", "Количество");
			Если Остаток.Количество() > 0 Тогда
			КолОстаток = Остаток[0].Количество;
			Иначе
			КолОстаток = 0;
			КонецЕсли;
				Если КолОстаток < Количество Тогда
				Отказ = Истина;
				Сообщить("МПЗ "+Номенклатура+" поступило: "+Количество+" требуется по заказу: "+КолОстаток);
				КонецЕсли; 		
		Движение = Движения.ЗаказыПоставщикам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ДатаИсполнения = ДокументОснование.ДокументОснование.ДатаИсполнения;
		Движение.МПЗ = Номенклатура;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Количество = Количество;
		Движение.ЗаказПоставщику = ДокументОснование.ДокументОснование;
		КонецЕсли; 		
	КонецЕсли;
		Если Отказ Тогда
		Возврат;
		КонецЕсли;
// регистр МестаХранения Приход 
Движения.МестаХранения.Записывать = Истина;
Движение = Движения.МестаХранения.Добавить();
Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
Движение.Период = Дата;
Движение.МестоХранения = МестоХранения;
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
	Движение.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;	
	Иначе	
	Движение.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;	
	КонецЕсли;
Движение.МПЗ = Номенклатура;
Движение.Количество = Количество;
ВиртуальнаяТабличнаяЧасть = ВозвратИзПереработки.Выгрузить();
ВиртуальнаяТабличнаяЧасть.Свернуть("ВидМПЗ,МПЗ,ЕдиницаИзмерения","Количество");
	Для Каждого ТЧ Из ВиртуальнаяТабличнаяЧасть Цикл
	Фильтр   = Новый Структура;
	Фильтр.Вставить("МПЗ", ТЧ.МПЗ);
	Фильтр.Вставить("Контрагент",Контрагент);
	Фильтр.Вставить("Договор", Договор);
	Фильтр.Вставить("ПередачаВПереработку", ДокументОснование);
	Остаток = РегистрыНакопления.ПередачиВПереработку.Остатки(Дата,Фильтр,"МПЗ,Контрагент,Договор,ПередачаВПереработку", "Количество");
	БазовоеКоличество = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения);
		Если Остаток.Количество() > 0 Тогда
		КолОстаток = Остаток[0].Количество;
		Иначе
		КолОстаток = 0;
		КонецЕсли; 
			Если КолОстаток >= БазовоеКоличество Тогда
			Движение = Движения.ПередачиВПереработку.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Договор = Договор;
			Движение.Номенклатура = Номенклатура;
			Движение.ВидМПЗ = ТЧ.ВидМПЗ;
			Движение.МПЗ = ТЧ.МПЗ;
			Движение.ПередачаВПереработку = ДокументОснование;
			Движение.Количество = БазовоеКоличество;
			Иначе
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.УстановитьДанные(ЭтотОбъект);	
			Сообщение.Текст = "МПЗ "+ТЧ.МПЗ+" требуется списать: "+БазовоеКоличество+" остаток: "+КолОстаток;
			Сообщение.Сообщить();
			КонецЕсли;
	Движение = Движения.МестаХранения.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.МестоХранения = МестоХранения;
	Движение.ВидМПЗ = ТЧ.ВидМПЗ;
	Движение.МПЗ = ТЧ.МПЗ;
	Движение.Количество = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения); 		
	КонецЦикла;
КонецПроцедуры
