
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
ДатаВнесения = ТекущаяДата();
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ЭтоНовый() Тогда
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НомераГТД.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НомераГТД КАК НомераГТД
		|ГДЕ
		|	НомераГТД.Наименование = &Наименование
		|	И НомераГТД.Страна = &Страна";
	Запрос.УстановитьПараметр("Наименование", СокрЛП(Наименование));
	Запрос.УстановитьПараметр("Страна", Страна);
        Если Не Запрос.Выполнить().Пустой() Тогда
		Сообщить(Наименование + " - сочитание номера ГТД и страны существует!");	
		Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
