
&НаСервере
Функция ПолучитьКаталог(ВыбРодитель)
	Возврат(ПолучитьТекущийКаталог(ВыбРодитель));
КонецФункции

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "Все файлы (*.*)|*.*"; 
	Диалог.Фильтр = Фильтр; 
    Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = ПолучитьКаталог(Объект.Родитель);
	Если Диалог.Выбрать() Тогда
		Файл = Новый Файл(Диалог.Каталог);
		Объект.Наименование = Файл.Имя;
	КонецЕсли;
КонецПроцедуры
