
&НаСервере
Функция ПолучитьМТК(ЗаказНаПроизводство,Продукция)
СписокМТК = Новый СписокЗначений;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутнаяКарта.Ссылка
	|ИЗ
	|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ГДЕ
	|	МаршрутнаяКарта.ДокументОснование = &ДокументОснование
	|	И МаршрутнаяКарта.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	МаршрутнаяКарта.Дата";
Запрос.УстановитьПараметр("ДокументОснование",ЗаказНаПроизводство);	
Запрос.УстановитьПараметр("Номенклатура",Продукция);	
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
    СписокМТК.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
Возврат(СписокМТК);
КонецФункции 

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблЗНП = Макет.ПолучитьОбласть("ЗНП");
ОблМТК = Макет.ПолучитьОбласть("МТК");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.НаДату = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыНаПроизводствоОстатки.Документ КАК Документ,
	|	ЗаказыНаПроизводствоОстатки.Продукция КАК Продукция,
	|	ЗаказыНаПроизводствоОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПроизводство.Остатки КАК ЗаказыНаПроизводствоОстатки
	|ГДЕ
	|	ЗаказыНаПроизводствоОстатки.КоличествоОстаток > 0";
	Если ЗначениеЗаполнено(НомерСчёта) Тогда
	Запрос.Текст = Запрос.Текст + " И ЗаказыНаПроизводствоОстатки.Документ.Номер ПОДОБНО &Номер";
	Запрос.УстановитьПараметр("Номер",НомерСчёта+"%");
	КонецЕсли;
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО
								|	ЗаказыНаПроизводствоОстатки.Документ.ДатаОтгрузкиОбещанная,
								|	ЗаказыНаПроизводствоОстатки.Продукция.Наименование
								|ИТОГИ
								|	СУММА(КоличествоОстаток)
								|ПО
								|	Документ,
								|	Продукция"; 
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокумент.Следующий() Цикл
	ОблЗНП.Параметры.НомерЗНП = СокрЛП(ВыборкаДокумент.Документ.Номер);
	ОблЗНП.Параметры.ЗНП = ВыборкаДокумент.Документ;
	ОблЗНП.Параметры.ДатаОтгрузки = Формат(ВыборкаДокумент.Документ.ДатаОтгрузкиОбещанная,"ДФ=dd.MM.yyyy");
	ОблЗНП.Параметры.ТорговыйДом = ВыборкаДокумент.Документ.ТорговыйДом;
	ТабДок.Вывести(ОблЗНП);
	ВыборкаПродукция = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПродукция.Следующий() Цикл
		СписокМТК = ПолучитьМТК(ВыборкаДокумент.Документ,ВыборкаПродукция.Продукция);
			Если СписокМТК.Количество() > 0 Тогда
				Для каждого МТК Из СписокМТК Цикл
				КолВПроизводстве = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ТекущаяДата(),МТК.Значение);
					Если КолВПроизводстве > 0 Тогда
					ОблМТК.Параметры.НомерМТК = МТК.Значение.Номер;
					ОблМТК.Параметры.МТК = МТК.Значение;
					ОблМТК.Параметры.Изделие = МТК.Значение.Номенклатура;
					ОблМТК.Параметры.Кол = МТК.Значение.Количество;
					ОблМТК.Параметры.КолВПроизводстве = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ТекущаяДата(),МТК.Значение);
					ОблМТК.Параметры.СтандартныйКомментарий = МТК.Значение.СтандартныйКомментарий;
					ОблМТК.Параметры.ДатаОтгрузки = Формат(МТК.Значение.ДатаОтгрузки,"ДФ=dd.MM.yyyy");
					ТабДок.Вывести(ОблМТК);
					КонецЕсли;
				 КонецЦикла;
			Иначе
			ОблМТК.Параметры.НомерМТК = "нет";
			ОблМТК.Параметры.МТК = "";
			ОблМТК.Параметры.Изделие = ВыборкаПродукция.Продукция;
			ОблМТК.Параметры.Кол = ВыборкаПродукция.КоличествоОстаток;
			ОблМТК.Параметры.КолВПроизводстве = 0;
			ОблМТК.Параметры.СтандартныйКомментарий = "";
			ОблМТК.Параметры.ДатаОтгрузки = "";
			ТабДок.Вывести(ОблМТК);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
