
&НаСервере
Процедура СписаниеТНПНаСервере()
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;	
		Если ТаблицаРеализаций.Количество() > 0 Тогда	
		Списание = Документы.СписаниеМПЗПрочее.СоздатьДокумент();
		Списание.Дата = ТекущаяДата();
		Списание.Подразделение = МестоХраненияТНП.Подразделение;
		Списание.МестоХранения = МестоХраненияТНП;
		Списание.Статья = СтатьяСписанияРеализаций;
		Списание.Утвердил = Справочники.Сотрудники.НайтиПоНаименованию("Мартьянова Лариса Алексеевна");
		Списание.Комментарий = "Выгрузка реализаций ТНП из БД Сбыт";
			Для каждого ТЧ Из ТаблицаРеализаций Цикл
			ТЧ_МПЗ = Списание.ТабличнаяЧасть.Добавить();
			ТЧ_МПЗ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
			ТЧ_МПЗ.МПЗ = ТЧ.МПЗ;
			ТЧ_МПЗ.Количество = ТЧ.Количество;
			ТЧ_МПЗ.ЕдиницаИзмерения = ТЧ.МПЗ.ОсновнаяЕдиницаИзмерения;
			КонецЦикла; 
		Списание.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Создан документ "+Списание.Ссылка);	
		КонецЕсли;
			Если ТаблицаСписаний.Количество() > 0 Тогда	
			Списание = Документы.СписаниеМПЗПрочее.СоздатьДокумент();
			Списание.Дата = ТекущаяДата();
			Списание.Подразделение = МестоХраненияТНП.Подразделение;
			Списание.МестоХранения = МестоХраненияТНП;
			Списание.Статья = СтатьяСписанияСписаний;
			Списание.Утвердил = Справочники.Сотрудники.НайтиПоНаименованию("Мартьянова Лариса Алексеевна");
			Списание.Комментарий = "Выгрузка списаний ТНП из БД Сбыт";
				Для каждого ТЧ Из ТаблицаСписаний Цикл
				ТЧ_МПЗ = Списание.ТабличнаяЧасть.Добавить();
				ТЧ_МПЗ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
				ТЧ_МПЗ.МПЗ = ТЧ.МПЗ;
				ТЧ_МПЗ.Количество = ТЧ.Количество;
				ТЧ_МПЗ.ЕдиницаИзмерения = ТЧ.МПЗ.ОсновнаяЕдиницаИзмерения;
				КонецЦикла; 
			Списание.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Создан документ "+Списание.Ссылка);	
			КонецЕсли;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;	
	Исключение
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Сообщить(ОписаниеОшибки())
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура СозданиеТаблицСписанияТНП(Тип,Наименование,Код,Количество)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Ссылка
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.Товар.Код = &Код";
Запрос.УстановитьПараметр("Код", Число(Код));
РезультатЗапроса = Запрос.Выполнить();
ВыборкаТНП = РезультатЗапроса.Выбрать();
	Если ВыборкаТНП.Количество() > 0 Тогда
		Пока ВыборкаТНП.Следующий() Цикл
			Если Тип = "Реализация" Тогда
			Выборка = ТаблицаРеализаций.НайтиСтроки(Новый Структура("МПЗ",ВыборкаТНП.Ссылка));
				Если Выборка.Количество() = 0 Тогда
				ТЧ = ТаблицаРеализаций.Добавить();
				ТЧ.МПЗ = ВыборкаТНП.Ссылка;
				ТЧ.Количество = Количество;
				Иначе
				Выборка[0].Количество = Выборка[0].Количество + Количество;
				КонецЕсли;
			Иначе
			Выборка = ТаблицаСписаний.НайтиСтроки(Новый Структура("МПЗ",ВыборкаТНП.Ссылка));
				Если Выборка.Количество() = 0 Тогда
				ТЧ = ТаблицаСписаний.Добавить();
				ТЧ.МПЗ = ВыборкаТНП.Ссылка;
				ТЧ.Количество = Количество;
				Иначе
				Выборка[0].Количество = Выборка[0].Количество + Количество;
				КонецЕсли;			
			КонецЕсли; 
		КонецЦикла;
	Иначе
	ТЧ = Объект.ТаблицаОшибок.Добавить();
	ТЧ.МПЗ = Наименование;
	ТЧ.Код = Код;
	ТЧ.Количество = Количество;
	ТЧ.Комментарий = "не найден!";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьТаблицыСписаний()
ТЗ = Новый ТаблицаЗначений;

ТЗ = ТаблицаРеализаций.Выгрузить();
	Для каждого ТЧ Из ТаблицаСписаний Цикл
	ТЧ_ТЗ = ТЗ.Добавить();
	ТЧ_ТЗ.МПЗ = ТЧ.МПЗ;
	ТЧ_ТЗ.Количество = ТЧ.Количество;
	КонецЦикла;
ТЗ.Свернуть("МПЗ","Количество");	
	Для каждого ТЧ Из ТЗ Цикл
	КоличествоНаСкладе = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоМестуХранения(МестоХраненияТНП,ТЧ.МПЗ);
		Если КоличествоНаСкладе < ТЧ.Количество Тогда
		ТЧ_ТО = Объект.ТаблицаОшибок.Добавить();
		ТЧ_ТО.МПЗ = ТЧ.МПЗ;
		ТЧ_ТО.Код = ТЧ.МПЗ.Товар.Код;
		ТЧ_ТО.Количество = ТЧ.Количество;
		ТЧ_ТО.Комментарий = "не хватает на складе!";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
 
&НаКлиенте
Процедура СоздатьСписания(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если Элементы.СписокФайловВыгрузки.ТекущаяСтрока <> Неопределено Тогда
		Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("",Элементы.СписокФайловВыгрузки.ТекущиеДанные.Значение);
			Если Результат <> Неопределено Тогда
			Объект.ТаблицаОшибок.Очистить();
			ТаблицаРеализаций.Очистить();
			ТаблицаСписаний.Очистить();
			ExcelЛист = Результат.ExcelЛист;
			КолСтрок = Результат.КоличествоСтрок;
			    Для к = 2 по КолСтрок Цикл
				Состояние("Обработка...",к*100/КолСтрок,"Создание таблиц списания ТНП...");
		        СозданиеТаблицСписанияТНП(СокрЛП(ExcelЛист.Cells(к,5).Value),СокрЛП(ExcelЛист.Cells(к,2).Value),Число(ExcelЛист.Cells(к,3).Value),Число(ExcelЛист.Cells(к,4).Value));
			    КонецЦикла;
			Результат.Excel.Quit();
			КонецЕсли;
		ТаблицаРеализаций.Сортировать("МПЗ");
		ТаблицаСписаний.Сортировать("МПЗ");
		ПроверитьТаблицыСписаний();
			Если Объект.ТаблицаОшибок.Количество() = 0 Тогда
			Состояние("Обработка...",,"Списание ТНП...");
			СписаниеТНПНаСервере();
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
МассивНайденных = НайтиФайлы(Константы.КаталогОбменаДаннымиТНП.Получить(), "*.*",Истина);
	Для Каждого Файл из МассивНайденных Цикл	
		Если Не Файл.ЭтоФайл() Тогда
		Продолжить;		
		КонецЕсли;
	СписокФайловВыгрузки.Добавить(Файл.ПолноеИмя,Файл.Имя);
	КонецЦикла;
КонецПроцедуры

&НаСервере 
Функция ПолучитьКаталогОбменаДаннымиТНП()
Возврат(Константы.КаталогОбменаДаннымиТНП.Получить());
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
//ОбновитьНаСервере();
Путь = ПолучитьКаталогОбменаДаннымиТНП();
	Если ЗначениеЗаполнено(Путь) Тогда
	МассивНайденных = НайтиФайлы(Путь, "*.*",Истина);
		Для Каждого Файл из МассивНайденных Цикл	
			Если Не Файл.ЭтоФайл() Тогда
			Продолжить;		
			КонецЕсли;
		СписокФайловВыгрузки.Добавить(Файл.ПолноеИмя,Файл.Имя);
		КонецЦикла;
	Иначе
	Сообщить("В настройках не задан каталог обмена данными ТНП!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Обновить(Неопределено);
КонецПроцедуры
