
&НаСервере
Функция ПолучитьИсполнителя()
Возврат(ПараметрыСеанса.Пользователь);
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
ПараметрыФормы = Новый Структура("Исполнитель",ПолучитьИсполнителя());
ОткрытьФорму("Отчет.ОтчетПоНормированиюSMD_Установка.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
