
&НаСервере
Процедура ДобавитьНаСервере()
ХранилищеОбщихНастроек.Сохранить(КлючНазначенияИспользования, ИмяНастройки, Настройки, ИмяПользователя());
Стр = СписокНастроек.НайтиПоЗначению(ИмяНастройки);
	Если Стр = Неопределено Тогда
	СписокНастроек.Добавить(ИмяНастройки,ИмяНастройки+" (Новая настройка)");
	Иначе
	Сообщить("Настройка с таким именем уже существует!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ДобавитьНаСервере();	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере(ВыбИмяНастройки)
Настройки = ХранилищеОбщихНастроек.Загрузить(КлючНазначенияИспользования, ВыбИмяНастройки ,ИмяПользователя());
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
ОКНаСервере(Элементы.СписокНастроек.ТекущиеДанные.Значение);
ЭтаФорма.Закрыть(Настройки);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере(ВыбИмяНастройки)
ХранилищеОбщихНастроек.Удалить(КлючНазначенияИспользования, ВыбИмяНастройки, ИмяПользователя());
СписокНастроек = ХранилищеОбщихНастроек.ПолучитьСписок(КлючНазначенияИспользования, ИмяПользователя());
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
УдалитьНаСервере(Элементы.СписокНастроек.ТекущиеДанные.Значение);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КлючНазначенияИспользования = Параметры.КлючНазначенияИспользования;
Настройки = Параметры.Настройки;
СписокНастроек = ХранилищеОбщихНастроек.ПолучитьСписок(КлючНазначенияИспользования, ИмяПользователя());
КонецПроцедуры

&НаКлиенте
Процедура СписокНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ОК(Неопределено);
КонецПроцедуры
