
&НаСервере
Функция ОКНаСервере()
	Если Не ЗначениеЗаполнено(Имя) Тогда
		Сообщить("Введите имя пользователя!");
		Возврат Ложь;	
	КонецЕсли; 
		Если флНовый Тогда
			Если Не ЗначениеЗаполнено(Пароль) Тогда
				Сообщить("Введите пароль пользователя!");
				Возврат Ложь;	
			КонецЕсли; 
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Имя);
			Если ПользовательИБ <> Неопределено Тогда
			Сообщить("Пользователь уже существует!");
			Возврат Ложь;
			КонецЕсли;
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательИБ.Имя = Имя;
		Иначе
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Имя);
			Если ПользовательИБ = Неопределено Тогда
			Сообщить("Пользователь не найден!");
			Возврат Ложь;
			КонецЕсли; 
		КонецЕсли; 
ПользовательИБ.Роли.Очистить();
	Для к = 0 по СписокРолей.Количество()-1 Цикл
		Если СписокРолей[к].Пометка Тогда
		ПользовательИБ.Роли.Добавить(Метаданные.Роли[к]);
		КонецЕсли; 
	КонецЦикла;
		Если ЗначениеЗаполнено(Пароль) Тогда
		ПользовательИБ.Пароль = Пароль;
		КонецЕсли; 
ПользовательИБ.ПолноеИмя = ПолноеИмя; 
ПользовательИБ.Записать();
Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	Если ОКНаСервере() Тогда
	ЭтаФорма.Закрыть(Имя);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
РолиКонфигурации = Метаданные.Роли;
	Для каждого Роль из РолиКонфигурации Цикл
	СписокРолей.Добавить(Роль.Имя); 
	КонецЦикла;
		Если ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Параметры.Пользователь);
		Имя = ПользовательИБ.Имя;
		ПолноеИмя = ПользовательИБ.ПолноеИмя;
			Для каждого Роль Из ПользовательИБ.Роли Цикл
			ТекРоль = СписокРолей.НайтиПоЗначению(Роль.Имя);
			ТекРоль.Пометка = Истина;
			КонецЦикла;
		Иначе
		флНовый = Истина;
		КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Элементы.Имя.Доступность = флНовый; 
КонецПроцедуры
