
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
	УстановитьНовыйНомер(Формат(Дата,"ДФ=гг")+"-");
	КонецЕсли;			   
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Договоры") Тогда
	Контрагент = ДанныеЗаполнения.Владелец;
	Договор = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
// регистр ДоговорыСПоставщиками Приход
// регистр ЦеныПлановые
Движения.ДоговорыСПоставщиками.Записывать = Истина;
Движения.ЦеныПлановые.Записывать = Истина; 
	Для каждого ТЧ Из ТабличнаяЧасть Цикл
		Если ТЧ.Количество > 0 Тогда
		Движение = Движения.ДоговорыСПоставщиками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.МПЗ = ТЧ.МПЗ;
		Движение.СпецификацияКДоговору = Ссылка;
		Движение.Количество = ТЧ.Количество;		
		КонецЕсли;
	Движение = Движения.ЦеныПлановые.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.МПЗ = ТЧ.МПЗ;
	Движение.Цена = ТЧ.Цена;		
	КонецЦикла;
КонецПроцедуры