
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

Запрос = Новый Запрос;
ЗапросЗаказы = Новый Запрос;
ЗапросМХ = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблДокумент = Макет.ПолучитьОбласть("Документ");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

ЗапросЗаказы.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТабличнаяЧасть.МПЗ,
	|	ЗаказПоставщикуТабличнаяЧасть.Ссылка,
	|	ЗаказПоставщикуТабличнаяЧасть.Количество,
	|	ЗаказПоставщикуТабличнаяЧасть.ЕдиницаИзмерения
	|ИЗ
	|	Документ.ЗаказПоставщику.ТабличнаяЧасть КАК ЗаказПоставщикуТабличнаяЧасть
	|ГДЕ
	|	ЗаказПоставщикуТабличнаяЧасть.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ЗаказПоставщикуТабличнаяЧасть.МПЗ В ИЕРАРХИИ(&ГруппаМПЗ)";
ЗапросЗаказы.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.Период.ДатаНачала));
ЗапросЗаказы.УстановитьПараметр("ДатаКон", КонецДня(Отчет.Период.ДатаОкончания));
ЗапросЗаказы.УстановитьПараметр("ГруппаМПЗ", Отчет.ГруппаМПЗ);
РезультатЗапроса = ЗапросЗаказы.Выполнить();
ВыборкаЗаказы = РезультатЗапроса.Выбрать();

ЗапросМХ.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОстаткиИОбороты.МПЗ,
	|	МестаХраненияОстаткиИОбороты.Регистратор,
	|	МестаХраненияОстаткиИОбороты.КоличествоНачальныйОстаток,
	|	МестаХраненияОстаткиИОбороты.КоличествоПриход,
	|	МестаХраненияОстаткиИОбороты.КоличествоРасход,
	|	МестаХраненияОстаткиИОбороты.КоличествоКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.МестаХранения.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Авто, Движения, МестоХранения = &МестоХранения) КАК МестаХраненияОстаткиИОбороты
	|ГДЕ
	|	МестаХраненияОстаткиИОбороты.МПЗ В ИЕРАРХИИ(&ГруппаМПЗ)";
ЗапросМХ.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.Период.ДатаНачала));
ЗапросМХ.УстановитьПараметр("ДатаКон", КонецДня(Отчет.Период.ДатаОкончания));
ЗапросМХ.УстановитьПараметр("МестоХранения", Отчет.МестоХранения);
ЗапросМХ.УстановитьПараметр("ГруппаМПЗ", Отчет.ГруппаМПЗ);
РезультатЗапроса = ЗапросМХ.Выполнить();
ВыборкаМХ = РезультатЗапроса.Выбрать();

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Ссылка
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.Ссылка В ИЕРАРХИИ(&ГруппаМПЗ)
	|	И Материалы.ГруппаПоЗакупкам В(&СписокГруппПоЗакупкам)
	|	И Материалы.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Материалы.Наименование";
Запрос.УстановитьПараметр("ГруппаМПЗ", Отчет.ГруппаМПЗ);
Запрос.УстановитьПараметр("СписокГруппПоЗакупкам", СписокГруппПоЗакупкам);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТаблицаДокументы.Очистить();
	ВыборкаЗаказы.Сбросить();
		Пока ВыборкаЗаказы.НайтиСледующий(Новый Структура("МПЗ",ВыборкаДетальныеЗаписи.Ссылка)) Цикл
		ТЧ = ТаблицаДокументы.Добавить();
		ТЧ.Документ = ВыборкаЗаказы.Ссылка;
		ТЧ.Дата = ВыборкаЗаказы.Ссылка.Дата;
		ТЧ.Заказ = ПолучитьБазовоеКоличество(ВыборкаЗаказы.Количество,ВыборкаЗаказы.ЕдиницаИзмерения);	
		КонецЦикла;
	ВыборкаМХ.Сбросить();
		Пока ВыборкаМХ.НайтиСледующий(Новый Структура("МПЗ",ВыборкаДетальныеЗаписи.Ссылка)) Цикл
		ТЧ = ТаблицаДокументы.Добавить();
		ТЧ.Документ = ВыборкаМХ.Регистратор;
		ТЧ.Дата = ВыборкаМХ.Регистратор.Дата;
		ТЧ.НО = ВыборкаМХ.КоличествоНачальныйОстаток;
		ТЧ.Приход = ВыборкаМХ.КоличествоПриход;
		ТЧ.Расход = ВыборкаМХ.КоличествоРасход;		
		ТЧ.КО = ВыборкаМХ.КоличествоКонечныйОстаток;
		КонецЦикла; 
	ТаблицаДокументы.Сортировать("Дата");
	ОблМПЗ.Параметры.Наименование = СокрЛП(ВыборкаДетальныеЗаписи.Ссылка.Наименование);
	ОблМПЗ.Параметры.МПЗ = ВыборкаДетальныеЗаписи.Ссылка;
	ОблМПЗ.Параметры.ГруппаПоЗакупкам = ВыборкаДетальныеЗаписи.Ссылка.ГруппаПоЗакупкам;
	ОблМПЗ.Параметры.СрокПоставки = ВыборкаДетальныеЗаписи.Ссылка.СрокПоставки;
	ОблМПЗ.Параметры.НеснижаемыйЗапас = ВыборкаДетальныеЗаписи.Ссылка.МинОстаток;
	ТабДок.Вывести(ОблМПЗ);
		Для каждого ТЧ Из ТаблицаДокументы Цикл
			Если ТипЗнч(ТЧ.Документ) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Заказ = ТЧ.Заказ;
			НачальныйОстаток = ТЧ.НО;
			Приход = 0;
			Расход = 0;
			КонечныйОстаток = ТЧ.КО;
			Иначе
			НачальныйОстаток = ТЧ.НО;
			Приход = ТЧ.Приход;
			Заказ = 0;
			Расход = ТЧ.Расход;
			КонечныйОстаток = ТЧ.КО;
			КонецЕсли;
	    ОблДокумент.Параметры.Документ = ТЧ.Документ;
	    ОблДокумент.Параметры.Дата = Формат(ТЧ.Дата,"ДФ=dd.MM.yyyy"); 	
	    ОблДокумент.Параметры.НачальныйОстаток = НачальныйОстаток;
	    ОблДокумент.Параметры.Приход = Приход;
	    ОблДокумент.Параметры.Заказ = Заказ;
	    ОблДокумент.Параметры.Расход = Расход;
	    ОблДокумент.Параметры.КонечныйОстаток = КонечныйОстаток;
		ТабДок.Вывести(ОблДокумент);
		КонецЦикла; 
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
