
Перем НовыйОбъект;

Процедура ПриЗаписи(Отказ)
	Если НовыйОбъект Тогда
		Если Не ЭтоГруппа Тогда
		Ставки = РегистрыСведений.Ставки.СоздатьМенеджерЗаписи();
		Ставки.Период = ТекущаяДата();
		Ставки.МПЗ = Ссылка;
		Ставки.СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
		Ставки.Записать();
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
НовыйОбъект = ЭтоНовый();
	Если ЭтоНовый() Тогда
		Если Не ЭтоГруппа Тогда
			Если Не Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина).Пустая() Тогда
			Сообщить(Наименование + " - наименование номенклатуры существует!");	
			Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если Не ЭтоГруппа Тогда
	ДатаСозданияСпецификации = ТекущаяДата();	
	КонецЕсли; 
КонецПроцедуры
