
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Параметры.Элемент <> Неопределено Тогда
	СписокЭлементов.Добавить(Параметры.Элемент);
	СформироватьНаСервере();
	РазвернутьДерево();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудника(ID)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.DESCR КАК DESCR
	|ИЗ
	|	ВнешнийИсточникДанных.Номенклатура1С77.Таблица.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ID = &ID";
Запрос.УстановитьПараметр("ID", ID);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 	Возврат(ВыборкаДетальныеЗаписи.DESCR);
	КонецЦикла;
Возврат("");
КонецФункции 

&НаСервере
Процедура ПолучитьИзвещенияПоНоменклатуре(Стр,Элемент,Позиция,ВыбСпецификация)
Запрос = Новый Запрос;
ЗапросИзвещение = Новый Запрос;

	Если Константы.КодБазы.Получить() = "БГР" Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзвещенияНаНоменклатуру.ДатаУчтения КАК ДатаУчтения,
		|	ИзвещенияНаНоменклатуру.ИзвещениеОбИзменении КАК ИзвещениеОбИзменении
		|ИЗ
		|	ВнешнийИсточникДанных.Номенклатура1С77.Таблица.ИзвещенияНаНоменклатуру КАК ИзвещенияНаНоменклатуру
		|ГДЕ
		|	ИзвещенияНаНоменклатуру.PARENTEXT = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Элемент.ID);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗапросИзвещение.Текст = 
			"ВЫБРАТЬ
			|	ИзвещениеОбИзменениях.ДатаРегистрации КАК ДатаРегистрации,
			|	ИзвещениеОбИзменениях.НомераИзвещений КАК НомераИзвещений,
			|	ИзвещениеОбИзменениях.Отдел КАК Отдел,
			|	ИзвещениеОбИзменениях.Автор КАК Автор,
			|	ИзвещениеОбИзменениях.Комментарий КАК Комментарий,
			|	ИзвещениеОбИзменениях.DESCR КАК DESCR
			|ИЗ
			|	ВнешнийИсточникДанных.Номенклатура1С77.Таблица.ИзвещениеОбИзменениях КАК ИзвещениеОбИзменениях
			|ГДЕ
			|	ИзвещениеОбИзменениях.ID = &ID";
		ЗапросИзвещение.УстановитьПараметр("ID", ВыборкаДетальныеЗаписи.ИзвещениеОбИзменении);
		РезультатЗапросаИзвещение = ЗапросИзвещение.Выполнить();
		ВыборкаИзвещения = РезультатЗапросаИзвещение.Выбрать();
			Пока ВыборкаИзвещения.Следующий() Цикл
			НовоеИзвещение = Стр.Строки.Добавить();
			НовоеИзвещение.ТипЭлемента = 1;
	        НовоеИзвещение.Дата = ВыборкаИзвещения.ДатаРегистрации;
		    НовоеИзвещение.Элемент = Элемент;
		    НовоеИзвещение.Позиция = Позиция;
			НовоеИзвещение.Спецификация = ВыбСпецификация;
			НовоеИзвещение.НомераИзвещений = ВыборкаИзвещения.НомераИзвещений;
			НовоеИзвещение.Автор = ПолучитьСотрудника(ВыборкаИзвещения.Автор);
			НовоеИзвещение.Комментарий = ВыборкаИзвещения.DESCR+Символы.ПС+ВыборкаИзвещения.Комментарий;
			КонецЦикла;
		КонецЦикла;
	Иначе
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзвещенияНаНоменклатуру.ДатаУчтения КАК ДатаУчтения,
		|	ИзвещенияНаНоменклатуру.ИзвещениеОбИзменении КАК ИзвещениеОбИзменении
		|ИЗ
		|	ВнешнийИсточникДанных.Номенклатура1С77_Харьков.Таблица.ИзвещенияНаНоменклатуру КАК ИзвещенияНаНоменклатуру
		|ГДЕ
		|	ИзвещенияНаНоменклатуру.PARENTEXT = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Элемент.ID);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗапросИзвещение.Текст = 
			"ВЫБРАТЬ
			|	ИзвещенияОбИзменениях.ДатаРегистрации КАК ДатаРегистрации,
			|	ИзвещенияОбИзменениях.НомераИзвещений КАК НомераИзвещений,
			|	ИзвещенияОбИзменениях.Отдел КАК Отдел,
			|	ИзвещенияОбИзменениях.Автор КАК Автор,
			|	ИзвещенияОбИзменениях.Комментарий КАК Комментарий,
			|	ИзвещенияОбИзменениях.DESCR КАК DESCR
			|ИЗ
			|	ВнешнийИсточникДанных.Номенклатура1С77_Харьков.Таблица.ИзвещенияОбИзменениях КАК ИзвещенияОбИзменениях
			|ГДЕ
			|	ИзвещенияОбИзменениях.ID = &ID";
		ЗапросИзвещение.УстановитьПараметр("ID", ВыборкаДетальныеЗаписи.ИзвещениеОбИзменении);
		РезультатЗапросаИзвещение = ЗапросИзвещение.Выполнить();
		ВыборкаИзвещения = РезультатЗапросаИзвещение.Выбрать();
			Пока ВыборкаИзвещения.Следующий() Цикл
			НовоеИзвещение = Стр.Строки.Добавить();
			НовоеИзвещение.ТипЭлемента = 1;
	        НовоеИзвещение.Дата = ВыборкаИзвещения.ДатаРегистрации;
		    НовоеИзвещение.Элемент = Элемент;
		    НовоеИзвещение.Позиция = Позиция;
			НовоеИзвещение.Спецификация = ВыбСпецификация;
			НовоеИзвещение.НомераИзвещений = ВыборкаИзвещения.НомераИзвещений;
			НовоеИзвещение.Автор = ПолучитьСотрудника(ВыборкаИзвещения.Автор);
			НовоеИзвещение.Комментарий = ВыборкаИзвещения.DESCR+Символы.ПС+ВыборкаИзвещения.Комментарий;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьИзвещенияПоМатериалу(Стр,Элемент,Позиция,ВыбСпецификация)
Запрос = Новый Запрос;
ЗапросИзвещение = Новый Запрос;

	Если Константы.КодБазы.Получить() = "БГР" Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзвещенияНаМатериалы.ДатаУчтения КАК ДатаУчтения,
		|	ИзвещенияНаМатериалы.ИзвещениеОбИзменении КАК ИзвещениеОбИзменении
		|ИЗ
		|	ВнешнийИсточникДанных.Номенклатура1С77.Таблица.ИзвещенияНаМатериалы КАК ИзвещенияНаМатериалы
		|ГДЕ
		|	ИзвещенияНаМатериалы.PARENTEXT = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Элемент.ID);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗапросИзвещение.Текст = 
			"ВЫБРАТЬ
			|	ИзвещениеОбИзменениях.ДатаРегистрации КАК ДатаРегистрации,
			|	ИзвещениеОбИзменениях.НомераИзвещений КАК НомераИзвещений,
			|	ИзвещениеОбИзменениях.Отдел КАК Отдел,
			|	ИзвещениеОбИзменениях.Автор КАК Автор,
			|	ИзвещениеОбИзменениях.Комментарий КАК Комментарий,
			|	ИзвещениеОбИзменениях.DESCR КАК DESCR
			|ИЗ
			|	ВнешнийИсточникДанных.Номенклатура1С77.Таблица.ИзвещениеОбИзменениях КАК ИзвещениеОбИзменениях
			|ГДЕ
			|	ИзвещениеОбИзменениях.ID = &ID";
		ЗапросИзвещение.УстановитьПараметр("ID", ВыборкаДетальныеЗаписи.ИзвещениеОбИзменении);
		РезультатЗапросаИзвещение = ЗапросИзвещение.Выполнить();
		ВыборкаИзвещения = РезультатЗапросаИзвещение.Выбрать();
			Пока ВыборкаИзвещения.Следующий() Цикл
			НовоеИзвещение = Стр.Строки.Добавить();
			НовоеИзвещение.ТипЭлемента = 2;
	        НовоеИзвещение.Дата = ВыборкаИзвещения.ДатаРегистрации;
		    НовоеИзвещение.Элемент = Элемент;
		    НовоеИзвещение.Позиция = Позиция;
			НовоеИзвещение.Спецификация = ВыбСпецификация;
			НовоеИзвещение.НомераИзвещений = ВыборкаИзвещения.НомераИзвещений;
			НовоеИзвещение.Автор = ПолучитьСотрудника(ВыборкаИзвещения.Автор);
			НовоеИзвещение.Комментарий = ВыборкаИзвещения.DESCR+Символы.ПС+ВыборкаИзвещения.Комментарий;
			КонецЦикла;
		КонецЦикла;
	Иначе
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзвещенияНаМатериалы.ДатаУчтения КАК ДатаУчтения,
		|	ИзвещенияНаМатериалы.ИзвещениеОбИзменении КАК ИзвещениеОбИзменении
		|ИЗ
		|	ВнешнийИсточникДанных.Номенклатура1С77_Харьков.Таблица.ИзвещенияНаМатериалы КАК ИзвещенияНаМатериалы
		|ГДЕ
		|	ИзвещенияНаМатериалы.PARENTEXT = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Элемент.ID);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗапросИзвещение.Текст = 
			"ВЫБРАТЬ
			|	ИзвещенияОбИзменениях.ДатаРегистрации КАК ДатаРегистрации,
			|	ИзвещенияОбИзменениях.НомераИзвещений КАК НомераИзвещений,
			|	ИзвещенияОбИзменениях.Отдел КАК Отдел,
			|	ИзвещенияОбИзменениях.Автор КАК Автор,
			|	ИзвещенияОбИзменениях.Комментарий КАК Комментарий,
			|	ИзвещенияОбИзменениях.DESCR КАК DESCR
			|ИЗ
			|	ВнешнийИсточникДанных.Номенклатура1С77_Харьков.Таблица.ИзвещенияОбИзменениях КАК ИзвещенияОбИзменениях
			|ГДЕ
			|	ИзвещенияОбИзменениях.ID = &ID";
		ЗапросИзвещение.УстановитьПараметр("ID", ВыборкаДетальныеЗаписи.ИзвещениеОбИзменении);
		РезультатЗапросаИзвещение = ЗапросИзвещение.Выполнить();
		ВыборкаИзвещения = РезультатЗапросаИзвещение.Выбрать();
			Пока ВыборкаИзвещения.Следующий() Цикл
			НовоеИзвещение = Стр.Строки.Добавить();
			НовоеИзвещение.ТипЭлемента = 2;
	        НовоеИзвещение.Дата = ВыборкаИзвещения.ДатаРегистрации;
		    НовоеИзвещение.Элемент = Элемент;
		    НовоеИзвещение.Позиция = Позиция;
			НовоеИзвещение.Спецификация = ВыбСпецификация;
			НовоеИзвещение.НомераИзвещений = ВыборкаИзвещения.НомераИзвещений;
			НовоеИзвещение.Автор = ПолучитьСотрудника(ВыборкаИзвещения.Автор);
			НовоеИзвещение.Комментарий = ВыборкаИзвещения.DESCR+Символы.ПС+ВыборкаИзвещения.Комментарий;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РаскрытьНаМПЗ(Стр,ВыбСпецификация)
НормРасх = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Все(ВыбСпецификация,ТекущаяДата());
	Пока НормРасх.Следующий() Цикл			
		Если ИспользоватьИзвещенияБазы1С77 Тогда
			Если ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Номенклатура") Тогда
			ПолучитьИзвещенияПоНоменклатуре(Стр,НормРасх.Элемент,НормРасх.Позиция,ВыбСпецификация);
			ИначеЕсли ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Материалы") Тогда	
			ПолучитьИзвещенияПоМатериалу(Стр,НормРасх.Элемент,НормРасх.Позиция,ВыбСпецификация);
			ИначеЕсли ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Документация") Тогда
				Если ЗначениеЗаполнено(НормРасх.Элемент.Комментарий) Тогда
				НовоеИзвещение = Стр.Строки.Добавить();
				НовоеИзвещение.ТипЭлемента = 3;
			    НовоеИзвещение.Элемент = НормРасх.Элемент;
				НовоеИзвещение.Спецификация = ВыбСпецификация;
				НовоеИзвещение.НомераИзвещений = НормРасх.Элемент.Извещение;
				НовоеИзвещение.Комментарий = НормРасх.Элемент.Комментарий;
				КонецЕсли; 
			КонецЕсли;			
		КонецЕсли; 
	Извещения = РегистрыСведений.ИзвещенияОбИзменениях.Выбрать(Новый Структура("Элемент",НормРасх.Элемент));
		Пока Извещения.Следующий() Цикл	
		НовоеИзвещение = Стр.Строки.Добавить();
        НовоеИзвещение.Дата = Извещения.Извещение.ДатаРегистрации;
	    НовоеИзвещение.Элемент = Извещения.Элемент;
		НовоеИзвещение.Спецификация = ВыбСпецификация;
		НовоеИзвещение.Извещение = Извещения.Извещение;
		НовоеИзвещение.НомераИзвещений = Извещения.Извещение.НомераИзвещений;
		НовоеИзвещение.Автор = Извещения.Извещение.Автор.Наименование;
		НовоеИзвещение.Комментарий = Извещения.Извещение.Комментарий;
		КонецЦикла; 	
			Если ТипЗнч(НормРасх.Элемент) = Тип("СправочникСсылка.Номенклатура") Тогда
				Если Отчет.ВсяСпецификация Тогда
				РаскрытьНаМПЗ(Стр,НормРасх.Элемент);
				КонецЕсли;		
			КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИзвещения(Стр,Элемент)
Извещения = РегистрыСведений.ИзвещенияОбИзменениях.Выбрать(Новый Структура("Элемент",Элемент));
	Пока Извещения.Следующий() Цикл	
	НовоеИзвещение = Стр.Строки.Добавить();
    НовоеИзвещение.Дата = Извещения.Извещение.ДатаРегистрации;
    НовоеИзвещение.Элемент = Элемент;
	НовоеИзвещение.Спецификация = Элемент;
	НовоеИзвещение.Извещение = Извещения.Извещение;
	НовоеИзвещение.НомераИзвещений = Извещения.Извещение.НомераИзвещений;
	НовоеИзвещение.Автор = Извещения.Извещение.Автор.Наименование;
	НовоеИзвещение.Комментарий = Извещения.Извещение.Комментарий;
	КонецЦикла;
		Если ТипЗнч(Элемент) = Тип("СправочникСсылка.Номенклатура") Тогда
		ПолучитьИзвещенияПоНоменклатуре(Стр,Элемент,"",Элемент);
		РаскрытьНаМПЗ(Стр,Элемент);
		ИначеЕсли ТипЗнч(Элемент) = Тип("СправочникСсылка.Материалы") Тогда	
		ПолучитьИзвещенияПоМатериалу(Стр,Элемент,"",Элемент);
		ИначеЕсли ТипЗнч(Элемент) = Тип("СправочникСсылка.Документация") Тогда
			Если ЗначениеЗаполнено(Элемент.Комментарий) Тогда
			НовоеИзвещение = Стр.Строки.Добавить();
			НовоеИзвещение.ТипЭлемента = 3;
		    НовоеИзвещение.Элемент = Элемент;
			НовоеИзвещение.НомераИзвещений = Элемент.Извещение;
			НовоеИзвещение.Комментарий = Элемент.Комментарий;
			КонецЕсли; 
		КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура СформироватьНаСервере()
тДерево = РеквизитФормыВЗначение("ДеревоИзвещений");
тДерево.Строки.Очистить();
	Для каждого Элемент Из СписокЭлементов Цикл
		Если Элемент.Значение.ЭтоГруппа Тогда
			Если ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.Номенклатура") Тогда
			Выборка = Справочники.Номенклатура.ВыбратьИерархически(Элемент.Значение);
			ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.Материалы") Тогда
			Выборка = Справочники.Материалы.ВыбратьИерархически(Элемент.Значение);					
			ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.Документация") Тогда
			Выборка = Справочники.Документация.ВыбратьИерархически(Элемент.Значение);
			ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.ТехОснастка") Тогда
			Выборка = Справочники.ТехОснастка.ВыбратьИерархически(Элемент.Значение);			
			КонецЕсли;
				Пока Выборка.Следующий() Цикл
					Если Не Выборка.ЭтоГруппа Тогда
					Стр = тДерево.Строки.Добавить();
				    Стр.ЭлементОбработки = Выборка.Ссылка;
					ПолучитьИзвещения(Стр,Выборка.Ссылка);
					КонецЕсли; 
				КонецЦикла; 
		Иначе	
		Стр = тДерево.Строки.Добавить();
	    Стр.ЭлементОбработки = Элемент.Значение;
		ПолучитьИзвещения(Стр,Элемент.Значение);		
		КонецЕсли;	
	КонецЦикла;
тДерево.Строки.Сортировать("ЭлементОбработки,Дата,Элемент,Спецификация",Истина);
ЗначениеВРеквизитФормы(тДерево, "ДеревоИзвещений");
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
РазвернутьДерево();
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево()
тЭлементы = ДеревоИзвещений.ПолучитьЭлементы();
   	Для Каждого тСтр Из тЭлементы Цикл 
   	Элементы.ДеревоИзвещений.Развернуть(тСтр.ПолучитьИдентификатор(), Истина);
	Прервать;
   	КонецЦикла;
КонецПроцедуры
