
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ПроизводственноеЗадание = ЭтаФорма.Параметры.ПЗ;
ПолучитьСписокПО(); 
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокПО()
НР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_Д(ПроизводственноеЗадание.Изделие,ТекущаяДата());
	Пока НР.Следующий() Цикл
		Если НР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Программа Тогда
		СписокПО.Добавить(ПолучитьТекущийКаталог(НР.Элемент.Родитель)+СокрЛП(НР.Элемент.ИмяФайла),СокрЛП(НР.Элемент.ИмяФайла));
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьТекКаталог(Родитель)
Возврат(ПолучитьТекущийКаталог(Родитель));
КонецФункции 

&НаСервере
Функция ПолучитьКоличествоВПЗ()
Возврат(ПроизводственноеЗадание.Количество);
КонецФункции 

&НаКлиенте
Процедура ПослеУдаленияФайлов(Каталог) Экспорт
Состояние("Обработка...",,"Копирование файлов в рабочий каталог...");
Оп = Новый ОписаниеОповещения("ПослеКопированияФайла", ЭтотОбъект);
НачатьКопированиеФайла(Оп,ПолучитьТекКаталог(ПолучитьРодителяФайла())+ПолучитьИмяФайла(),РабочийКаталог+ПолучитьИмяФайла());
	Для каждого Файл Из СписокПО Цикл
	Оп = Новый ОписаниеОповещения("ПослеКопированияФайла", ЭтотОбъект);
	НачатьКопированиеФайла(Оп,Файл.Значение,РабочийКаталог+Файл.Представление);
	КонецЦикла;  
КонецПроцедуры

&НаКлиенте
Процедура ПослеКопированияФайла(СкопированныйФайл,ДополнительныеПараметры) Экспорт
Состояние("Обработка...",,"Запуск приложения проверки...");
КодВозврата = 0;
ЗапуститьПриложение(РабочийКаталог+ПолучитьИмяФайла()+" -c "+ПолучитьКоличествоВПЗ(),РабочийКаталог,Истина,КодВозврата);
	Если КодВозврата > -1 Тогда
	КоличествоНепригодных = КодВозврата;
	КоличествоПригодных = ПолучитьКоличествоВПЗ()-КоличествоНепригодных;
	Иначе
	Сообщить("Возвращена ошибка с кодом "+КодВозврата,СтатусСообщения.ОченьВажное);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РабочийКаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
Диалог.Заголовок = "Выберите рабочий каталог";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
Диалог.Каталог = РабочийКаталог;
	Если Диалог.Выбрать() Тогда
	РабочийКаталог = Диалог.Каталог+"\"; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяФайла()
Возврат(СокрЛП(ПрограммаДрайвер.ИмяФайла));
КонецФункции 

&НаСервере
Функция ПолучитьРодителяФайла()
Возврат(ПрограммаДрайвер.Родитель);
КонецФункции 

&НаКлиенте
Процедура ЗапуститьПроверку(Команда)
	Если Не ЗначениеЗаполнено(РабочийКаталог) Тогда
	Сообщить("Выберите рабочий каталог!");	
	Возврат;
	КонецЕсли; 
	//Если СписокПО.Количество() > 0 Тогда
	//Состояние("Обработка...",,"Удаление старый файлов из рабочего каталога...");
	//Оп = Новый ОписаниеОповещения("ПослеУдаленияФайлов", ЭтотОбъект);
	//НачатьУдалениеФайлов(Оп,РабочийКаталог,"*.*");
	//Иначе
	//Сообщить("ПО не найдено по данному производственному заданию!");
	//КонецЕсли;
Состояние("Обработка...",,"Удаление старых файлов из рабочего каталога...");
УдалитьФайлы(РабочийКаталог,"*.*");
Состояние("Обработка...",,"Копирование новых файлов в рабочий каталог...");
КопироватьФайл(ПолучитьТекКаталог(ПолучитьРодителяФайла())+ПолучитьИмяФайла(),РабочийКаталог+ПолучитьИмяФайла());
	Для каждого Файл Из СписокПО Цикл
	КопироватьФайл(Файл.Значение,РабочийКаталог+Файл.Представление);
	КонецЦикла;
Состояние("Обработка...",,"Запуск приложения проверки...");
КодВозврата = 0;
ЗапуститьПриложение(РабочийКаталог+ПолучитьИмяФайла()+" -c "+ПолучитьКоличествоВПЗ(),РабочийКаталог,Истина,КодВозврата);
	Если КодВозврата > -1 Тогда
	КоличествоНепригодных = КодВозврата;
	КоличествоПригодных = ПолучитьКоличествоВПЗ()-КоличествоНепригодных;
	Иначе
	Сообщить("Возвращена ошибка с кодом "+КодВозврата,СтатусСообщения.ОченьВажное);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
