
&НаСервере
Процедура СброситьОчередьНаСервере(Линейка)
НомерОчереди = 1;
	Попытка
    НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутнаяКарта.Ссылка,
		|	МаршрутнаяКарта.НомерОчереди КАК НомерОчереди
		|ИЗ
		|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
		|ГДЕ
		|	МаршрутнаяКарта.Статус <> 3
		|	И МаршрутнаяКарта.Линейка = &Линейка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерОчереди";
	Запрос.УстановитьПараметр("Линейка",Линейка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МТК = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		МТК.НомерОчереди = НомерОчереди;
		МТК.Записать();
		//ОбщийМодульРаботаСРегистрами.ИзменитьНомерОчереди(ВыборкаДетальныеЗаписи.Ссылка,НомерОчереди);
		Отбор = Новый Структура("ДокументОснование",МТК.Ссылка);
		ВыборкаПЗ = Документы.ПроизводственноеЗадание.Выбрать(,,Отбор);	
			Пока ВыборкаПЗ.Следующий() Цикл
			ПЗ = ВыборкаПЗ.Ссылка.ПолучитьОбъект();
			ПЗ.НомерОчереди = НомерОчереди;
			ПЗ.Записать(РежимЗаписиДокумента.Запись);
			//ОбщийМодульРаботаСРегистрами.ИзменитьНомерОчереди(ВыборкаПЗ.Ссылка,НомерОчереди);			
			КонецЦикла;	
		НомерОчереди = НомерОчереди + 1;	
		КонецЦикла;	
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат;
	КонецПопытки;
НО = Справочники.НумераторОчереди.НайтиПоРеквизиту("Линейка",Линейка).ПолучитьОбъект();
НО.СледующийНомер = НомерОчереди;
НО.Записать();
Сообщить("Сброс очереди завершён!");	
КонецПроцедуры

&НаКлиенте
Процедура СброситьОчередь(Команда)
СброситьОчередьНаСервере(Элементы.Список.ТекущиеДанные.Линейка);
Элементы.Список.Обновить();
КонецПроцедуры
