
&НаСервере
Процедура ПроверитьНаСервере()
ТаблицаМПЗ.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОстатки.МПЗ КАК МПЗ,
	|	МестаХраненияОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.МестаХранения.Остатки КАК МестаХраненияОстатки
	|ГДЕ
	|	МестаХраненияОстатки.МПЗ.Товар.Статус = &Статус
	|	И МестаХраненияОстатки.КоличествоОстаток > 0
	|ИТОГИ
	|	СУММА(КоличествоОстаток)
	|ПО
	|	МПЗ";
Запрос.УстановитьПараметр("Статус",Статус);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Товар КАК Товар
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Товар.Статус = &Статус
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Товар.Наименование";
Запрос.УстановитьПараметр("Статус",Статус);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ВыборкаМПЗ.Сбросить();
		Если ВыборкаМПЗ.НайтиСледующий(Новый Структура("МПЗ",ВыборкаДетальныеЗаписи.Ссылка)) Тогда
		Продолжить;
		КонецЕсли; 
	ТЧ = ТаблицаМПЗ.Добавить();
	ТЧ.МПЗ = ВыборкаДетальныеЗаписи.Ссылка;
	ТЧ.Статус = ПолучитьСтатус(ТЧ.МПЗ);
	ТЧ.Товар = ВыборкаДетальныеЗаписи.Товар;
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Ссылка КАК Ссылка,
	|	Материалы.Товар КАК Товар
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.Товар.Статус = &Статус
	|
	|УПОРЯДОЧИТЬ ПО
	|	Материалы.Товар.Наименование";
Запрос.УстановитьПараметр("Статус",Статус);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ВыборкаМПЗ.Сбросить();
		Если ВыборкаМПЗ.НайтиСледующий(Новый Структура("МПЗ",ВыборкаДетальныеЗаписи.Ссылка)) Тогда
		Продолжить;
		КонецЕсли; 
	ТЧ = ТаблицаМПЗ.Добавить();
	ТЧ.МПЗ = ВыборкаДетальныеЗаписи.Ссылка;
	ТЧ.Статус = ПолучитьСтатус(ТЧ.МПЗ);
	ТЧ.Товар = ВыборкаДетальныеЗаписи.Товар;
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Товары КАК Товары
	|ГДЕ
	|	Товары.Статус = &Статус
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.Наименование";
Запрос.УстановитьПараметр("Статус",Статус);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ВыборкаМат = Справочники.Материалы.НайтиПоРеквизиту("Товар",ВыборкаДетальныеЗаписи.Ссылка);
	ВыборкаНомен = Справочники.Номенклатура.НайтиПоРеквизиту("Товар",ВыборкаДетальныеЗаписи.Ссылка);
		Если ВыборкаМат.Пустая() и ВыборкаНомен.Пустая() Тогда
		ТЧ = ТаблицаМПЗ.Добавить();
		ТЧ.Товар = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
	КонецЦикла;
ТаблицаМПЗ.Сортировать("Товар");
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
ПроверитьНаСервере();
КонецПроцедуры
