
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Год = Год(ТекущаяДата());
СписокМесяцев.Добавить(1,"Январь");
СписокМесяцев.Добавить(2,"Февраль");
СписокМесяцев.Добавить(3,"Март");
СписокМесяцев.Добавить(4,"Апрель");
СписокМесяцев.Добавить(5,"Май");
СписокМесяцев.Добавить(6,"Июнь");
СписокМесяцев.Добавить(7,"Июль");
СписокМесяцев.Добавить(8,"Август");
СписокМесяцев.Добавить(9,"Сентябрь");
СписокМесяцев.Добавить(10,"Октябрь");
СписокМесяцев.Добавить(11,"Ноябрь");
СписокМесяцев.Добавить(12,"Декабрь");
Элементы.СписокМесяцев.ТекущаяСтрока = Месяц(ТекущаяДата())-1;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
ЭтаФорма.Закрыть(Дата(Год,Элементы.СписокМесяцев.ТекущаяСтрока+1,1));
КонецПроцедуры

&НаКлиенте
Процедура СписокМесяцевВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
ЭтаФорма.Закрыть(Дата(Год,Элементы.СписокМесяцев.ТекущаяСтрока+1,1));
КонецПроцедуры
