
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Объект.Ссылка.Пустая() Тогда
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтложенныеЗадания.Период КАК Период
		|ИЗ
		|	РегистрСведений.ОтложенныеЗадания КАК ОтложенныеЗадания
		|ГДЕ
		|	ОтложенныеЗадания.Извещение = &Извещение";
	Запрос.УстановитьПараметр("Извещение", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОтложитьНаДату = ВыборкаДетальныеЗаписи.Период;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ОтложитьНаДату) Тогда
	НаборЗаписей = РегистрыСведений.ОтложенныеЗадания.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Извещение.Установить(Объект.Ссылка); 
	НаборЗаписей.Записать();
	РОЗ = РегистрыСведений.ОтложенныеЗадания.СоздатьМенеджерЗаписи();
	РОЗ.Период = ОтложитьНаДату;
	РОЗ.Извещение = Объект.Ссылка;
	РОЗ.Записать(Истина);
	КонецЕсли;
КонецПроцедуры
