
&НаСервере
Функция УдалитьДокументыИЭтапы(МТК)
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыпускПродукции.Ссылка
		|ИЗ
		|	Документ.ВыпускПродукции КАК ВыпускПродукции
		|ГДЕ
		|	ВыпускПродукции.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование", МТК);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		УдаляемыйДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		УдаляемыйДок.Удалить();
		КонецЦикла;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПередачаВПроизводство.Ссылка
		|ИЗ
		|	Документ.ПередачаВПроизводство КАК ПередачаВПроизводство
		|ГДЕ
		|	ПередачаВПроизводство.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование", МТК);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		УдаляемыйДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		УдаляемыйДок.Удалить();
		КонецЦикла;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственноеЗадание.Ссылка
		|ИЗ
		|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
		|ГДЕ
		|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование", МТК);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ЭтапыПроизводственныхЗаданий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПЗ.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Прочитать();
		сзУдаляемыеЗаписи = Новый СписокЗначений;

		Стр = 1;
			Для Каждого Запись Из НаборЗаписей Цикл
			    Если Стр > 1 Тогда
			    сзУдаляемыеЗаписи.Добавить(Запись);
				Иначе
				Запись.ДатаНачала = Дата(1,1,1);
				Запись.ДатаОкончания = Дата(1,1,1);
				Запись.Исполнитель = Справочники.Сотрудники.ПустаяСсылка();
				Запись.Ремонт = Ложь;
			    КонецЕсли;
			Стр = Стр + 1;
			КонецЦикла;
				Для каждого ЭлтСз Из сзУдаляемыеЗаписи Цикл
			    НаборЗаписей.Удалить(ЭлтСз.Значение);
				КонецЦикла;
		НаборЗаписей.Записать();
		НаборЗаписей = РегистрыСведений.СтендовыйПрогон.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПЗ.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Записать();
		НаборЗаписей = РегистрыСведений.ЛьготнаяОчередь.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПЗ.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Записать();
		НаборЗаписей = РегистрыСведений.НапряжениеБатарейки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПЗ.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		НаборЗаписей.Записать();
		ИзменениеПЗ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ИзменениеПЗ.ВозвратнаяТара = ""; 
		ИзменениеПЗ.ДатаЗапуска = Дата(1,1,1); 
		ИзменениеПЗ.ДатаГрупповойУпаковки = Дата(1,1,1); 
		ИзменениеПЗ.Аналоги.Очистить();
		ИзменениеПЗ.Записать();
		КонецЦикла;
	//МТКОбъект = МТК.ПолучитьОбъект();
	//МТК.Статус = 0;
	//МТК.Записать(РежимЗаписиДокумента.Проведение);
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат(Истина);
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат(Ложь);
	КонецПопытки;
КонецФункции 

&НаСервере
Функция ЭтоЛинейкаКанбан(МТК)	
Возврат(?(МТК.Линейка.ВидЛинейки = Перечисления.ВидыЛинеек.Канбан,Истина,Ложь));
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ЭтоЛинейкаКанбан(ПараметрКоманды) Тогда
	Результат = Вопрос("Все подчиненные документы будут удалены! 
					   |Производственные задания перейдут на начальный этап производства!
			           |Вы уверены, что хотите отменить запуск МТК?",РежимДиалогаВопрос.ДаНет,,,"Удаление");
		Если Результат = КодВозвратаДиалога.Да Тогда
			Если ОбщийМодульВызовСервера.ОтменаЗапускаМТК(ПараметрКоманды) Тогда
			ПоказатьОповещениеПользователя("ВНИМАНИЕ!",,"Запуск МТК отменён!");
			КонецЕсли; 
		КонецЕсли;
	Иначе
	Сообщить("Нельзя отменить запуск МТК на приборной линейке!");
	КонецЕсли; 
КонецПроцедуры
