
&НаСервере
Функция ПолучитьИмяФайла(ВыбДок)
Возврат(СокрЛП(ВыбДок.ИмяФайла));	
КонецФункции

&НаСервере
Функция ПолучитьФайлИзвещения(ВыбДок)
Возврат(СокрЛП(ВыбДок.Извещение));	
КонецФункции

&НаСервере
Функция ПолучитьКаталог(ВыбДок)
Возврат(ПолучитьТекущийКаталог(ВыбДок.Родитель));	
КонецФункции

&НаСервере
Функция ПолучитьДокументациюЭлемента(Элемент)
Возврат(Элемент.ИмяФайла);	
КонецФункции

&НаСервере
Функция ПолучитьЭлементНормыРасходов(НР)
Возврат(НР.Элемент);	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.НормыРасходов") Тогда
	ПараметрКоманды = ПолучитьЭлементНормыРасходов(ПараметрКоманды);	
	КонецЕсли; 
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Материалы") Тогда	
	ПараметрКоманды = ПолучитьДокументациюЭлемента(ПараметрКоманды);
		Если ПараметрКоманды.Пустая() Тогда
		Сообщить("Нет прикрепленного файла!");
		Возврат;	
		КонецЕсли;
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ТехОснастка") Тогда	
	ПараметрКоманды = ПолучитьДокументациюЭлемента(ПараметрКоманды);
		Если ПараметрКоманды.Пустая() Тогда
		Сообщить("Нет прикрепленного файла!");
		Возврат;	
		КонецЕсли;	
	КонецЕсли;
СписокРолей = ОбщийМодульВызовСервера.ПолучитьСписокРолей();
	Если (СписокРолей[0].Значение = "СервисЦентр") и (СписокРолей.Количество() = 1) Тогда
		Если ОбщийМодульВызовСервера.ПросмотрЗапрещён(ПараметрКоманды) Тогда
		Сообщить("У Вас нет прав для просмотра этого файла!");
		Возврат;
		КонецЕсли; 
	КонецЕсли; 
ИмяФайла = ПолучитьИмяФайла(ПараметрКоманды);
ИмяФайлаИзвещения = ПолучитьФайлИзвещения(ПараметрКоманды);
СписокФайлов = Новый СписокЗначений;

СписокФайлов.Добавить(ПараметрКоманды,ИмяФайла);
	Если ЗначениеЗаполнено(ИмяФайлаИзвещения) Тогда	
	СписокФайлов.Добавить(ИмяФайлаИзвещения);
	КонецЕсли; 
СписокФайлов.Добавить("______________");
	Если Найти(ИмяФайла,"СБ") > 0 Тогда
	Каталог = ПолучитьКаталог(ПараметрКоманды);
	Маска = СокрЛП(Лев(ИмяФайла,Найти(ИмяФайла,"СБ")-1))+"*.*";
	МассивНайденных = НайтиФайлы(Каталог,Маска,Истина); 
		Для Каждого Файл из МассивНайденных Цикл 
			Если Не Файл.ЭтоФайл() Тогда
			Продолжить;		
			КонецЕсли;
		СписокФайлов.Добавить(Файл.Имя);
		КонецЦикла;
	Иначе
	Каталог = ПолучитьКаталог(ПараметрКоманды);
	Маска = СокрЛП(Лев(ИмяФайла,СтрДлина(ИмяФайла)-4))+"*.*";
	МассивНайденных = НайтиФайлы(Каталог,Маска,Истина); 
		Для Каждого Файл из МассивНайденных Цикл 
			Если Не Файл.ЭтоФайл() Тогда
			Продолжить;		
			КонецЕсли;
				Если Файл.Имя = ИмяФайла Тогда
				Продолжить;
				КонецЕсли; 
		СписокФайлов.Добавить(Файл.Имя);
		КонецЦикла;	
	КонецЕсли;
		Если СписокФайлов.Количество() > 2 Тогда
		ВыбДок = СписокФайлов.ВыбратьЭлемент("Выберите файл",ВыбДок);
			Если ВыбДок <> Неопределено Тогда
				Если ВыбДок.Значение = ПараметрКоманды Тогда
				ЗапуститьПриложение(ОбщийМодульВызовСервера.ПолучитьФайлДокумента(ПараметрКоманды));
				Иначе
				ЗапуститьПриложение(ОбщийМодульВызовСервера.ПолучитьФайлДокумента(ПараметрКоманды, ВыбДок.Значение));
				КонецЕсли; 
			КонецЕсли; 
		Иначе
		ЗапуститьПриложение(ОбщийМодульВызовСервера.ПолучитьФайлДокумента(СписокФайлов[0].Значение));
		КонецЕсли;
КонецПроцедуры
