
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
Макет = Отчеты.ОтчетПоКомментариямНеисправностей.ПолучитьМакет("Макет");
ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");
ОблКомментарийОбщие = Макет.ПолучитьОбласть("Комментарий|Общие");
ОблКонецОбщие = Макет.ПолучитьОбласть("Конец|Общие");
ОблШапкаЕстьНаЛинейке = Макет.ПолучитьОбласть("Шапка|ЕстьНаЛинейке");
ОблКомментарийЕстьНаЛинейке = Макет.ПолучитьОбласть("Комментарий|ЕстьНаЛинейке");
ОблКонецЕстьНаЛинейке = Макет.ПолучитьОбласть("Конец|ЕстьНаЛинейке");
ОблШапкаНетНаЛинейке = Макет.ПолучитьОбласть("Шапка|НетНаЛинейке");
ОблКомментарийНетНаЛинейке = Макет.ПолучитьОбласть("Комментарий|НетНаЛинейке");
ОблКонецНетНаЛинейке = Макет.ПолучитьОбласть("Конец|НетНаЛинейке");
ОблШапкаОбщие.Параметры.ДатаВывода = ТекущаяДата();
ТабДок.Вывести(ОблШапкаОбщие);
Линейки = Справочники.Линейки.Выбрать();
	Пока Линейки.Следующий() Цикл
	ОблШапкаЕстьНаЛинейке.Параметры.Линейка = Линейки.Ссылка;
	ТабДок.Присоединить(ОблШапкаЕстьНаЛинейке);
	КонецЦикла;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	КомментарииНеисправностейТабличнаяЧасть.Ссылка КАК Ссылка,
	|	КомментарииНеисправностейТабличнаяЧасть.РабочееМесто.Линейка КАК Линейка
	|ИЗ
	|	Справочник.КомментарииНеисправностей.ТабличнаяЧасть КАК КомментарииНеисправностейТабличнаяЧасть
	|ГДЕ
	|	КомментарииНеисправностейТабличнаяЧасть.РабочееМесто В(&СписокРМ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|ИТОГИ ПО
	|	Ссылка";
Запрос.УстановитьПараметр("СписокРМ", СписокРМ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаРМ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРМ.Следующий() Цикл
	ОблКомментарийОбщие.Параметры.Комментарий = ВыборкаРМ.Ссылка;
	ОблКомментарийОбщие.Параметры.Код = ВыборкаРМ.Ссылка.Код;
	ТабДок.Вывести(ОблКомментарийОбщие);
	Выборка = ВыборкаРМ.Выбрать();
	Линейки = Справочники.Линейки.Выбрать();
		Пока Линейки.Следующий() Цикл
		Выборка.Сбросить();
			Если Выборка.НайтиСледующий(Новый Структура("Линейка",Линейки.Ссылка)) Тогда
			ТабДок.Присоединить(ОблКомментарийЕстьНаЛинейке);
			Иначе
			ТабДок.Присоединить(ОблКомментарийНетНаЛинейке);
		    КонецЕсли;		
		КонецЦикла; 
	КонецЦикла;
ТабДок.Вывести(ОблКонецОбщие);
Линейки = Справочники.Линейки.Выбрать();
	Пока Линейки.Следующий() Цикл
	ТабДок.Присоединить(ОблКонецЕстьНаЛинейке);
	КонецЦикла;
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
