
Функция СозданПерепрогон(ДвижениеМПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Перепрогон.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Перепрогон КАК Перепрогон
	|ГДЕ
	|	Перепрогон.ДокументОснование = &ДокументОснование";
Запрос.УстановитьПараметр("ДокументОснование", ДвижениеМПЗ);
РезультатЗапроса = Запрос.Выполнить();
Возврат(Не РезультатЗапроса.Пустой());
КонецФункции 

&НаКлиенте
Процедура СоздатьПерепрогон(Команда)
	Если Не СозданПерепрогон(Элементы.Список.ТекущаяСтрока) Тогда
	ОткрытьФорму("Документ.ДвижениеМПЗ.Форма.ФормаПерепрогона",Новый Структура("Документ",Элементы.Список.ТекущаяСтрока),,,,, Новый ОписаниеОповещения("СоздатьПерепрогонЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
	Сообщить("Документы перепрогона уже были созданы!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПерепрогонЗавершение(Результат, ДополнительныеПараметры) Экспорт

КонецПроцедуры