
&НаСервере
Процедура ПечатьНомеровТарыНаСервере()
ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблБирка = Макет.ПолучитьОбласть("Бирка");
	Для к = Объект.НомерС По Объект.НомерПо Цикл
		Для л = 1 По КоличествоКопий Цикл
		ОблБирка.Параметры.Номер = Формат(к,"ЧЦ=3; ЧВН=");
		ТабДок.Вывести(ОблБирка);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;		
	КонецЦикла; 
ТабДок.РазмерСтраницы = "Custom";
ТабДок.ВысотаСтраницы = 102;
ТабДок.ШиринаСтраницы = 57;
ТабДок.ПолеСлева = 0;
ТабДок.ПолеСверху = 0;
ТабДок.ПолеСнизу = 0;
ТабДок.ПолеСправа = 0;
ТабДок.РазмерКолонтитулаСверху = 0;
ТабДок.РазмерКолонтитулаСнизу = 0;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьНомеровТары(Команда)
ПечатьНомеровТарыНаСервере();
КонецПроцедуры
