
&НаСервере
Процедура ПолучитьДанныеНаСервере()
Объект.Канбаны.Очистить();
Запрос = Новый Запрос;
 
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯчейкиКомплектацииСрезПоследних.МестоХранения,
	|	ЯчейкиКомплектацииСрезПоследних.МПЗ,
	|	ЯчейкиКомплектацииСрезПоследних.КоличествоЯчеек
	|ИЗ
	|	РегистрСведений.ЯчейкиКомплектации.СрезПоследних(&НаДату, ) КАК ЯчейкиКомплектацииСрезПоследних"; 
Запрос.УстановитьПараметр("НаДату", ТекущаяДата()); 
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТипЗнч(ВыборкаДетальныеЗаписи.МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВыбПодразделение = ВыборкаДетальныеЗаписи.МПЗ.Канбан.Подразделение;
		Иначе
		ВыбПодразделение = Константы.МестоХраненияОсновное.Получить().Подразделение;
		КонецЕсли;
			Если Не Объект.Подразделение.Пустая() Тогда
				Если ВыбПодразделение <> Объект.Подразделение Тогда				
				Продолжить;
				КонецЕсли;			
			КонецЕсли;
				Если ВыбПодразделение.ОформлятьПустыеКанбаны <> 1 Тогда
				Продолжить;		
				КонецЕсли;   
	ТЧ = Объект.Канбаны.Добавить();
	ТЧ.МестоХранения = ВыборкаДетальныеЗаписи.МестоХранения;
	ТЧ.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;	
	ТЧ.КоличествоЯчеек = ВыборкаДетальныеЗаписи.КоличествоЯчеек;
	ТЧ.ОформленоЯчеек = ОбщийМодульВызовСервера.ПолучитьКоличествоПустыхКанбановПоМестуХранения(ВыборкаДетальныеЗаписи.МестоХранения,ВыборкаДетальныеЗаписи.МПЗ);
	КонецЦикла;
		Если СортироватьПо = 1 Тогда
		Объект.Канбаны.Сортировать("МестоХранения,МПЗ");
		Иначе	
		Объект.Канбаны.Сортировать("МПЗ,МестоХранения");
		КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ПолучитьДанныеНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОформитьПустыеКанбаныНаСервере()
	Для каждого ТЧ Из Объект.Канбаны Цикл
		Если ТЧ.Пометка Тогда
			Для к = 1 По ТЧ.КоличествоПустыхЯчеек Цикл	
			ОбщийМодульРаботаСРегистрами.ОформитьПустойКанбан(ТЧ.МестоХранения,ТЧ.МПЗ);
			КонецЦикла; 
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОформитьПустыеКанбаны(Команда)
ОформитьПустыеКанбаныНаСервере();
Сообщить("Оформление завершено!"); 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
СортироватьПо = 1;
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоПриИзменении(Элемент)
	Если СортироватьПо = 1 Тогда
	Объект.Канбаны.Сортировать("МестоХранения,МПЗ");
	Иначе	
	Объект.Канбаны.Сортировать("МПЗ,МестоХранения");
	КонецЕсли; 
КонецПроцедуры
