
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Объект.НаДату = НачалоМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура НаДатуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Объект.НаДату = НачалоМесяца(Результат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНормОборудования(Наименование, СтоимостьПлановая, СтоимостьРасчётная)
Оборудование = Справочники.ТехОснастка.НайтиПоНаименованию(Наименование,Истина);
	Если Не Оборудование.Пустая() Тогда
	РО = РегистрыСведений.Оборудование.СоздатьМенеджерЗаписи();
	РО.Период = Объект.НаДату;
	РО.Оборудование = Оборудование;    
	РО.СтоимостьМЧПлановая = СтоимостьПлановая;
	РО.СтоимостьМЧРасчётная = СтоимостьРасчётная;
	РО.Записать(Истина); 	
	Иначе	
	Сообщить(Наименование + " - оборудование не найдено!");	
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура Загрузить(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c нормами оборудования");
	Если Результат <> Неопределено Тогда
	СЗ = Новый СписокЗначений;

	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка норм оборудования из файла...");
       	ЗагрузитьНормОборудования(СокрЛП(ExcelЛист.Cells(к,1).Value),Число(ExcelЛист.Cells(к,2).Value),Число(ExcelЛист.Cells(к,3).Value));
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;  
КонецПроцедуры
