
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
МестаХранения = РегистрыНакопления.МестаХранения;
// регистр МестаХранения Расход
Движения.МестаХранения.Записывать = Истина;
ВиртуальнаяТабличнаяЧасть = ТабличнаяЧасть.Выгрузить();
ВиртуальнаяТабличнаяЧасть.Свернуть("МПЗ,ЕдиницаИзмерения","Количество");
	Для Каждого ТЧ Из ВиртуальнаяТабличнаяЧасть Цикл
	Фильтр   = Новый Структура;
	Фильтр.Вставить("МестоХранения",Линейка.МестоХраненияКанбанов);
	Фильтр.Вставить("МПЗ", ТЧ.МПЗ);
	Остаток = МестаХранения.Остатки(Дата,Фильтр,"МПЗ", "Количество");
	БазовоеКоличество = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения);
		Если Остаток.Количество() > 0 Тогда
			Если Остаток[0].Количество < БазовоеКоличество Тогда
			Отказ = Истина;
			Сообщить("МПЗ "+ТЧ.МПЗ+" требуется списать: "+БазовоеКоличество+" наличествует на складе: "+Остаток[0].Количество);
			Продолжить;
			КонецЕсли; 		
		Иначе	
		Отказ = Истина;
		Сообщить("МПЗ "+ТЧ.МПЗ+" требуется списать: "+БазовоеКоличество+" наличествует на складе: 0");		
		КонецЕсли; 
	Движение = Движения.МестаХранения.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.МестоХранения = Линейка.МестоХраненияКанбанов;
		Если ТипЗнч(ТЧ.МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
		Движение.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
		Иначе	
		Движение.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
		КонецЕсли; 
	Движение.МПЗ = ТЧ.МПЗ;
	Движение.Количество = БазовоеКоличество;
	КонецЦикла;
//Откат этапов производственного задания до заданного рабочего места
ЭПЗ = РегистрыСведений.ЭтапыПроизводственныхЗаданий.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("ПЗ",ДокументОснование));
	Если ЭПЗ.Ремонт Тогда
	флНайдено = Ложь;
	Выборка = РегистрыСведений.ЭтапыПроизводственныхЗаданий.Выбрать(,,Новый Структура("ПЗ",ДокументОснование));
		Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = Выборка.ПолучитьМенеджерЗаписи();
		МенеджерЗаписи.Прочитать();
		ПрефиксРМ = СокрЛП(МенеджерЗаписи.РабочееМесто.ГруппаРабочихМест.Префикс);
	   		Если МенеджерЗаписи.РабочееМесто = РабочееМесто Тогда
			флНайдено = Истина;
				Если СокрЛП(ПрефиксРМ) = "СТ" Тогда
				СуществующийСП = РегистрыСведений.СтендовыйПрогон.ПолучитьПоследнее(,Новый Структура("ПЗ",ДокументОснование));
				СП = РегистрыСведений.СтендовыйПрогон.СоздатьМенеджерЗаписи();
				СП.Период = ТекущаяДата();
				СП.ПЗ = ДокументОснование;
				СП.Изделие = ДокументОснование.Изделие;
				СП.БарКод = ДокументОснование.БарКод;
				СП.Стенд = РабочееМесто.Стенд;
				СП.Прогон = СуществующийСП.Прогон+1;
				СП.ИсполнительПоступление = РабочееМесто.Стенд.Исполнитель;
				СП.ДатаПоступления = ТекущаяДата();
				СП.ИсполнительПостановка = РабочееМесто.Стенд.Исполнитель;
				СП.ДатаПостановки = ТекущаяДата();
				СП.Записать();
				МенеджерЗаписи.ДатаОкончания = Дата(1,1,1);
				МенеджерЗаписи.Ремонт = Ложь;
				МенеджерЗаписи.Записать();
				Иначе
				МенеджерЗаписи.Исполнитель = Справочники.Сотрудники.ПустаяСсылка();
				МенеджерЗаписи.ДатаНачала = Дата(1,1,1);
				МенеджерЗаписи.ДатаОкончания = Дата(1,1,1);
				МенеджерЗаписи.Ремонт = Ложь;	
				МенеджерЗаписи.Записать();
				КонецЕсли; 
			Выпуск = Документы.ВыпускПродукции.НайтиПоНомеру(СокрЛП(ДокументОснование.Номер)+"-"+ПрефиксРМ,Дата);
				Если Не Выпуск.Пустая() Тогда
				ДокВыпуск = Выпуск.ПолучитьОбъект();					
				ДокВыпуск.Удалить();
				Иначе
				Выпуск = Документы.ВыпускПродукции.НайтиПоНомеру(СокрЛП(ДокументОснование.Номер)+"-"+ПрефиксРМ,НачалоГода(ТекущаяДата())-1);
					Если Не Выпуск.Пустая() Тогда
					ДокВыпуск = Выпуск.ПолучитьОбъект();					
					ДокВыпуск.Удалить();
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если флНайдено Тогда
				Выпуск = Документы.ВыпускПродукции.НайтиПоНомеру(СокрЛП(ДокументОснование.Номер)+"-"+ПрефиксРМ,Дата);
					Если Не Выпуск.Пустая() Тогда
					ДокВыпуск = Выпуск.ПолучитьОбъект();					
					ДокВыпуск.Удалить();
					Иначе
					Выпуск = Документы.ВыпускПродукции.НайтиПоНомеру(СокрЛП(ДокументОснование.Номер)+"-"+ПрефиксРМ,НачалоГода(ТекущаяДата())-1);
						Если Не Выпуск.Пустая() Тогда
						ДокВыпуск = Выпуск.ПолучитьОбъект();					
						ДокВыпуск.Удалить();
						КонецЕсли;
					КонецЕсли; 
				МенеджерЗаписи.Удалить();	
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры
