
&НаСервере
Функция ПолучитьМПЗ(Наименование)
Возврат(Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина)); 
КонецФункции

&НаСервере
Процедура ДобавитьМПЗ(МПЗ,Количество,Цена)
ТЧ = Объект.ТабличнаяЧасть.Добавить();
ТЧ.МПЗ = МПЗ;
ТЧ.Количество = Количество;
ТЧ.Цена = Цена;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c договорными позициями");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка договорных позиций из файла..."); 
		НаименованиеМПЗ = СокрЛП(ExcelЛист.Cells(к,1).Value);
		МПЗ = ПолучитьМПЗ(НаименованиеМПЗ);
			Если Не МПЗ.Пустая() Тогда
			ДобавитьМПЗ(МПЗ,Число(ExcelЛист.Cells(к,2).Value),Число(ExcelЛист.Cells(к,3).Value));
			Иначе
			Сообщить(НаименованиеМПЗ + " - МПЗ не найден!");
			КонецЕсли; 
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПодборМПЗНаСервере(ТаблицаМПЗ)
	Для каждого ТЧ_МПЗ Из ТаблицаМПЗ Цикл
	ТЧ = Объект.ТабличнаяЧасть.Добавить();
	ТЧ.МПЗ = ТЧ_МПЗ.МПЗ;
	ТЧ.Количество = ТЧ_МПЗ.Количество;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПодборМПЗ(Команда)
ТаблицаМПЗ = ОткрытьФормуМодально("ОбщаяФорма.ПодборМПЗ", Новый Структура("МестоХранения,Договор",Неопределено,Объект.Договор));
	Если ТаблицаМПЗ <> Неопределено Тогда
		Если ТаблицаМПЗ.Количество() > 0 Тогда
			Если Объект.ТабличнаяЧасть.Количество() > 0 Тогда
				Если Вопрос("Очистить таблицу?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.ТабличнаяЧасть.Очистить();		
				КонецЕсли; 			
			КонецЕсли; 
		ПодборМПЗНаСервере(ТаблицаМПЗ);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПроверитьДоговор(Договор)
	Если Договор.ПометкаУдаления Тогда
	Сообщить("Договор помечен на удаление.");
	Возврат(Ложь); 
	КонецЕсли;
		Если Договор.ДоговорСНефиксированнымиЦенами Тогда
		Сообщить("Договор с нефиксированными ценами.");
		Возврат(Ложь); 
		КонецЕсли; 
			Если Не Договор.УчётКоличества Тогда
			Сообщить("Договор без учёта количества.");
			Возврат(Ложь); 
			КонецЕсли; 
Возврат(Истина); 
КонецФункции

&НаКлиенте
Процедура ДоговорОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
СтандартнаяОбработка = ПроверитьДоговор(ВыбранноеЗначение); 
КонецПроцедуры
