
&НаСервере
Процедура СформироватьНаСервере()
ТабДок = Новый ТабличныйДокумент;

Макет = Отчеты.ОтчетПоРемонту.ПолучитьМакет("Макет");
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.МТК = Отчет.ПЗ.ДокументОснование;
ОблШапка.Параметры.ПЗ = Отчет.ПЗ;
ОблШапка.Параметры.Спецификация = Отчет.ПЗ.Изделие;
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	РемонтнаяКарта.Изделие,
	|	РемонтнаяКарта.ДатаНачала,
	|	РемонтнаяКарта.ДатаОтложен,
	|	РемонтнаяКарта.ДатаОкончания,
	|	РемонтнаяКарта.ПричинаРемонта,
	|	РемонтнаяКарта.Комментарий,
	|	РемонтнаяКарта.Ссылка
	|ИЗ
	|	Документ.РемонтнаяКарта КАК РемонтнаяКарта
	|ГДЕ
	|	РемонтнаяКарта.ДокументОснование = &ДокументОснование";
Запрос.УстановитьПараметр("ДокументОснование", Отчет.ПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ОблСтрока.Параметры.ЭтапВхода = ВыборкаДетальныеЗаписи.Изделие;
	ОблСтрока.Параметры.ДатаНачалаРемонта = ВыборкаДетальныеЗаписи.ДатаНачала;
	ОблСтрока.Параметры.ДатаОкончанияРемонта = ВыборкаДетальныеЗаписи.ДатаОкончания;
	ОблСтрока.Параметры.ДатаНачалаОстановки = ВыборкаДетальныеЗаписи.ДатаОтложен;
	ОблСтрока.Параметры.ДатаОкончанияОстановки = ВыборкаДетальныеЗаписи.ДатаОкончания;
	ОблСтрока.Параметры.Комментарий = СокрЛП(ВыборкаДетальныеЗаписи.ПричинаРемонта.Наименование) + " (" + СокрЛП(ВыборкаДетальныеЗаписи.Комментарий) + ")";
		Если (ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОтложен))и(Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОкончания)) Тогда
		ОблСтрока.Параметры.СтатусРемонта = "Отложен";
		Иначе
		ОблСтрока.Параметры.СтатусРемонта = ?(ВыборкаДетальныеЗаписи.Ссылка.Проведен,"Завершён","Ремонт");
		КонецЕсли;
	ОблСтрока.Параметры.Ремонт = ВыборкаДетальныеЗаписи.Ссылка;
	ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПЗ") Тогда
	Отчет.ПЗ = Параметры.ПЗ;
	СформироватьНаСервере();	
	КонецЕсли; 
КонецПроцедуры
