
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
НормыАНР = РегистрыСведений.АналогиНормРасходов.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("АналогНормыРасходов",Объект.Ссылка));
Норма = НормыАНР.Норма;
	Если (ТипЗнч(Объект.Элемент) = Тип("СправочникСсылка.Материалы"))или
		 (ТипЗнч(Объект.Элемент) = Тип("СправочникСсылка.Номенклатура"))Тогда
	Элементы.ЕдИзмЭлемента.Заголовок = Объект.Элемент.ОсновнаяЕдиницаИзмерения.Наименование;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
РегистрНормРасходов.Параметры.УстановитьЗначениеПараметра("АналогНормыРасходов",Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
НормыАНР = РегистрыСведений.АналогиНормРасходов.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("АналогНормыРасходов",Объект.Ссылка));
	Если Норма <> НормыАНР.Норма Тогда
	РАНР = РегистрыСведений.АналогиНормРасходов.СоздатьМенеджерЗаписи();
	РАНР.Период = ТекущаяДата();
	РАНР.Владелец = Объект.Ссылка.Владелец;
	РАНР.АналогНормыРасходов = Объект.Ссылка;
	РАНР.Норма = Норма;
	РАНР.Записать();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьОсновнуюЕдиницуИзмерения(ВыбЭлемент);
Возврат(ВыбЭлемент.ОсновнаяЕдиницаИзмерения.Наименование);
КонецФункции

&НаКлиенте
Процедура ЭлементНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
П = Новый Структура("ТекущаяСтрока",Объект.Элемент);
	Если Элементы.ВидЭлемента.ТекстРедактирования = "Материал" Тогда
	Результат = ОткрытьФормуМодально("Справочник.Материалы.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	Объект.Наименование = "Материал, "+Результат;
	Элементы.ЕдИзмЭлемента.Заголовок = ПолучитьОсновнуюЕдиницуИзмерения(Результат);
	ИначеЕсли Элементы.ВидЭлемента.ТекстРедактирования = "Тех. операция" Тогда	
	Результат = ОткрытьФормуМодально("Справочник.ТехОперации.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	Объект.Наименование = "Тех. операция, "+Результат;
	ИначеЕсли Элементы.ВидЭлемента.ТекстРедактирования = "Тех. оснастка" Тогда	
	Результат = ОткрытьФормуМодально("Справочник.ТехОснастка.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	Объект.Наименование = "Тех. оснастка, "+Результат;	
	ИначеЕсли (Элементы.ВидЭлемента.ТекстРедактирования = "Документ")или
			  (Элементы.ВидЭлемента.ТекстРедактирования = "Программа")Тогда	
	Предупреждение("Документ или программа не могут выступать в качестве аналогов!");
	Иначе
	Результат = ОткрытьФормуМодально("Справочник.Номенклатура.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	Объект.Наименование = Строка(Объект.ВидЭлемента)+", "+Результат;
	Элементы.ЕдИзмЭлемента.Заголовок = ПолучитьОсновнуюЕдиницуИзмерения(Результат);			
	КонецЕсли;
Объект.Элемент = Результат;		
КонецПроцедуры
