
Процедура ОбработкаПроведения(Отказ, Режим)
// регистр ПланыВыпуска Приход
Движения.ПланыВыпуска.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
	Движение = Движения.ПланыВыпуска.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Линейка = Линейка;
	Движение.Подразделение = Линейка.Подразделение;
	Движение.Номенклатура = ТекСтрокаТабличнаяЧасть.Номенклатура;
	Движение.МаршрутнаяКарта = ТекСтрокаТабличнаяЧасть.МаршрутнаяКарта;
	Движение.Количество = ТекСтрокаТабличнаяЧасть.Количество;
	КонецЦикла;
КонецПроцедуры
