
&НаКлиенте
Процедура НаДатуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Объект.НаДату = НачалоМесяца(Результат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(Наименование,ЗарплатнаяЧасть,СебестоимостьПолная)
Выборка = Справочники.Номенклатура.Выбрать(,,Новый Структура("Наименование",Наименование));
флНайден = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ПолучитьСтатус(Выборка.Ссылка) <> Перечисления.СтатусыСпецификаций.Запрещённая Тогда
		флНайден = Истина;
		Себестоимость = РегистрыСведений.Себестоимость.ПолучитьПоследнее(Объект.НаДату,Новый Структура("Номенклатура,Подразделение",Выборка.Ссылка,Объект.Подразделение));
			Если (Себестоимость.ЗарплатнаяЧасть <> ЗарплатнаяЧасть)или(Себестоимость.СебестоимостьПолная <> СебестоимостьПолная) Тогда
			НоваяСебестоимость = РегистрыСведений.Себестоимость.СоздатьМенеджерЗаписи();
			НоваяСебестоимость.Период = Объект.НаДату;
		    НоваяСебестоимость.Номенклатура = Выборка.Ссылка;
			НоваяСебестоимость.Подразделение = Объект.Подразделение;
			НоваяСебестоимость.ЗарплатнаяЧасть = ЗарплатнаяЧасть;
			НоваяСебестоимость.СебестоимостьПолная = СебестоимостьПолная;
			НоваяСебестоимость.Записать(Истина);
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
		Если Не флНайден Тогда
		Сообщить(Наименование + " - не найдена в справочнике!");
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c себестоимостью");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка себестоимости..."); 
        ЗагрузитьНаСервере(СокрЛП(ExcelЛист.Cells(к,1).Value),ExcelЛист.Cells(к,2).Value,ExcelЛист.Cells(к,3).Value);
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры
