
&НаКлиенте
Процедура Создать(Команда)
Закрыть(Объект.Этапы);
КонецПроцедуры

&НаСервере
Процедура РаскрытьНаЭтапы(СписокСозданныхЭтапов,Спецификация,Количество,Уровень,флКанбан)
Основа = Справочники.НормыРасходов.ПустаяСсылка();
НР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н(Спецификация,ТекущаяДата());
	Пока НР.Следующий() Цикл
		Если НР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Основа Тогда
		Основа = НР.Ссылка;
		НормаОсновы = НР.Норма;
		ИначеЕсли НР.ВидЭлемента <> Перечисления.ВидыЭлементовНормРасходов.Набор Тогда					
		Этап = Объект.Этапы.Добавить();
		Этап.Порядок = Этап.НомерСтроки;
		Этап.Спецификация = НР.Элемент;
		Этап.Количество = ПолучитьБазовоеКоличество(НР.Норма,НР.Элемент.ОсновнаяЕдиницаИзмерения)*Количество;
		Этап.ВидКанбана = НР.Элемент.Канбан;
            Если СписокСозданныхЭтапов.Найти(НР.Элемент) <> Неопределено Тогда
			Этап.МТК = Параметры.МТК;
			КонецЕсли;
				Если Уровень = 1 Тогда
				Этап.ОсновнойЭтап = Истина;
				КонецЕсли; 
					Если НР.Элемент.Канбан.Пустая() Тогда
					РаскрытьНаЭтапы(СписокСозданныхЭтапов,НР.Элемент,ПолучитьБазовоеКоличество(НР.Норма,НР.Элемент.ОсновнаяЕдиницаИзмерения)*Количество,Уровень+1,Не НР.Элемент.Канбан.Пустая());
					КонецЕсли; 
		Иначе
		Продолжить;
		КонецЕсли; 
	КонецЦикла;	
		Если Не Основа.Пустая() Тогда
		Нормы = РегистрыСведений.НормыРасходов.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("НормаРасходов",Основа));
		Этап = Объект.Этапы.Добавить();
		Этап.Порядок = Этап.НомерСтроки;
		Этап.Спецификация = Основа.Элемент;
		Этап.Количество = ПолучитьБазовоеКоличество(НормаОсновы,Основа.Элемент.ОсновнаяЕдиницаИзмерения)*Количество;
		Этап.ВидКанбана = Основа.Элемент.Канбан;
            Если СписокСозданныхЭтапов.Найти(Основа.Элемент) <> Неопределено Тогда
			Этап.МТК = Параметры.МТК;
			КонецЕсли;
				Если Уровень = 1 Тогда
				Этап.ОсновнойЭтап = Истина;
				КонецЕсли; 
		РаскрытьНаЭтапы(СписокСозданныхЭтапов,Основа.Элемент,ПолучитьБазовоеКоличество(НормаОсновы,Основа.Элемент.ОсновнаяЕдиницаИзмерения)*Количество,Уровень,Не Основа.Элемент.Канбан.Пустая());
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
СписокСозданныхЭтапов = Параметры.МТК.Этапы.Выгрузить(,"ЭтапСпецификации");	
Этап = Объект.Этапы.Добавить();
Этап.Порядок = 0;
Этап.Спецификация = Параметры.МТК.Номенклатура;
Этап.Количество = Параметры.МТК.Количество;
Этап.ВидКанбана = Параметры.МТК.Номенклатура.Канбан;
    Если СписокСозданныхЭтапов.Найти(Параметры.МТК.Номенклатура) <> Неопределено Тогда
	Этап.МТК = Параметры.МТК;
	КонецЕсли;
Этап.ОсновнойЭтап = Истина;
РаскрытьНаЭтапы(СписокСозданныхЭтапов,Параметры.МТК.Номенклатура,Параметры.МТК.Количество,1,0);
Объект.Этапы.Сортировать("Порядок Убыв");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из Объект.Этапы Цикл
	ТЧ.Пометка = Ложь;	
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ПометкаВыбранногоНаСервере(ТекСтрока)
ТЧ = Объект.Этапы.Получить(Объект.Этапы.Индекс(Объект.Этапы.НайтиПоИдентификатору(ТекСтрока)));
ТЧ.Пометка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПометкаВыбранных(Команда)
	Для каждого ТекСтрока из Элементы.Этапы.ВыделенныеСтроки Цикл
	ПометкаВыбранногоНаСервере(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ВыбратьАвтоматическиНаСервере()
	Для каждого ТЧ Из Объект.Этапы Цикл
		Если (ТЧ.ВидКанбана.Пустая())и(ТЧ.МТК.Пустая()) Тогда
		ТЧ.Пометка = Истина;
		Иначе
		ТЧ.Пометка = Ложь;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьАвтоматически(Команда)
ВыбратьАвтоматическиНаСервере();
КонецПроцедуры
