
&НаСервере
Процедура ЗагрузитьИзмененияНаСервере(Период,Наименование,Цена)
МПЗ = Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина);
	Если Не МПЗ.Пустая() Тогда
	ЦИ = РегистрыСведений.ЦеныИзменение.СоздатьМенеджерЗаписи();
	ЦИ.Период = Период;
	ЦИ.МПЗ = МПЗ;	
	ЦИ.Цена = Цена;
	ЦИ.Валюта = Валюта;
	ЦИ.Записать(Истина);
	Иначе
	Сообщить(""+Наименование+" - материал не найден!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзменения(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл с измененными ценами на материалы");
		Если Результат <> Неопределено Тогда
		ExcelЛист = Результат.ExcelЛист;
		КолСтрок = Результат.КоличествоСтрок;
		    Для к = 2 по КолСтрок Цикл
			Состояние("Обработка...",к*100/КолСтрок,"Загрузка изменений цен на материалы...");
				Попытка
				ЗагрузитьИзмененияНаСервере(ExcelЛист.Cells(к,1).Value,СокрЛП(ExcelЛист.Cells(к,2).Value),Число(ExcelЛист.Cells(к,3).Value));
				Исключение
				Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
