 
&НаСервере 
Перем ТаблицаПитателей,СписокЭтаповСпецификации;

&НаСервере
Процедура РаскрытьНаМПЗ(ЭтапСпецификации,КолУзла)
СписокЭтаповСпецификации.Вставить(0,ЭтапСпецификации); 
Запрос = Новый Запрос; 

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходов.Элемент КАК Элемент,
	|	СУММА(НормыРасходовСрезПоследних.Норма) КАК Количество
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних(&НаДату, ) КАК НормыРасходовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыРасходов КАК НормыРасходов
	|		ПО НормыРасходовСрезПоследних.НормаРасходов = НормыРасходов.Ссылка
	|ГДЕ
	|	НормыРасходов.Владелец = &Владелец
	|	И (НормыРасходов.Элемент ССЫЛКА Справочник.Номенклатура
	|			ИЛИ НормыРасходов.Элемент ССЫЛКА Справочник.Материалы)
	|	И НормыРасходов.ПометкаУдаления = ЛОЖЬ
	|	И НормыРасходовСрезПоследних.Норма > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	НормыРасходов.Элемент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НормыРасходов.Элемент.Наименование";
Запрос.УстановитьПараметр("НаДату", НаДату);
Запрос.УстановитьПараметр("Владелец", ЭтапСпецификации);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныхЗаписей = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
	Количество = ПолучитьБазовоеКоличество(ВыборкаДетальныхЗаписей.Количество,ВыборкаДетальныхЗаписей.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
		Если ТипЗнч(ВыборкаДетальныхЗаписей.Элемент) = Тип("СправочникСсылка.Материалы") Тогда 
			Если Найти(ВыборкаДетальныхЗаписей.Элемент.Родитель.Наименование,"0 - Платы") > 0  Тогда
			Продолжить;
			КонецЕсли;
		ТЧ = ТаблицаПитателей.Добавить();
		ТЧ.Спецификация = ЭтапСпецификации;
		ТЧ.МПЗ = ВыборкаДетальныхЗаписей.Элемент;	
		ТЧ.Количество = Количество;
			Для каждого ТЧ_П Из ВыборкаДетальныхЗаписей.Элемент.СтационарныеПитатели Цикл
				Если Найти(ТЧ_П.Линейка.Наименование,"С01") > 0  Тогда
				ТЧ.СП1 = 1;
				ИначеЕсли Найти(ТЧ_П.Линейка.Наименование,"С02") > 0  Тогда					
				ТЧ.СП2 = 1;				
				ИначеЕсли Найти(ТЧ_П.Линейка.Наименование,"С03") > 0  Тогда					
				ТЧ.СП3 = 1;
				КонецЕсли;			
			КонецЦикла;
				Если ТЧ.СП1 = 0 Тогда					
				ТЧ.НП1 = 1;
				КонецЕсли;
					Если ТЧ.СП2 = 0 Тогда					
					ТЧ.НП2 = 1;
					КонецЕсли;
						Если ТЧ.СП3 = 0 Тогда					
						ТЧ.НП3 = 1;
						КонецЕсли;
        Иначе
        РаскрытьНаМПЗ(ВыборкаДетальныхЗаписей.Элемент,Количество);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСпецификация = Макет.ПолучитьОбласть("Спецификация");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.НаДату = ТекущаяДата();
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;
СписокЭтаповСпецификации = Новый СписокЗначений;
ТаблицаПитателей = Новый ТаблицаЗначений;
                                         
ТаблицаПитателей.Колонки.Добавить("Спецификация");
ТаблицаПитателей.Колонки.Добавить("МПЗ");
ТаблицаПитателей.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(14,3)));
ТаблицаПитателей.Колонки.Добавить("НП1",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4,0)));
ТаблицаПитателей.Колонки.Добавить("НП2",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4,0)));
ТаблицаПитателей.Колонки.Добавить("НП3",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4,0)));
ТаблицаПитателей.Колонки.Добавить("СП1",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4,0)));
ТаблицаПитателей.Колонки.Добавить("СП2",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4,0)));
ТаблицаПитателей.Колонки.Добавить("СП3",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4,0)));

	Если ИсключитьЗапрещённые Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыМПЗ.СрезПоследних КАК СтатусыМПЗСрезПоследних
		|		ПО Номенклатура.Ссылка = СтатусыМПЗСрезПоследних.МПЗ
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&СписокНоменклатуры)
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		|	И СтатусыМПЗСрезПоследних.Статус <> &Статус"; 	        
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыСпецификаций.Запрещённая);
	Иначе	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&СписокНоменклатуры)
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ"; 	
	КонецЕсли;
Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокЭтаповСпецификации.Очистить();
	ТаблицаПитателей.Очистить(); 
	РаскрытьНаМПЗ(ВыборкаДетальныеЗаписи.Ссылка,1);
	Стр = 1;	
		Для каждого ЭтапСпецификации Из СписокЭтаповСпецификации Цикл
		ОблСпецификация.Параметры.Наименование = СокрЛП(ЭтапСпецификации.Значение.Наименование);
		ОблСпецификация.Параметры.Спецификация = ЭтапСпецификации.Значение;	                                                                
		Количество = 0;
		КоличествоРазличных = 0;
		КоличествоРазличныхБезПС1 = 0;
		СП1 = 0;
		СП2 = 0;
		СП3 = 0;
		СПБ1 = 0;
		СПБ2 = 0;
		СПБ3 = 0;
		НП1 = 0;
		НП2 = 0;
		НП3 = 0;
		Выборка = ТаблицаПитателей.НайтиСтроки(Новый Структура("Спецификация",ЭтапСпецификации.Значение));	
			Для к = 0 По Выборка.ВГраница() Цикл
			Количество = Количество + Выборка[к].Количество;
			КоличествоРазличных = КоличествоРазличных + 1;
			СП1 = СП1 + Выборка[к].СП1;
			СП2 = СП2 + Выборка[к].СП2;
			СП3 = СП3 + Выборка[к].СП3;
			НП1 = НП1 + Выборка[к].НП1;
			НП2 = НП2 + Выборка[к].НП2;
			НП3 = НП3 + Выборка[к].НП3;
				Если Стр = 2 Тогда
				ВыборкаМПЗ = ТаблицаПитателей.НайтиСтроки(Новый Структура("МПЗ",Выборка[к].МПЗ));
					Если ВыборкаМПЗ.Количество() < 2 Тогда
					КоличествоРазличныхБезПС1 = КоличествоРазличныхБезПС1 + 1;
					СПБ1 = СПБ1 + Выборка[к].СП1;
					СПБ2 = СПБ2 + Выборка[к].СП2;
					СПБ3 = СПБ3 + Выборка[к].СП3;
					КонецЕсли;
				КонецЕсли;			
			КонецЦикла;
 		ОблСпецификация.Параметры.Количество = Количество;
			Если Стр = 2 Тогда
            ОблСпецификация.Параметры.КоличествоРазличныхБезПС1 = КоличествоРазличныхБезПС1;
			Иначе
            ОблСпецификация.Параметры.КоличествоРазличныхБезПС1 = "";
			КонецЕсли;
 		ОблСпецификация.Параметры.КоличествоРазличных = КоличествоРазличных;
 		ОблСпецификация.Параметры.СП1 = СП1;
 		ОблСпецификация.Параметры.СП2 = СП2;
 		ОблСпецификация.Параметры.СП3 = СП3;
 		ОблСпецификация.Параметры.НП1 = НП1;
 		ОблСпецификация.Параметры.НП2 = НП2;
 		ОблСпецификация.Параметры.НП3 = НП3; 
 		ОблСпецификация.Параметры.СПБ1 = СПБ1;
 		ОблСпецификация.Параметры.СПБ2 = СПБ2;
 		ОблСпецификация.Параметры.СПБ3 = СПБ3;			
		ТабДок.Вывести(ОблСпецификация);
		ТабДок.НачатьГруппуСтрок("Спецификация",Ложь);
			Для к = 0 По Выборка.ВГраница() Цикл
			ОблМПЗ.Параметры.Наименование = СокрЛП(Выборка[к].МПЗ.Наименование);
			ОблМПЗ.Параметры.МПЗ = Выборка[к].МПЗ;
 			ОблМПЗ.Параметры.Количество = Выборка[к].Количество;
	 		ОблМПЗ.Параметры.СП1 = ?(Выборка[к].СП1 > 0,"+","");
	 		ОблМПЗ.Параметры.СП2 = ?(Выборка[к].СП2 > 0,"+","");
	 		ОблМПЗ.Параметры.СП3 = ?(Выборка[к].СП3 > 0,"+","");
	 		ОблМПЗ.Параметры.НП1 = ?(Выборка[к].НП1 > 0,"+","");
	 		ОблМПЗ.Параметры.НП2 = ?(Выборка[к].НП2 > 0,"+","");
	 		ОблМПЗ.Параметры.НП3 = ?(Выборка[к].НП3 > 0,"+","");
				Если Стр = 2 Тогда
				ВыборкаМПЗ = ТаблицаПитателей.НайтиСтроки(Новый Структура("МПЗ",Выборка[к].МПЗ));
					Если ВыборкаМПЗ.Количество() < 2 Тогда 
			 		ОблМПЗ.Параметры.СПБ1 = ?(Выборка[к].СП1 > 0,"+","");
			 		ОблМПЗ.Параметры.СПБ2 = ?(Выборка[к].СП2 > 0,"+","");
			 		ОблМПЗ.Параметры.СПБ3 = ?(Выборка[к].СП3 > 0,"+","");
					Иначе
	 		 		ОблМПЗ.Параметры.СПБ1 = "";
			 		ОблМПЗ.Параметры.СПБ2 = "";
			 		ОблМПЗ.Параметры.СПБ3 = "";
					КонецЕсли;
				Иначе
 		 		ОблМПЗ.Параметры.СПБ1 = "";
		 		ОблМПЗ.Параметры.СПБ2 = "";
		 		ОблМПЗ.Параметры.СПБ3 = "";
				КонецЕсли;
			ТабДок.Вывести(ОблМПЗ);			
			КонецЦикла;	
		ТабДок.ЗакончитьГруппуСтрок();
		Стр = Стр + 1;	
		КонецЦикла;
	КонецЦикла;
ТабДок.Вывести(ОблКонец); 
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
