
Процедура ОбработкаПроведения(Отказ, Режим)
// регистр МестаХранения Приход
Движения.МестаХранения.Записывать = Истина;
	Для Каждого ТЧ Из ТабличнаяЧасть Цикл
	Движение = Движения.МестаХранения.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.МестоХранения = МестоХранения;
	Движение.ВидМПЗ = ТЧ.ВидМПЗ;
	Движение.МПЗ = ТЧ.МПЗ;
	Движение.Количество = ТЧ.Количество;
		Если ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы Тогда
		// регистр Цены Изменение
		Движения.Цены.Записывать = Истина;
		Движение = Движения.Цены.Добавить();
		Движение.Период = Дата;
		Движение.МПЗ = ТЧ.МПЗ;
		Движение.Цена = ТЧ.Цена;		
		КонецЕсли; 		
	КонецЦикла;
// регистр ГТД Приход
Движения.ГТД.Записывать = Истина;
	Для Каждого ТЧ Из ТабличнаяЧасть Цикл
		Если Не ТЧ.ГТД.Пустая() Тогда
		Движение = Движения.ГТД.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТЧ.МПЗ;
		Движение.НомерГТД = ТЧ.ГТД;
		Движение.Количество = ТЧ.Количество;
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры
