
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
	Если ДанныеЗаполнения <> Неопределено Тогда
	Номер = ДанныеЗаполнения.Ссылка.Номер;
	Подразделение = ДанныеЗаполнения.ДокументОснование.Подразделение;
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если МестоХранения.Пустая() Тогда
	Отказ = Истина;	
	Сообщить("Не заполнено место хранения!");
	Возврат;
	КонецЕсли; 
МестоХраненияКанбанов = ДокументОснование.Линейка.МестоХраненияКанбанов;
// регистр ПередачиВПроизводство
Движения.ПередачиВПроизводство.Записывать = Истина;
// регистр МестаХранения Приход
Движения.МестаХранения.Записывать = Истина;
ВиртуальнаяТабличнаяЧасть = Списание.Выгрузить();
ВиртуальнаяТабличнаяЧасть.Свернуть("ВидМПЗ,МПЗ,ЕдиницаИзмерения","Количество");
	Для Каждого ТЧ Из ВиртуальнаяТабличнаяЧасть Цикл 
	Требуется = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения);
		Если ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты Тогда
			Если Не ТЧ.МПЗ.Канбан.Пустая() Тогда	
				Если Не ТЧ.МПЗ.Канбан.РезервироватьВПроизводстве Тогда		
				КолОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоМестуХранения(МестоХраненияКанбанов,ТЧ.МПЗ,Дата);
					Если КолОстаток >= Требуется Тогда
					Движение = Движения.МестаХранения.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.МестоХранения = МестоХраненияКанбанов;
					Движение.ВидМПЗ = ТЧ.ВидМПЗ;
					Движение.МПЗ = ТЧ.МПЗ;
					Движение.Количество = Требуется;
					Иначе
					Отказ = Истина;
					Сообщить("Канбан без резервирования "+СокрЛП(ТЧ.МПЗ.Наименование)+" требуется: "+Требуется+" недостаёт на складе: "+Строка(Требуется-КолОстаток)+" (Оформите излишки!)");
					КонецЕсли; 		
				Продолжить; 
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КолОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПП(ДокументОснование.ДокументОснование,ТЧ.ВидМПЗ,ТЧ.МПЗ,Дата);	
		Если КолОстаток >= Требуется Тогда
		Движение = Движения.ПередачиВПроизводство.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Документ = ДокументОснование.ДокументОснование;
		Движение.ВидМПЗ = ТЧ.ВидМПЗ;
		Движение.МПЗ = ТЧ.МПЗ;
		Движение.Количество = Требуется;
		Иначе
		Отказ = Истина;
		Сообщить("МПЗ: "+СокрЛП(ТЧ.МПЗ.Наименование)+" требуется: "+Требуется+" недостаёт в производстве: "+Строка(Требуется-КолОстаток));
		КонецЕсли;		 	
	КонецЦикла;
		Если Отказ Тогда
		Возврат;
		КонецЕсли; 
// регистр МестаХранения выпуск продукции
Движения.МестаХранения.Записывать = Истина;
// регистр ПланыВыпуска выпуск готовой продукции
Движения.ПланыВыпуска.Записывать = Истина;
Движение = Движения.МестаХранения.Добавить();
Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
Движение.Период = Дата;
Движение.МестоХранения = МестоХранения;
Движение.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
Движение.МПЗ = Изделие;
Движение.Количество = Количество;

Движение = Движения.ПланыВыпуска.Добавить();
Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
Движение.Период = Дата;
Движение.Подразделение = Подразделение;
Движение.Линейка = ДокументОснование.Линейка;
Движение.Номенклатура = Изделие;
Движение.МаршрутнаяКарта = ДокументОснование.ДокументОснование;
Движение.Количество = Количество; 
// регистр БракПроизводства
КолОстПВ = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(Дата+1,ДокументОснование.ДокументОснование);
	Если ОбщийМодульВызовСервера.АнализироватьБракПоМестуХранения(МестоХранения) Тогда //выпуск в брак
	Движения.БракПроизводства.Записывать = Истина;
	Движение = Движения.БракПроизводства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.МестоХранения = МестоХранения;
	Движение.ПроизводственноеЗадание = ДокументОснование;
	Движение.Линейка = ДокументОснование.Линейка;
	Движение.РабочееМесто = РабочееМесто;
	Движение.Изделие = Изделие;
	Движение.ВидБрака = ВидБрака;
	Движение.ЭтапЖизненногоЦикла = ЭтапЖизненногоЦикла;
	Движение.Документ = Ссылка;
	Движение.Количество = Количество;
	Иначе
	СписокМПЗ = Новый СписокЗначений;

	СписокМПЗ.Добавить(Изделие);
	ОбщийМодульРаботаСРегистрами.СнятиеСЛьготнойОчереди(СписокМПЗ,МестоХранения,Дата);
	КонецЕсли; 
		Если (КолОстПВ - Количество) <= 0 Тогда
		МТК = ДокументОснование.ДокументОснование.ПолучитьОбъект();
		МТК.Статус = 3;
		МТК.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли; 	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
	УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение,Дата));
	КонецЕсли;
КонецПроцедуры
