
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
		Если ВнутренниеСчета Тогда
		УстановитьНовыйНомер("ВН-");		
		Иначе	
		УстановитьНовыйНомер(Формат(Дата,"ДФ=гг")+"-");		
		КонецЕсли;
	КонецЕсли;			   
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
// регистр РезервированиеГП Приход
Движения.РезервированиеГП.Записывать = Истина;
Движения.ЗаказыНаПроизводство.Записывать = Истина;
Движения.Долги.Записывать = Истина;
	Для каждого ТЧ Из Заказ Цикл
		Если ТипЗнч(ТЧ.Продукция) = Тип("Неопределено") Тогда
		Продолжить;
		КонецЕсли;
			Если ТЧ.РезервСвободныйОстаток > 0 Тогда
				Если ТипЗнч(ТЧ.Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
				МестоХранения = ТЧ.Продукция.Линейка.МестоХраненияГП;
				Иначе				
				МестоХранения = Константы.МестоХраненияТНП.Получить();
				КонецЕсли; 
			Остаток = ОбщийМодульВызовСервера.ПолучитьНезарезервированныйОстатокПоМестуХранения(МестоХранения,ТЧ.Продукция,Дата);
				Если Остаток >= ТЧ.РезервСвободныйОстаток Тогда
				Движение = Движения.РезервированиеГП.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.МестоХранения = МестоХранения;
				Движение.Продукция = ТЧ.Продукция;
				Движение.Количество = ТЧ.РезервСвободныйОстаток;
				Движение.Документ = Ссылка;
				Иначе
				Отказ = Истина;
				Сообщить("Продукция "+СокрЛП(ТЧ.Продукция.Наименование)+" требуется зарезервировать: "+ТЧ.РезервСвободныйОстаток+" недостаёт на складе ГП: "+(ТЧ.РезервСвободныйОстаток - Остаток));
				КонецЕсли;
			КонецЕсли;
				Если ТЧ.РезервПерепрогон > 0 Тогда 
				МестоХраненияНеликвидов = Константы.МестоХраненияНеликвидов.Получить();
				Остаток = ОбщийМодульВызовСервера.ПолучитьНезарезервированныйОстатокПоМестуХранения(МестоХраненияНеликвидов,ТЧ.Продукция,Дата);
					Если Остаток >= ТЧ.РезервПерепрогон Тогда
					Движение = Движения.РезервированиеГП.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.МестоХранения = МестоХраненияНеликвидов;
					Движение.Продукция = ТЧ.Продукция;
					Движение.Количество = ТЧ.РезервПерепрогон;
					Движение.Документ = Ссылка;
					Иначе
					Отказ = Истина;
					Сообщить("Продукция "+СокрЛП(ТЧ.Продукция.Наименование)+" требуется зарезервировать: "+ТЧ.РезервПерепрогон+" недостаёт на складе неликвидов: "+(ТЧ.РезервПерепрогон - Остаток));
					КонецЕсли;
				КонецЕсли;
	// регистр ЗаказыНаПроизводство Приход		
			Если Не ТЧ.РучнойЗапуск Тогда
				Если (ТЧ.Количество + ТЧ.РезервПерепрогон) > 0 Тогда
				Движение = Движения.ЗаказыНаПроизводство.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Продукция = ТЧ.Продукция;
				Движение.Количество = ТЧ.Количество + ТЧ.РезервПерепрогон;
				Движение.Документ = Ссылка;
				Иначе
					Если Не ВнутренниеСчета Тогда
					ДВПЗ = РегистрыСведений.ДатыВыполненияПоПозициямЗНП.СоздатьМенеджерЗаписи();
					ДВПЗ.НомерЗНП = Номер;
					ДВПЗ.КодТовара = ТЧ.Товар.Код;
					ДВПЗ.ДатаВыполнения = Дата;
						Если ТипЗнч(ТЧ.Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
						ДВПЗ.ЗапрещеноКОтгрузке = ТЧ.Продукция.ЗапрещеноКОтгрузке;									
						КонецЕсли;
					ДВПЗ.Записать(Истина);
					КонецЕсли;				
				КонецЕсли;
			КонецЕсли;
	// регистр Долги Приход		
	Движение = Движения.Долги.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Продукция = ТЧ.Продукция;
	Движение.Количество = ТЧ.КоличествоВЗаказе;
	Движение.Документ = Ссылка;		
	КонецЦикла;
КонецПроцедуры
