
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет"); 
ОблНомерКолонка = Макет.ПолучитьОбласть("Номер|Колонка");
к = 1;
	Для каждого НомерВТ Из СписокНомеровВозвратнойТары Цикл	
	ОблНомерКолонка.Параметры.НомерВТ = НомерВТ.Значение;
		Если к = 1 Тогда
		ТабДок.Вывести(ОблНомерКолонка);		
		Иначе	
		ТабДок.Присоединить(ОблНомерКолонка);
			Если к = 3 Тогда
			к = 0;			
			КонецЕсли;
		КонецЕсли;	
	к = к + 1;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура СформироватьДляМОНаСервере()
ТабДок.Очистить();

Макет = ПолучитьОбщийМакет("QRКодТары");
ОблQRКод = Макет.ПолучитьОбласть("Этикетка");

	Для каждого НомерВТ Из СписокНомеровВозвратнойТары Цикл
	QRCode = НомерВТ.Значение;
	ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRCode, 0, 100);	
		Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
		КартинкаQRКода = Новый Картинка(ДанныеQRКода);
		ОблQRКод.Рисунки.QRCode.Картинка = КартинкаQRКода;
		Иначе
		Сообщить("Не удалось сформировать QR-код!");
		КонецЕсли;
	ОблQRКод.Параметры.Наименование = НомерВТ.Значение; 
	ОблQRКод.Параметры.МестоХранения = СокрЛП(МестоХранения.Наименование);
	ТабДок.Вывести(ОблQRКод);
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;   
ТабДок.РазмерСтраницы = "Custom";
ТабДок.ВысотаСтраницы = 101;
ТабДок.ШиринаСтраницы = 57;
ТабДок.ПолеСлева = 0;
ТабДок.ПолеСверху = 0;
ТабДок.ПолеСнизу = 0;
ТабДок.ПолеСправа = 0;
ТабДок.РазмерКолонтитулаСверху = 0;
ТабДок.РазмерКолонтитулаСнизу = 0; 
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если МестоХранения.Пустая() Тогда
	СформироватьНаСервере();	
	Иначе	
	СформироватьДляМОНаСервере();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоследовательность(Команда)
	Для к = НомераС По НомераПо Цикл
	СписокНомеровВозвратнойТары.Добавить(Формат(к,"ЧЦ=4; ЧВН=; ЧГ=0"));
	КонецЦикла; 
КонецПроцедуры
