
Процедура ОбработкаПроведения(Отказ, Режим)
// регистр ЗаявкиОтПокупателей Приход
Движения.ЗаявкиОтПокупателей.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
	Движение = Движения.ЗаявкиОтПокупателей.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = ТекСтрокаТабличнаяЧасть.ЗаявкаОтПокупателя.Договор;
	Движение.ДатаИсполнения = ТекСтрокаТабличнаяЧасть.ЗаявкаОтПокупателя.ДатаИсполнения;
	Движение.МПЗ = ТекСтрокаТабличнаяЧасть.МПЗ;
	Движение.Количество = ТекСтрокаТабличнаяЧасть.Количество;
	Движение.ЗаявкаОтПокупателя = ТекСтрокаТабличнаяЧасть.ЗаявкаОтПокупателя;
	КонецЦикла;
КонецПроцедуры
