
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Элементы.Значение1.МногострочныйРежим = Запись.ПараметрМатериала.Многострочный;
Элементы.Значение2.МногострочныйРежим = Запись.ПараметрМатериала.Многострочный;
	Если Запись.ПараметрМатериала.УсловиеПроверки <> Перечисления.УсловияПроверки.ВДиапазоне Тогда
	Элементы.Значение2.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Значение1ПриИзмененииНаСервере()
Элементы.Значение1.МногострочныйРежим = Запись.ПараметрМатериала.Многострочный;
КонецПроцедуры

&НаКлиенте
Процедура Значение1ПриИзменении(Элемент)
Значение1ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура Значение2ПриИзмененииНаСервере()
Элементы.Значение2.МногострочныйРежим = Запись.ПараметрМатериала.Многострочный;
КонецПроцедуры

&НаКлиенте
Процедура Значение2ПриИзменении(Элемент)
Значение2ПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПараметрТоварнойГруппыПриИзмененииНаСервере()
	Если Запись.ПараметрМатериала.УсловиеПроверки <> Перечисления.УсловияПроверки.ВДиапазоне Тогда
	Элементы.Значение2.Доступность = Ложь;
	Иначе
	Элементы.Значение2.Доступность = Истина;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПараметрТоварнойГруппыПриИзменении(Элемент)
ПараметрТоварнойГруппыПриИзмененииНаСервере();
КонецПроцедуры

