
&НаСервере
Процедура ДобавитьНоменклатуру(Наименование)
Номен = Справочники.Номенклатура.НайтиПоНаименованию(Наименование,Истина);
	Если Не Номен.Пустая() Тогда
	СписокИзделий.Добавить(Номен);			
	Иначе	
	Сообщить(Наименование+" - спецификация не найдена!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл cо спецификациями");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок; 
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка номенклатуры из файла...");
		ДобавитьНоменклатуру(СокрЛП(ExcelЛист.Cells(к,1).Value)); 
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПроектНаСервере()
	Для каждого Номен Из СписокИзделий Цикл
	НоменОбъект = Номен.Значение.ПолучитьОбъект();
	НоменОбъект.Проект = Проект;
	НоменОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПроект(Команда)
ДобавитьПроектНаСервере();
КонецПроцедуры
