
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	ТЧ.Статус = ПолучитьСтатус(ТЧ.МПЗ,Объект.Дата);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
СписокРазрешенныхРолей = Новый СписокЗначений;

СписокРазрешенныхРолей.Добавить("Администратор");
СписокРазрешенныхРолей.Добавить("Мастер");
СписокРазрешенныхРолей.Добавить("ГлавныйДиспетчер");
ЭтотОбъект.ТолькоПросмотр = ОбщийМодульСозданиеДокументов.ЗапретРедактирования(Объект.Ссылка,Ложь,Истина,СписокРазрешенныхРолей);
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
   Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
      ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьМПЗПриИзменении(Элемент)
ТабличнаяЧастьМПЗПриИзмененииНаСервере(Элементы.ТабличнаяЧасть.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьМПЗПриИзмененииНаСервере(Стр)
ТЧ = Объект.ТабличнаяЧасть.НайтиПоИдентификатору(Стр);
ТЧ.ЕдиницаИзмерения = ТЧ.МПЗ.ОсновнаяЕдиницаИзмерения;
ТЧ.Статус = ПолучитьСтатус(ТЧ.МПЗ,Объект.Дата);
КонецПроцедуры

&НаСервере
Процедура ПодборМПЗНаСервере(ТаблицаМПЗ)
	Для каждого ТЧ_МПЗ Из ТаблицаМПЗ Цикл
	ТЧ = Объект.ТабличнаяЧасть.Добавить();
	ТЧ.Статус = ПолучитьСтатус(ТЧ_МПЗ.МПЗ,Объект.Дата); 
	ТЧ.МПЗ = ТЧ_МПЗ.МПЗ;
	ТЧ.Количество = ТЧ_МПЗ.Количество;
	ТЧ.ЕдиницаИзмерения = ТЧ_МПЗ.ЕдиницаИзмерения;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПодборМПЗ(Команда)
ТаблицаМПЗ = ОткрытьФормуМодально("ОбщаяФорма.ПодборМПЗ", Новый Структура("МестоХранения",Неопределено));
	Если ТаблицаМПЗ <> Неопределено Тогда
		Если ТаблицаМПЗ.Количество() > 0 Тогда
			Если Объект.ТабличнаяЧасть.Количество() > 0 Тогда
				Если Вопрос("Очистить таблицу?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.ТабличнаяЧасть.Очистить();		
				КонецЕсли; 			
			КонецЕсли; 
		ПодборМПЗНаСервере(ТаблицаМПЗ);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьДП(МПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорныеПозицииСрезПоследних.Цена,
	|	ДоговорныеПозицииСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.ДоговорныеПозиции.СрезПоследних КАК ДоговорныеПозицииСрезПоследних
	|ГДЕ
	|	ДоговорныеПозицииСрезПоследних.ДоговорнаяПозиция.МПЗ = &МПЗ
	|	И ДоговорныеПозицииСрезПоследних.ДоговорнаяПозиция.ПометкаУдаления = ЛОЖЬ";
Запрос.УстановитьПараметр("МПЗ", МПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(Новый Структура("Цена,Валюта",ВыборкаДетальныеЗаписи.Цена,ВыборкаДетальныеЗаписи.Валюта));
	КонецЦикла;
Возврат(Новый Структура("Цена,Валюта","",""));
КонецФункции

&НаСервере
Функция ПечатьНаСервере()
ТабДок = Новый ТабличныйДокумент;

Макет = Документы.ЗаявкаНаЗакупку.ПолучитьМакет("Макет");
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблПодвал = Макет.ПолучитьОбласть("Подвал");
ОблШапка.Параметры.НазваниеОрганизации = Константы.НазваниеОрганизации.Получить();
ОблШапка.Параметры.Подразделение = Объект.Подразделение;
ОблШапка.Параметры.НомерДок = Объект.Номер;
ОблШапка.Параметры.ДатаДок = Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);
НомерСтроки = 1;
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	ОблСтрока.Параметры.НомерСтроки = НомерСтроки;	
	ОблСтрока.Параметры.Наименование = СокрЛП(ТЧ.МПЗ.Наименование);
	ОблСтрока.Параметры.ЕдиницаИзмерения = СокрЛП(ТЧ.ЕдиницаИзмерения.Наименование);
	ОблСтрока.Параметры.Количество = Формат(ТЧ.Количество,"ЧЦ=14; ЧДЦ=3; ЧРД=.");	
	ОблСтрока.Параметры.Артикул = СокрЛП(ТЧ.МПЗ.Артикул);
	ОблСтрока.Параметры.ОписаниеМодели = СокрЛП(ТЧ.МПЗ.ОписаниеМодели);
	Результат = ПолучитьДП(ТЧ.МПЗ);
	ОблСтрока.Параметры.Цена = Результат.Цена;
	ОблСтрока.Параметры.Валюта = Результат.Валюта;
	ТабДок.Вывести(ОблСтрока);
	НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 
ТабДок.Вывести(ОблПодвал);
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	Если ЭтаФорма.Модифицированность Тогда	
	Сообщить("Для печати документ необходимо перепровести.");
	Возврат;		
	КонецЕсли;
ТД = ПечатьНаСервере();
ТД.Показать("Печать заявки");
КонецПроцедуры
    
&НаСервере
Функция ПолучитьЦенуПоследнегоПоступления(МПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеМПЗТабличнаяЧасть.МПЗ КАК МПЗ,
	|	ПоступлениеМПЗТабличнаяЧасть.Цена КАК Цена,
	|	ПоступлениеМПЗТабличнаяЧасть.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ПоступлениеМПЗ.ТабличнаяЧасть КАК ПоступлениеМПЗТабличнаяЧасть
	|ГДЕ
	|	ПоступлениеМПЗТабличнаяЧасть.МПЗ = &МПЗ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
Запрос.УстановитьПараметр("МПЗ", МПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Цена/ОбщийМодульВызовСервера.КурсДляВалюты(Справочники.Валюты.НайтиПоКоду("840"),ВыборкаДетальныеЗаписи.Дата));
	КонецЦикла; 
Возврат(0);
КонецФункции

&НаСервере
Функция ПечатьТНПНаСервере()
ТабДок = Новый ТабличныйДокумент;

Макет = Документы.ЗаявкаНаЗакупку.ПолучитьМакет("Макет2");
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблПодвал = Макет.ПолучитьОбласть("Подвал");
ОблШапка.Параметры.НазваниеОрганизации = Константы.НазваниеОрганизации.Получить();
ОблШапка.Параметры.Подразделение = Объект.Подразделение;
ОблШапка.Параметры.НомерДок = Объект.Номер;
ОблШапка.Параметры.ДатаДок = Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);
НомерСтроки = 1;
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	ОблСтрока.Параметры.НомерСтроки = НомерСтроки;
	ОблСтрока.Параметры.Статус = ПолучитьСтатус(ТЧ.МПЗ);	
	ОблСтрока.Параметры.Наименование = СокрЛП(ТЧ.МПЗ.Наименование);
	ОблСтрока.Параметры.ЕдиницаИзмерения = СокрЛП(ТЧ.ЕдиницаИзмерения.Наименование);
	ОблСтрока.Параметры.Количество = Формат(ТЧ.Количество,"ЧЦ=14; ЧДЦ=3; ЧРД=.");	
	ОблСтрока.Параметры.Артикул = СокрЛП(ТЧ.МПЗ.Артикул);
	ОблСтрока.Параметры.ОписаниеМодели = СокрЛП(ТЧ.МПЗ.ОписаниеМодели);
	ОблСтрока.Параметры.PartNumber = СокрЛП(ТЧ.МПЗ.PartNumber);
	РПДО = РегистрыСведений.ПараметрыДляОтгрузки.Выбрать(Новый Структура("Товар",ТЧ.МПЗ));
		Пока РПДО.Следующий() Цикл
		ОблСтрока.Параметры.КодТНВЭД = РПДО.КодТНВЭД;
		ОблСтрока.Параметры.ВесНетто = РПДО.ВесНетто;		
		КонецЦикла;
	ОблСтрока.Параметры.Цена = ПолучитьЦенуПоследнегоПоступления(ТЧ.МПЗ);
	ТабДок.Вывести(ОблСтрока);
	НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 
ТабДок.Вывести(ОблПодвал);
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура ПечатьТНП(Команда)
	Если ЭтаФорма.Модифицированность Тогда	
	Сообщить("Для печати документ необходимо перепровести.");
	Возврат;		
	КонецЕсли;
ТД = ПечатьТНПНаСервере();
ТД.Показать("Печать заявки на ТНП");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДвижения(Команда)
ИмяОтчета = "ОтчётПоРегиструЗаявкиНаЗакупку";
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
ПараметрыФормы.Вставить("ПользовательскиеНастройки",ОбщийМодульВызовСервера.ЗаполнитьПользовательскиеНастройкиОтчетаСКД(ИмяОтчета,Объект.Дата,ТекущаяДата(),Новый Структура("ЗаявкаНаЗакупку",Объект.Ссылка),"ПоЗаявкам"));
ПараметрыФормы.Вставить("КлючВарианта","ПоЗаявкам"); 
ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Отказ = Не ЭтаФорма.ПроверитьЗаполнение();
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоQRКодуНаСервере(Данные)
Массив = ОбщийМодульВызовСервера.РазложитьСтрокуВМассив(Данные,";");
МПЗ = ЗначениеИзСтрокиВнутр(Массив[0]);
	Если ТипЗнч(МПЗ) = Тип("СправочникСсылка.Материалы") Тогда	
	ТЧ = Объект.ТабличнаяЧасть.Добавить();
	ТЧ.МПЗ = МПЗ;
	ТЧ.Количество = Число(Массив[1]);
	ТЧ.ЕдиницаИзмерения = МПЗ.ОсновнаяЕдиницаИзмерения;
	Иначе
	Сообщить("Неверный QR-код!");		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ЭтаФорма.ВводДоступен() Тогда
	ДобавитьПоQRКодуНаСервере(Данные);
	КонецЕсли;
КонецПроцедуры
