
&НаСервере
Функция ПолучитьПутьКБазеПроизводства()
Возврат Константы.ПутьКБазе1СПроизводство.Получить();
КонецФункции

&НаСервере
Функция НайтиМатериалПоНаименованию(Наименование)
Возврат(Справочники.Материалы.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаСервере
Процедура СоздатьЗаказПоставщику(НомерЗаказа)
ЗаказПоставщику = Документы.ЗаказПоставщику.СоздатьДокумент();
ЗаказПоставщику.Номер = НомерЗаказа;
ЗаказПоставщику.Подразделение = Подразделение;
ЗаказПоставщику.Автор = ПараметрыСеанса.Пользователь;
ЗаказПоставщику.Дата = ДатаДокумента;
ЗаказПоставщику.ДатаИсполнения = ДатаИсполнения;
ЗаказПоставщику.Контрагент = Контрагент;
ЗаказПоставщику.Курс = ОбщийМодульВызовСервера.КурсДляВалюты(ЗаказПоставщику.Договор.Валюта,ДатаДокумента);
ЗаказПоставщику.Дополнение = Дополнение;
ЗаказПоставщику.Комментарий = Комментарий;
	Для каждого ТЧ_МПЗ Из ТаблицаМПЗ Цикл
	ТЧ = ЗаказПоставщику.ТабличнаяЧасть.Добавить();
	ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
	ТЧ.МПЗ = ТЧ_МПЗ.МПЗ;
	ТЧ.Количество = ТЧ_МПЗ.Количество;
	ТЧ.ЕдиницаИзмерения = ТЧ_МПЗ.МПЗ.ОсновнаяЕдиницаИзмерения;
	ТЧ.Цена = ТЧ_МПЗ.Цена;
	ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;
	ТЧ.Всего = ТЧ.Сумма;
	ТЧ.НЦ = Истина;				
	КонецЦикла; 
		Если ЗаказПоставщику.ТабличнаяЧасть.Количество() > 0 Тогда
		ЗаказПоставщику.Записать(РежимЗаписиДокумента.Запись);
		Иначе
		Сообщить("Табличная часть документа пустая! Заказ поставщику "+НомерЗаказа+" не создан!");
		КонецЕсли;
КонецПроцедуры
 
&НаСервере
Функция ПолучитьКонтрагента(Наименование)
Возврат(Справочники.Контрагенты.НайтиПоНаименованию(Наименование,Истина));
КонецФункции

&НаСервере
Функция ПолучитьВалюту(Код)
Возврат(Справочники.Валюты.НайтиПоКоду(Код));
КонецФункции

&НаСервере
Функция ПроверитьЗаказ(НомерЗаказа)
Возврат(Не Документы.ЗаказПоставщику.НайтиПоНомеру(НомерЗаказа,ТекущаяДата()).Пустая());
КонецФункции

&НаКлиенте
Процедура Соединиться(Команда)
НастройкиОбменаДанными = ОбщийМодульСинхронизации.ПолучитьНастройкиОбменаДанными("Производство");
V7 = ОбщийМодульКлиент.ПодключитьсяК1С77(НастройкиОбменаДанными.ПутьКБазеДанных,Объект.ИмяПользователя,Объект.Пароль);
	Если V7 = Неопределено Тогда
	Возврат;	
	КонецЕсли;
Док = V7.CreateObject("Документ.Заказ");
 
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c заказами");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	НомерЗаказаТекущий = "";
	флСоздатьДокумент = Ложь; 
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка заказов из файла...");
		НомерЗаказа = СокрЛП(ExcelЛист.Cells(к,1).Value);
			Если Не ЗначениеЗаполнено(НомерЗаказа) Тогда
			Продолжить;
			КонецЕсли; 
				Если ПроверитьЗаказ(НомерЗаказа) Тогда
				Сообщить("Заказ поставщику "+НомерЗаказа+" уже создан!");
				Продолжить;
				КонецЕсли;
			Если НомерЗаказа <> НомерЗаказаТекущий Тогда
				Если ЗначениеЗаполнено(НомерЗаказаТекущий) Тогда
					Если флСоздатьДокумент Тогда
					СоздатьЗаказПоставщику(НомерЗаказаТекущий);				
					КонецЕсли; 
				КонецЕсли; 	
			флСоздатьДокумент = Истина;
			ТаблицаМПЗ.Очистить(); 
				Если Док.НайтиПоНомеру(СокрЛП(НомерЗаказа),Формат(ТекущаяДата(),"ДФ=dd.MM.yy")) = 1 Тогда
				ДатаДокумента = Док.ДатаДок;
				ДатаИсполнения = Док.ДатаИсполнения;
				Дополнение = Док.Дополнение;
				Комментарий = Док.Комментарий;
				НаименованиеКонтрагента = СокрЛП(Док.Контрагент.Наименование);
				Контрагент = ПолучитьКонтрагента(НаименованиеКонтрагента);
					Если Не Контрагент.Пустая() Тогда
					Валюта = ПолучитьВалюту(Док.Валюта.Код);
						Если Валюта.Пустая() Тогда
						флСоздатьДокумент = Ложь;
						Сообщить(СокрЛП(Док.Валюта.Наименование) + " - валюта не найдена!");
						КонецЕсли;
					Иначе
					флСоздатьДокумент = Ложь;
					Сообщить(НаименованиеКонтрагента + " - контрагент не найден!");
					КонецЕсли;
				Иначе
				флСоздатьДокумент = Ложь;
				Сообщить("Заказ поставщику "+НомерЗаказа+" не найден!");
				КонецЕсли;
			НомерЗаказаТекущий = НомерЗаказа;
			КонецЕсли;
				Если флСоздатьДокумент Тогда
				НаименованиеМПЗ = СокрЛП(ExcelЛист.Cells(к,2).Value);
				МПЗ = НайтиМатериалПоНаименованию(НаименованиеМПЗ);
					Если Не МПЗ.Пустая() Тогда
					ТЧ = ТаблицаМПЗ.Добавить();
					ТЧ.МПЗ = МПЗ;
					ТЧ.Количество = ExcelЛист.Cells(к,3).Value;
					Док.ВыбратьСтроки();
						Пока Док.ПолучитьСтроку() = 1 Цикл
							Если СокрЛП(Док.Товар.Наименование) = НаименованиеМПЗ Тогда		
							ТЧ.Цена = Док.Цена;
							Прервать;
							КонецЕсли; 			
						КонецЦикла;
					Иначе
					флСоздатьДокумент = Ложь;
					Сообщить(НаименованиеМПЗ + " - МПЗ не найдена!");
					КонецЕсли;			
				КонецЕсли;  
	    КонецЦикла;
	Результат.Excel.Quit();
		Если флСоздатьДокумент Тогда
		СоздатьЗаказПоставщику(НомерЗаказаТекущий);				
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
