
&НаСервере
Функция ЭтоЛинейкаКанбан(ПЗ)
Возврат(?(ПЗ.Линейка.ВидЛинейки = Перечисления.ВидыЛинеек.Канбан,Истина,Ложь));
КонецФункции

&НаСервере
Функция ПолучитьЛинейку(ПЗ)
Возврат(ПЗ.Линейка);
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если Не ЭтоЛинейкаКанбан(ПараметрКоманды) Тогда
		Если ОбщийМодульВызовСервера.МожноВыполнить(ПолучитьЛинейку(ПараметрКоманды)) Тогда
		Результат = Вопрос("Все подчиненные документы и дата запуска будут удалены! 
						   |Производственное задание перейдёт на начальный этап производства!
				           |Вы уверены, что хотите отменить запуск?",РежимДиалогаВопрос.ДаНет,,,"Удаление");
			Если Результат = КодВозвратаДиалога.Да Тогда
				Если ОбщийМодульВызовСервера.ОтменаЗапускаПЗ(ПараметрКоманды) Тогда
				ПоказатьОповещениеПользователя("ВНИМАНИЕ!",,"Запуск отменён!");		
				КонецЕсли;
			КонецЕсли;
		Иначе
		Сообщить("Для данной линейки нельзя отменить запуск ПЗ в данной базе!");
		КонецЕсли;
	Иначе
	Сообщить("Нельзя отменить запуск ПЗ на линейке канбанов!");
	КонецЕсли;
КонецПроцедуры
