
&НаСервере
Функция РассчитатьНаСервере()
Запрос = Новый Запрос;
ЗапросПП = Новый Запрос;
СписокПЗ = Новый СписокЗначений;
ТаблицаМПЗ = Новый ТаблицаЗначений;

ТаблицаМПЗ.Колонки.Добавить("МПЗ",Новый ОписаниеТипов("СправочникСсылка.Материалы"));
ТаблицаМПЗ.Колонки.Добавить("Количество");

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииПоступление.Ссылка.ДокументОснование КАК ПЗ
	|ИЗ
	|	Документ.ВыпускПродукции.Поступление КАК ВыпускПродукцииПоступление
	|ГДЕ
	|	ВыпускПродукцииПоступление.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВыпускПродукцииПоступление.Ссылка.НаСклад = ИСТИНА
	|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)";
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаПЗ = РезультатЗапроса.Выбрать();
	Пока ВыборкаПЗ.Следующий() Цикл
	ЗапросПП.Текст = 
		"ВЫБРАТЬ
		|	ПередачаВПроизводствоСпецификация.МПЗ КАК МПЗ
		|ИЗ
		|	Документ.ПередачаВПроизводство.Спецификация КАК ПередачаВПроизводствоСпецификация
		|ГДЕ
		|	ПередачаВПроизводствоСпецификация.Ссылка.ДокументОснование = &ДокументОснование
		|	И ПередачаВПроизводствоСпецификация.МПЗ В ИЕРАРХИИ(&СписокМПЗ)";
	ЗапросПП.УстановитьПараметр("ДокументОснование", ВыборкаПЗ.ПЗ);
	ЗапросПП.УстановитьПараметр("СписокМПЗ", СписокГруппМПЗ);
	РезультатЗапроса = ЗапросПП.Выполнить();
	ВыборкаМПЗ = РезультатЗапроса.Выбрать();
		Пока ВыборкаМПЗ.Следующий() Цикл			
		ТЧ = ТаблицаМПЗ.Добавить();
		ТЧ.МПЗ = ВыборкаМПЗ.МПЗ;
			Если Лев(ВыборкаПЗ.ПЗ.Изделие.Товар.Наименование,1) = "2" Тогда
			ТЧ.Количество = Объект.Прирост*2;
			Иначе	
			ТЧ.Количество = Объект.Прирост;			
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;
ТаблицаМПЗ.Свернуть("МПЗ","Количество");
Подразделение = СписокЛинеек[0].Значение.Подразделение;
Списание = Документы.СписаниеМПЗПрочее.СоздатьДокумент();
Списание.Дата = ТекущаяДата();
Списание.УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение));
Списание.Автор = ПараметрыСеанса.Пользователь;
Списание.Подразделение = Подразделение;
Списание.МестоХранения = МестоХранения;
Списание.Статья = СтатьяСписания;
Списание.Комментарий = "Технологические потери за период с "+Формат(Объект.Период.ДатаНачала,"ДФ=dd.MM.yyyy")+" по "+Формат(Объект.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ВыборкаМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Для каждого ТЧ Из ТаблицаМПЗ Цикл
		Если ТЧ.Количество > 0 Тогда
		ТЧ_С = Списание.ТабличнаяЧасть.Добавить();
		ТЧ_С.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
		ТЧ_С.МПЗ = ТЧ.МПЗ;
		ТЧ_С.Количество = ТЧ.Количество;
		ТЧ_С.ЕдиницаИзмерения = ТЧ.МПЗ.ОсновнаяЕдиницаИзмерения;
		КонецЕсли;
	КонецЦикла;
Списание.Записать(РежимЗаписиДокумента.Запись);
Возврат(Списание.Ссылка);
КонецФункции

&НаКлиенте
Процедура Рассчитать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Док = РассчитатьНаСервере();
	ОткрытьФорму("Документ.СписаниеМПЗПрочее.ФормаОбъекта",Новый Структура("Ключ",Док));
	КонецЕсли; 
КонецПроцедуры
