
&НаСервере
Функция ПолучитьРабочееМесто()
ЭПЗ = РегистрыСведений.ЭтапыПроизводственныхЗаданий.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("ПЗ",Объект.ПроизводственноеЗадание));
Возврат(ЭПЗ.РабочееМесто);
КонецФункции

&НаСервере
Функция ПолучитьКоличество()
Возврат(Объект.ПроизводственноеЗадание.Количество);
КонецФункции

&НаКлиенте
Процедура ОтправитьВРемонт(Команда)	
ОткрытьФормуМодально("ОбщаяФорма.ОформлениеРемонтКанбан",Новый Структура("РабочееМесто,ПЗ,КоличествоИзделия",ПолучитьРабочееМесто(),Объект.ПроизводственноеЗадание,ПолучитьКоличество()));
КонецПроцедуры

&НаКлиенте
Процедура ЛинейкаПриИзменении(Элемент)
ЛинейкаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЛинейкаПриИзмененииНаСервере()
	Если Объект.Линейка.Подразделение.МестоХраненияРемонта.Пустая() Тогда
	Объект.Линейка = Справочники.Линейки.ПустаяСсылка();
	Сообщить("Нельзя выбирать линейку подразделения с незаполненным местом хранения ремонта!");
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводственноеЗаданиеПриИзменении(Элемент)
ПроизводственноеЗаданиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроизводственноеЗаданиеПриИзмененииНаСервере()
	Если Объект.ПроизводственноеЗадание.ДокументОснование.Статус <> 3 Тогда
	Объект.ПроизводственноеЗадание = Документы.ПроизводственноеЗадание.ПустаяСсылка();
	Сообщить("Выберите завершённое производственное задание!");	
	КонецЕсли; 	
КонецПроцедуры
