
&НаСервере
Функция ПечатьQRКодыНаСервере(СписокЯчеек)
ТабДок = Новый ТабличныйДокумент;

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("Макет"); 
ОблЯчейкаКолонка = Макет.ПолучитьОбласть("Ячейка|Колонка");
к = 1;
	Для каждого Ячейка Из СписокЯчеек Цикл
	QRCode = "Ячейка;"+ЗначениеВСтрокуВнутр(Ячейка.Значение);
	ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRCode, 0, 100);	
		Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
		КартинкаQRКода = Новый Картинка(ДанныеQRКода);
		ОблЯчейкаКолонка.Рисунки.QRCode.Картинка = КартинкаQRКода;
		Иначе
		Сообщить("Не удалось сформировать QR-код!");
		КонецЕсли;
	ОблЯчейкаКолонка.Параметры.Ячейка = СокрЛП(Ячейка.Значение.Наименование); 
		Если к = 1 Тогда
		ТабДок.Вывести(ОблЯчейкаКолонка);		
		Иначе	
		ТабДок.Присоединить(ОблЯчейкаКолонка);
			Если к = 3 Тогда
			к = 0;			
			КонецЕсли;
		КонецЕсли;	
	к = к + 1;
	КонецЦикла;
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура ПечатьQRКоды(Команда)
СписокЯчеек = Новый СписокЗначений;

	Для каждого ТЧ из Элементы.Список.ВыделенныеСтроки Цикл
	СписокЯчеек.Добавить(ТЧ); 
	КонецЦикла;
ТД = ПечатьQRКодыНаСервере(СписокЯчеек);
	Если ТД <> Неопределено Тогда
	ТД.Показать("QR-коды ячеек хранения");
	КонецЕсли; 
КонецПроцедуры
