
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.МПЗ <> Неопределено Тогда
	ЕдиницаИзмерения = Объект.МПЗ.ЕдиницаИзмерения;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ЭтотОбъект.ТолькоПросмотр = ОбщийМодульСозданиеДокументов.ЗапретРедактирования(Объект.Ссылка,Истина,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МПЗПриИзменении(Элемент)
МПЗПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура МПЗПриИзмененииНаСервере()
	Если Объект.МПЗ <> Неопределено Тогда
	ЕдиницаИзмерения = Объект.МПЗ.ЕдиницаИзмерения;
	КонецЕсли;
КонецПроцедуры
